[
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.wxpn fb:broadcast.radio_station.owner ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "University of Pennsylvania"
    ], 
    "targetFormula": "(!fb:broadcast.radio_station.owner fb:en.wxpn)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.068395 fb:broadcast.radio_station.owner ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "who owns wxpn", 
    "id": 1
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.flickr fb:internet.website.owner ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Yahoo!"
    ], 
    "targetFormula": "(!fb:internet.website.owner fb:en.flickr)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.04dtx9 fb:internet.website.owner ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "who owns flickr", 
    "id": 2
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.nivea fb:organization.organization.founders ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [], 
    "targetFormula": "(!fb:organization.organization.founders fb:en.nivea)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.03vzwk fb:organization.organization.founders ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "who founded nivea", 
    "id": 3
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.girl_scouts_of_the_usa fb:organization.organization.founders ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Juliette Gordon Low"
    ], 
    "targetFormula": "(!fb:organization.organization.founders fb:en.girl_scouts_of_the_usa)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.01r3kd fb:organization.organization.founders ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "who founded gsusa", 
    "id": 4
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:en.rna_binding fb:biology.gene_ontology_group.description ?x1 } LIMIT 9999", 
    "result": [
      "Interacting selectively with an RNA molecule or a portion thereof."
    ], 
    "targetFormula": "(!fb:biology.gene_ontology_group.description fb:en.rna_binding)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.02l2hm7 fb:biology.gene_ontology_group.description ?x1 } LIMIT 9999", 
    "utterance": "what is rna binding", 
    "id": 6
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.tomkat fb:celebrities.supercouple.partners ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Tom Cruise", 
      "Katie Holmes"
    ], 
    "targetFormula": "(!fb:celebrities.supercouple.partners fb:en.tomkat)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.02vkczn fb:celebrities.supercouple.partners ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "who makes up tomkat", 
    "id": 7
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.neon fb:chemistry.chemical_element.discoverer ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Morris Travers", 
      "William Ramsay"
    ], 
    "targetFormula": "(!fb:chemistry.chemical_element.discoverer fb:en.neon)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.025s4r0 fb:chemistry.chemical_element.discoverer ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "who discovered neon", 
    "id": 8
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.superman fb:comic_books.comic_book_character.created_by ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Joe Shuster", 
      "Jerry Siegel"
    ], 
    "targetFormula": "(!fb:comic_books.comic_book_character.created_by fb:en.superman)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.070vn fb:comic_books.comic_book_character.created_by ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "who created superman", 
    "id": 9
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.pauwel_kwak fb:food.beer.brewery_brand ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Brewery Bosteels"
    ], 
    "targetFormula": "(!fb:food.beer.brewery_brand fb:en.pauwel_kwak)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.0f7987 fb:food.beer.brewery_brand ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "who brews pauwel kwak", 
    "id": 10
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.scrabble fb:law.invention.inventor ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Alfred Mosher Butts"
    ], 
    "targetFormula": "(!fb:law.invention.inventor fb:en.scrabble)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.06ynv fb:law.invention.inventor ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "who invented scrabble", 
    "id": 11
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:en.omarion_grandberry fb:people.person.date_of_birth ?x1 } LIMIT 9999", 
    "result": [
      "1984-11-12"
    ], 
    "targetFormula": "(!fb:people.person.date_of_birth fb:en.omarion_grandberry)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.019g40 fb:people.person.date_of_birth ?x1 } LIMIT 9999", 
    "utterance": "when was omarion born", 
    "id": 12
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.spock fb:fictional_universe.fictional_character.species ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Human", 
      "Vulcan"
    ], 
    "targetFormula": "(!fb:fictional_universe.fictional_character.species fb:en.spock)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.0f13t fb:fictional_universe.fictional_character.species ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what species is spock", 
    "id": 13
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:en.africa fb:location.location.area ?x1 } LIMIT 9999", 
    "result": [
      "30221532"
    ], 
    "targetFormula": "(!fb:location.location.area fb:en.africa)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.0dg3n1 fb:location.location.area ?x1 } LIMIT 9999", 
    "utterance": "what is africa 's area", 
    "id": 14
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.0flmt0 fb:amusement_parks.ride.opened ?x1 } LIMIT 9999", 
    "result": [
      "1999-04-17"
    ], 
    "targetFormula": "(!fb:amusement_parks.ride.opened fb:m.0flmt0)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.0flmt0 fb:amusement_parks.ride.opened ?x1 } LIMIT 9999", 
    "utterance": "when did invertigo open", 
    "id": 15
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 ?x2name WHERE { ?x1 fb:organization.leadership.role fb:en.chief_executive_officer . FILTER (?x1 != fb:en.chief_executive_officer) . ?x1 fb:organization.leadership.organization fb:en.apple_inc . FILTER (?x1 != fb:en.apple_inc) . ?x1 fb:organization.leadership.person ?x2 . OPTIONAL { ?x2 fb:type.object.name ?x2name } } LIMIT 9999", 
    "result": [
      "John Sculley", 
      "Michael Scott", 
      "Gil Amelio", 
      "Timothy D. Cook", 
      "Mike Markkula", 
      "Steve Jobs", 
      "Michael Spindler"
    ], 
    "targetFormula": "(!fb:organization.leadership.person (and ((lambda x (fb:organization.leadership.role (var x))) fb:en.chief_executive_officer) ((lambda x (fb:organization.leadership.organization (var x))) fb:en.apple_inc)))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 ?x2name WHERE { ?x1 fb:organization.leadership.role fb:m.0dq_5 . FILTER (?x1 != fb:m.0dq_5) . ?x1 fb:organization.leadership.organization fb:m.0k8z . FILTER (?x1 != fb:m.0k8z) . ?x1 fb:organization.leadership.person ?x2 . OPTIONAL { ?x2 fb:type.object.name ?x2name } } LIMIT 9999", 
    "utterance": "who is the ceo of apple", 
    "id": 16
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.big_daddy fb:film.film.rating ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "PG-13 (USA)"
    ], 
    "targetFormula": "(!fb:film.film.rating fb:en.big_daddy)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.02hxhz fb:film.film.rating ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what is big daddy rated", 
    "id": 17
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.iphone fb:computer.computer.key_designers ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Jonathan Ive"
    ], 
    "targetFormula": "(!fb:computer.computer.key_designers fb:en.iphone)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.027lnzs fb:computer.computer.key_designers ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "who designed the iphone", 
    "id": 18
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:en.seabiscuit fb:biology.organism.height_meters ?x1 } LIMIT 9999", 
    "result": [
      "1.57"
    ], 
    "targetFormula": "(!fb:biology.organism.height_meters fb:en.seabiscuit)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.01g14f fb:biology.organism.height_meters ?x1 } LIMIT 9999", 
    "utterance": "how tall was seabiscuit", 
    "id": 19
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:en.sigmod fb:organization.organization.date_founded ?x1 } LIMIT 9999", 
    "result": [], 
    "targetFormula": "(!fb:organization.organization.date_founded fb:en.sigmod)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.0fcglc fb:organization.organization.date_founded ?x1 } LIMIT 9999", 
    "utterance": "when was sigmod founded", 
    "id": 21
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.the_hobbit fb:fictional_universe.work_of_fiction.setting ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Mirkwood"
    ], 
    "targetFormula": "(!fb:fictional_universe.work_of_fiction.setting fb:en.the_hobbit)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.07g75 fb:fictional_universe.work_of_fiction.setting ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "where is the hobbit set", 
    "id": 22
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:en.target_corporation fb:organization.organization.date_founded ?x1 } LIMIT 9999", 
    "result": [
      "1902"
    ], 
    "targetFormula": "(!fb:organization.organization.date_founded fb:en.target_corporation)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.01b39j fb:organization.organization.date_founded ?x1 } LIMIT 9999", 
    "utterance": "when was target founded", 
    "id": 23
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 ?x2name WHERE { ?x1 fb:soccer.football_team_management_tenure.team fb:en.fulham_fc . FILTER (?x1 != fb:en.fulham_fc) . ?x1 fb:soccer.football_team_management_tenure.manager ?x2 . OPTIONAL { ?x2 fb:type.object.name ?x2name } } LIMIT 9999", 
    "result": [
      "Roy Hodgson", 
      "Martin Jol"
    ], 
    "targetFormula": "(!fb:soccer.football_team_management_tenure.manager ((lambda x (fb:soccer.football_team_management_tenure.team (var x))) fb:en.fulham_fc))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 ?x2name WHERE { ?x1 fb:soccer.football_team_management_tenure.team fb:m.02_lt . FILTER (?x1 != fb:m.02_lt) . ?x1 fb:soccer.football_team_management_tenure.manager ?x2 . OPTIONAL { ?x2 fb:type.object.name ?x2name } } LIMIT 9999", 
    "utterance": "who manages fulham f. c.", 
    "id": 24
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:en.borders_group fb:organization.organization.date_founded ?x1 } LIMIT 9999", 
    "result": [
      "1971"
    ], 
    "targetFormula": "(!fb:organization.organization.date_founded fb:en.borders_group)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.0mdv8 fb:organization.organization.date_founded ?x1 } LIMIT 9999", 
    "utterance": "when was borders founded", 
    "id": 25
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { ?x1 fb:internet.blog.language fb:en.german_language . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Oslog.tv", 
      "www.behmel.de", 
      "neusprech.org", 
      "interaktionsblog.de"
    ], 
    "targetFormula": "(fb:internet.blog.language fb:en.german_language)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { ?x1 fb:internet.blog.language fb:m.04306rv . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what blogs are in german", 
    "id": 26
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.doonesbury fb:comic_strips.comic_strip.genre ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Politics", 
      "Satire", 
      "Humour"
    ], 
    "targetFormula": "(!fb:comic_strips.comic_strip.genre fb:en.doonesbury)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.0299q fb:comic_strips.comic_strip.genre ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what genre is doonesbury", 
    "id": 27
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:en.secretariat fb:biology.deceased_organism.date_of_death ?x1 } LIMIT 9999", 
    "result": [
      "1989-10-04"
    ], 
    "targetFormula": "(!fb:biology.deceased_organism.date_of_death fb:en.secretariat)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.0gv_l fb:biology.deceased_organism.date_of_death ?x1 } LIMIT 9999", 
    "utterance": "when did secretariat die", 
    "id": 28
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 ?x2name WHERE { ?x1 fb:award.award_honor.honored_for fb:en.lost . FILTER (?x1 != fb:en.lost) . ?x1 fb:award.award_honor.award ?x2 . OPTIONAL { ?x2 fb:type.object.name ?x2name } } LIMIT 9999", 
    "result": [
      "Peabody Award", 
      "Screen Actors Guild Award for Outstanding Performance by an Ensemble in a Drama Series", 
      "Primetime Emmy Award for Outstanding Casting for a Drama Series", 
      "Primetime Emmy Award for Outstanding Special Visual Effects For A Series", 
      "Primetime Emmy Award for Outstanding Drama Series", 
      "Primetime Emmy Award for Outstanding Supporting Actor - Drama Series", 
      "Golden Globe Award for Best Television Series \u2013 Drama", 
      "Norman Felton Producer of the Year Award in Episodic Television - Drama", 
      "Primetime Emmy Award for Outstanding Music Composition for a Series", 
      "Primetime Emmy Award for Outstanding Single-Camera Picture Editing for a Drama Series", 
      "Primetime Emmy Award for Outstanding Directing for a Drama Series", 
      "Primetime Emmy Award for Outstanding Sound Mixing For A Comedy Or Drama Series (One Hour)", 
      "Satellite Award for Best Actor \u2013 Television Series Drama"
    ], 
    "targetFormula": "(!fb:award.award_honor.award ((lambda x (fb:award.award_honor.honored_for (var x))) fb:en.lost))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 ?x2name WHERE { ?x1 fb:award.award_honor.honored_for fb:m.0828jw . FILTER (?x1 != fb:m.0828jw) . ?x1 fb:award.award_honor.award ?x2 . OPTIONAL { ?x2 fb:type.object.name ?x2name } } LIMIT 9999", 
    "utterance": "what awards has lost won", 
    "id": 29
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:en.tutankhamun fb:people.deceased_person.date_of_death ?x1 } LIMIT 9999", 
    "result": [
      "-1322"
    ], 
    "targetFormula": "(!fb:people.deceased_person.date_of_death fb:en.tutankhamun)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.07hcc fb:people.deceased_person.date_of_death ?x1 } LIMIT 9999", 
    "utterance": "when did tutankhamun die", 
    "id": 30
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:en.niagara_falls fb:geography.waterfall.height ?x1 } LIMIT 9999", 
    "result": [
      "51"
    ], 
    "targetFormula": "(!fb:geography.waterfall.height fb:en.niagara_falls)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.0dpk_ fb:geography.waterfall.height ?x1 } LIMIT 9999", 
    "utterance": "how high is niagara falls", 
    "id": 33
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { ?x1 fb:base.dinosaur.dinosaur_location.dinosaur_s fb:en.barosaurus . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Africa"
    ], 
    "targetFormula": "(fb:base.dinosaur.dinosaur_location.dinosaur_s fb:en.barosaurus)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { ?x1 fb:base.dinosaur.dinosaur_location.dinosaur_s fb:m.04ssfz . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "where did barosaurus live", 
    "id": 34
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.serge fb:fashion.textile.fiber ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Wool"
    ], 
    "targetFormula": "(!fb:fashion.textile.fiber fb:en.serge)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.02mgxp fb:fashion.textile.fiber ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what is serge made out of", 
    "id": 35
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.kifm fb:broadcast.radio_station.serves_area ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [], 
    "targetFormula": "(!fb:broadcast.radio_station.serves_area fb:en.kifm)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.076mqq fb:broadcast.radio_station.serves_area ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what area does kifm serve", 
    "id": 36
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:en.j_c_penney fb:organization.organization.date_founded ?x1 } LIMIT 9999", 
    "result": [
      "1902"
    ], 
    "targetFormula": "(!fb:organization.organization.date_founded fb:en.j_c_penney)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.026h1w fb:organization.organization.date_founded ?x1 } LIMIT 9999", 
    "utterance": "when was jcpenney founded", 
    "id": 37
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:en.mount_everest fb:geography.mountain.elevation ?x1 } LIMIT 9999", 
    "result": [
      "8848"
    ], 
    "targetFormula": "(!fb:geography.mountain.elevation fb:en.mount_everest)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.0blbd fb:geography.mountain.elevation ?x1 } LIMIT 9999", 
    "utterance": "how tall is mount everest", 
    "id": 38
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:en.save-a-lot fb:organization.organization.date_founded ?x1 } LIMIT 9999", 
    "result": [
      "1977"
    ], 
    "targetFormula": "(!fb:organization.organization.date_founded fb:en.save-a-lot)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.0209r2 fb:organization.organization.date_founded ?x1 } LIMIT 9999", 
    "utterance": "when was savealot founded", 
    "id": 39
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 ?x2name WHERE { ?x1 fb:architecture.occupancy.building fb:en.fallingwater . FILTER (?x1 != fb:en.fallingwater) . ?x1 fb:architecture.occupancy.occupant ?x2 . OPTIONAL { ?x2 fb:type.object.name ?x2name } } LIMIT 9999", 
    "result": [
      "Edgar J. Kaufmann"
    ], 
    "targetFormula": "(!fb:architecture.occupancy.occupant ((lambda x (fb:architecture.occupancy.building (var x))) fb:en.fallingwater))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 ?x2name WHERE { ?x1 fb:architecture.occupancy.building fb:m.01zh2s . FILTER (?x1 != fb:m.01zh2s) . ?x1 fb:architecture.occupancy.occupant ?x2 . OPTIONAL { ?x2 fb:type.object.name ?x2name } } LIMIT 9999", 
    "utterance": "who lived in fallingwater", 
    "id": 40
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.ford_motor_company fb:automotive.company.make_s ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Ford", 
      "Edsel", 
      "Lincoln", 
      "Mercury", 
      "Rover", 
      "Ford of Britain"
    ], 
    "targetFormula": "(!fb:automotive.company.make_s fb:en.ford_motor_company)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.02zs4 fb:automotive.company.make_s ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what makes does ford have", 
    "id": 42
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:en.earth fb:location.location.area ?x1 } LIMIT 9999", 
    "result": [], 
    "targetFormula": "(!fb:location.location.area fb:en.earth)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.02j71 fb:location.location.area ?x1 } LIMIT 9999", 
    "utterance": "what is the earth 's area", 
    "id": 43
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:en.bmw fb:organization.organization.slogan ?x1 } LIMIT 9999", 
    "result": [
      "Freude am Fahren", 
      "Sheer Driving Pleasure", 
      "The Ultimate Driving Machine."
    ], 
    "targetFormula": "(!fb:organization.organization.slogan fb:en.bmw)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.017yh fb:organization.organization.slogan ?x1 } LIMIT 9999", 
    "utterance": "what is the slogan of bmw", 
    "id": 44
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.mona_lisa fb:visual_art.artwork.artist ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Leonardo da Vinci"
    ], 
    "targetFormula": "(!fb:visual_art.artwork.artist fb:en.mona_lisa)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.0jbg2 fb:visual_art.artwork.artist ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "who painted the mona lisa", 
    "id": 45
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.charlie_brown fb:fictional_universe.fictional_character.character_created_by ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Charles M. Schulz"
    ], 
    "targetFormula": "(!fb:fictional_universe.fictional_character.character_created_by fb:en.charlie_brown)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.011j44 fb:fictional_universe.fictional_character.character_created_by ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "who created charlie brown", 
    "id": 46
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.sesame_street fb:tv.tv_program.program_creator ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Joan Ganz Cooney", 
      "Lloyd Morrisett"
    ], 
    "targetFormula": "(!fb:tv.tv_program.program_creator fb:en.sesame_street)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.0cwrr fb:tv.tv_program.program_creator ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "who created sesame street", 
    "id": 47
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:en.starbucks fb:organization.organization.date_founded ?x1 } LIMIT 9999", 
    "result": [
      "1971"
    ], 
    "targetFormula": "(!fb:organization.organization.date_founded fb:en.starbucks)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.018c_r fb:organization.organization.date_founded ?x1 } LIMIT 9999", 
    "utterance": "when was starbucks founded", 
    "id": 48
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.uss_nautilus fb:boats.ship.ship_builder ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "General Dynamics Electric Boat"
    ], 
    "targetFormula": "(!fb:boats.ship.ship_builder fb:en.uss_nautilus)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.01tckg fb:boats.ship.ship_builder ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "who built the uss nautilus", 
    "id": 49
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:en.techvibes fb:internet.blog.started ?x1 } LIMIT 9999", 
    "result": [
      "2002"
    ], 
    "targetFormula": "(!fb:internet.blog.started fb:en.techvibes)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.04sxf7k fb:internet.blog.started ?x1 } LIMIT 9999", 
    "utterance": "when was techvibes started", 
    "id": 50
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.target_corporation fb:business.business_operation.industry ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Variety Stores", 
      "Retail"
    ], 
    "targetFormula": "(!fb:business.business_operation.industry fb:en.target_corporation)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.01b39j fb:business.business_operation.industry ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what is target 's industry", 
    "id": 51
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.01v7z fb:dining.cuisine.dishes ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Bisque", 
      "Gumbo", 
      "Jambalaya", 
      "\u00c9touff\u00e9e"
    ], 
    "targetFormula": "(!fb:dining.cuisine.dishes fb:m.01v7z)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.01v7z fb:dining.cuisine.dishes ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what are some cajun dishes", 
    "id": 52
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.nathan_smith_1770 fb:people.deceased_person.place_of_death ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Washington, D.C."
    ], 
    "targetFormula": "(!fb:people.deceased_person.place_of_death fb:en.nathan_smith_1770)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.0bf9j1 fb:people.deceased_person.place_of_death ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "where did nathan smith die", 
    "id": 53
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.roe_v_wade fb:law.legal_case.subject ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Forced abortion", 
      "Privacy"
    ], 
    "targetFormula": "(!fb:law.legal_case.subject fb:en.roe_v_wade)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.0hx5v fb:law.legal_case.subject ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what was roe v. wade about", 
    "id": 54
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:en.jerry_seinfeld fb:people.person.height_meters ?x1 } LIMIT 9999", 
    "result": [
      "1.803"
    ], 
    "targetFormula": "(!fb:people.person.height_meters fb:en.jerry_seinfeld)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.0q5hw fb:people.person.height_meters ?x1 } LIMIT 9999", 
    "utterance": "how tall is jerry seinfeld", 
    "id": 56
  }
]
