[
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x3 WHERE { { SELECT DISTINCT count(?x1) AS ?x3 WHERE { ?x2 fb:projects.project_participation.project fb:en.design_and_construction_of_the_golden_gate_bridge . FILTER (?x2 != fb:en.design_and_construction_of_the_golden_gate_bridge) . ?x2 fb:projects.project_participation.participant ?x1 } } } LIMIT 9999", 
    "result": [
      "9"
    ], 
    "targetFormula": "(count (!fb:projects.project_participation.participant ( (lambda x (fb:projects.project_participation.project (var x))) fb:en.design_and_construction_of_the_golden_gate_bridge)))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x3 WHERE { { SELECT DISTINCT count(?x1) AS ?x3 WHERE { ?x2 fb:projects.project_participation.project fb:m.05g__g4 . FILTER (?x2 != fb:m.05g__g4) . ?x2 fb:projects.project_participation.participant ?x1 } } } LIMIT 9999", 
    "utterance": "how many people worked on the design and construction of the golden gate bridge", 
    "id": 637
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { ?x1 fb:martial_arts.martial_arts_certification.qualification fb:en.fifth_degree . FILTER (?x1 != fb:en.fifth_degree) . ?x1 fb:martial_arts.martial_arts_certification.art fb:en.seishindo_kenpo . FILTER (?x1 != fb:en.seishindo_kenpo) . ?x1 fb:martial_arts.martial_arts_certification.person fb:en.cathy_landers . FILTER (?x1 != fb:en.cathy_landers) . ?x1 fb:martial_arts.martial_arts_certification.date ?x2 } LIMIT 9999", 
    "result": [
      "2008-08-16"
    ], 
    "targetFormula": "(!fb:martial_arts.martial_arts_certification.date (and (and ((lambda x (fb:martial_arts.martial_arts_certification.qualification (var x))) fb:en.fifth_degree) ((lambda x (fb:martial_arts.martial_arts_certification.art (var x))) fb:en.seishindo_kenpo)) ((lambda x (fb:martial_arts.martial_arts_certification.person (var x))) fb:en.cathy_landers)))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { ?x1 fb:martial_arts.martial_arts_certification.qualification fb:m.02_6p8w . FILTER (?x1 != fb:m.02_6p8w) . ?x1 fb:martial_arts.martial_arts_certification.art fb:m.03cjpb3 . FILTER (?x1 != fb:m.03cjpb3) . ?x1 fb:martial_arts.martial_arts_certification.person fb:m.075r1_w . FILTER (?x1 != fb:m.075r1_w) . ?x1 fb:martial_arts.martial_arts_certification.date ?x2 } LIMIT 9999", 
    "utterance": "when was cathy landers certified as a fifth degree black belt in seishindo kenpo", 
    "id": 638
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { ?x1 fb:award.award_honor.award fb:en.hugo_award_for_best_novel . FILTER (?x1 != fb:en.hugo_award_for_best_novel) . ?x1 fb:award.award_honor.honored_for fb:en.harry_potter_and_the_goblet_of_fire . FILTER (?x1 != fb:en.harry_potter_and_the_goblet_of_fire) . ?x1 fb:award.award_honor.year ?x2 } LIMIT 9999", 
    "result": [
      "2001"
    ], 
    "targetFormula": "(!fb:award.award_honor.year (and ((lambda x (fb:award.award_honor.award (var x))) fb:en.hugo_award_for_best_novel) ((lambda x (fb:award.award_honor.honored_for (var x))) fb:en.harry_potter_and_the_goblet_of_fire)))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { ?x1 fb:award.award_honor.award fb:m.01yz0x . FILTER (?x1 != fb:m.01yz0x) . ?x1 fb:award.award_honor.honored_for fb:m.01m5g_ . FILTER (?x1 != fb:m.01m5g_) . ?x1 fb:award.award_honor.year ?x2 } LIMIT 9999", 
    "utterance": "in what year did harry potter and the goblet of fire win the hugo award for best novel", 
    "id": 639
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x3 WHERE { { SELECT DISTINCT count(?x1) AS ?x3 WHERE { ?x2 fb:royalty.chivalric_order_position_tenure.chivalric_office fb:en.grand_master . FILTER (?x2 != fb:en.grand_master) . ?x2 fb:royalty.chivalric_order_position_tenure.order fb:en.order_of_the_most_holy_annunciation . FILTER (?x2 != fb:en.order_of_the_most_holy_annunciation) . ?x2 fb:royalty.chivalric_order_position_tenure.officer ?x1 } } } LIMIT 9999", 
    "result": [
      "4"
    ], 
    "targetFormula": "(count (!fb:royalty.chivalric_order_position_tenure.officer (and ( (lambda x (fb:royalty.chivalric_order_position_tenure.chivalric_office (var x))) fb:en.grand_master) ( (lambda x (fb:royalty.chivalric_order_position_tenure.order (var x))) fb:en.order_of_the_most_holy_annunciation))))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x3 WHERE { { SELECT DISTINCT count(?x1) AS ?x3 WHERE { ?x2 fb:royalty.chivalric_order_position_tenure.chivalric_office fb:m.092pxy . FILTER (?x2 != fb:m.092pxy) . ?x2 fb:royalty.chivalric_order_position_tenure.order fb:m.068kn_ . FILTER (?x2 != fb:m.068kn_) . ?x2 fb:royalty.chivalric_order_position_tenure.officer ?x1 } } } LIMIT 9999", 
    "utterance": "how many people have held the title of grand master of the order of the most holy annunciation", 
    "id": 640
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 ?x2name WHERE { ?x1 fb:award.award_honor.award fb:m.04d215m . FILTER (?x1 != fb:m.04d215m) . ?x1 fb:award.award_honor.honored_for ?x2 . OPTIONAL { ?x2 fb:type.object.name ?x2name } } LIMIT 9999", 
    "result": [
      "Charlie's Angels", 
      "Men in Black", 
      "Training Day", 
      "Con Air", 
      "The Fresh Prince of Bel-Air", 
      "Runaway Bride", 
      "Titanic", 
      "City of Angels", 
      "8 Mile", 
      "Austin Powers: The Spy Who Shagged Me", 
      "Beauty and The Beast", 
      "Wild Wild West", 
      "I'm with You"
    ], 
    "targetFormula": "(!fb:award.award_honor.honored_for ((lambda x (fb:award.award_honor.award (var x))) fb:m.04d215m))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 ?x2name WHERE { ?x1 fb:award.award_honor.award fb:m.04d215m . FILTER (?x1 != fb:m.04d215m) . ?x1 fb:award.award_honor.honored_for ?x2 . OPTIONAL { ?x2 fb:type.object.name ?x2name } } LIMIT 9999", 
    "utterance": "what movies won ascap film and television music awards for most performed songs from motion pictures", 
    "id": 641
  }
]
