[
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 ?x2name WHERE { ?x1 fb:boxing.boxing_title_tenure.title fb:m.0chgh2j . FILTER (?x1 != fb:m.0chgh2j) . ?x1 fb:boxing.boxing_title_tenure.champion ?x2 . OPTIONAL { ?x2 fb:type.object.name ?x2name } } LIMIT 9999", 
    "result": [
      "Muhammad Ali"
    ], 
    "targetFormula": "(!fb:boxing.boxing_title_tenure.champion ((lambda x (fb:boxing.boxing_title_tenure.title (var x))) fb:m.0chgh2j))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 ?x2name WHERE { ?x1 fb:boxing.boxing_title_tenure.title fb:m.0chgh2j . FILTER (?x1 != fb:m.0chgh2j) . ?x1 fb:boxing.boxing_title_tenure.champion ?x2 . OPTIONAL { ?x2 fb:type.object.name ?x2name } } LIMIT 9999", 
    "utterance": "who has held the title of wba world champion", 
    "id": 413
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.st_louis_cardinals fb:baseball.baseball_team.division ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "National League Central"
    ], 
    "targetFormula": "(!fb:baseball.baseball_team.division fb:en.st_louis_cardinals)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.06x68 fb:baseball.baseball_team.division ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "in what division are the st. louis cardinals", 
    "id": 414
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.walter_gropius fb:architecture.architect.architectural_style ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Modern architecture", 
      "Bauhaus style", 
      "Expressionist architecture"
    ], 
    "targetFormula": "(!fb:architecture.architect.architectural_style fb:en.walter_gropius)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.0854b fb:architecture.architect.architectural_style ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what was walter gropius' architectural style", 
    "id": 415
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.snowshoe_mountain fb:skiing.ski_area.closest_city ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Marlinton"
    ], 
    "targetFormula": "(!fb:skiing.ski_area.closest_city fb:en.snowshoe_mountain)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.043r0z fb:skiing.ski_area.closest_city ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what is the closet city to snowshoe mountain", 
    "id": 416
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x3 WHERE { { SELECT DISTINCT count(?x1) AS ?x3 WHERE { ?x2 fb:organization.organization_membership.organization fb:en.european_union . FILTER (?x2 != fb:en.european_union) . ?x2 fb:organization.organization_membership.member ?x1 } } } LIMIT 9999", 
    "result": [
      "28"
    ], 
    "targetFormula": "(count (!fb:organization.organization_membership.member ((lambda x (fb:organization.organization_membership.organization (var x))) fb:en.european_union)))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x3 WHERE { { SELECT DISTINCT count(?x1) AS ?x3 WHERE { ?x2 fb:organization.organization_membership.organization fb:m.02jxk . FILTER (?x2 != fb:m.02jxk) . ?x2 fb:organization.organization_membership.member ?x1 } } } LIMIT 9999", 
    "utterance": "how many countries are in the european union", 
    "id": 417
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:en.london_zoo fb:zoos.zoo.num_animals ?x1 } LIMIT 9999", 
    "result": [
      "16802"
    ], 
    "targetFormula": "(!fb:zoos.zoo.num_animals fb:en.london_zoo)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.0j53x fb:zoos.zoo.num_animals ?x1 } LIMIT 9999", 
    "utterance": "how many animals are there at the london zoo", 
    "id": 418
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 ?x2name WHERE { ?x1 fb:american_football.football_roster_position.position fb:en.linebacker . FILTER (?x1 != fb:en.linebacker) . ?x1 fb:american_football.football_roster_position.team fb:en.chicago_bears . FILTER (?x1 != fb:en.chicago_bears) . ?x1 fb:american_football.football_roster_position.player ?x2 . OPTIONAL { ?x2 fb:type.object.name ?x2name } } LIMIT 9999", 
    "result": [
      "Blake Costanzo", 
      "Dom DeCicco", 
      "Lance Briggs", 
      "Jerry Franklin", 
      "J. T. Thomas", 
      "Lawrence Wilson"
    ], 
    "targetFormula": "(!fb:american_football.football_roster_position.player (and ((lambda x (fb:american_football.football_roster_position.position (var x))) fb:en.linebacker) ((lambda x (fb:american_football.football_roster_position.team (var x))) fb:en.chicago_bears)))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 ?x2name WHERE { ?x1 fb:american_football.football_roster_position.position fb:m.02g_6j . FILTER (?x1 != fb:m.02g_6j) . ?x1 fb:american_football.football_roster_position.team fb:m.01y3v . FILTER (?x1 != fb:m.01y3v) . ?x1 fb:american_football.football_roster_position.player ?x2 . OPTIONAL { ?x2 fb:type.object.name ?x2name } } LIMIT 9999", 
    "utterance": "who are the linebackers on the chicago bears", 
    "id": 419
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.space_mountain fb:amusement_parks.ride.area ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Tomorrowland"
    ], 
    "targetFormula": "(!fb:amusement_parks.ride.area fb:en.space_mountain)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.02z2qmd fb:amusement_parks.ride.area ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what area of disneyland is space mountain in", 
    "id": 420
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.space_shuttle_discovery fb:spaceflight.spacecraft.manufacturer ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "North American Aviation"
    ], 
    "targetFormula": "(!fb:spaceflight.spacecraft.manufacturer fb:en.space_shuttle_discovery)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.06_t4 fb:spaceflight.spacecraft.manufacturer ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "who manufactured the space shuttle discovery", 
    "id": 421
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { ?x1 fb:engineering.battery_size_cell_variation.cell_type fb:en.alkaline_battery . FILTER (?x1 != fb:en.alkaline_battery) . ?x1 fb:engineering.battery_size_cell_variation.size fb:en.aa_battery . FILTER (?x1 != fb:en.aa_battery) . ?x1 fb:engineering.battery_size_cell_variation.voltage ?x2 } LIMIT 9999", 
    "result": [
      "1.5"
    ], 
    "targetFormula": "(!fb:engineering.battery_size_cell_variation.voltage (and ((lambda x (fb:engineering.battery_size_cell_variation.cell_type (var x))) fb:en.alkaline_battery) ((lambda x (fb:engineering.battery_size_cell_variation.size (var x))) fb:en.aa_battery)))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { ?x1 fb:engineering.battery_size_cell_variation.cell_type fb:m.0361c4 . FILTER (?x1 != fb:m.0361c4) . ?x1 fb:engineering.battery_size_cell_variation.size fb:m.05f08s . FILTER (?x1 != fb:m.05f08s) . ?x1 fb:engineering.battery_size_cell_variation.voltage ?x2 } LIMIT 9999", 
    "utterance": "what is the voltage of a aa alkaline battery", 
    "id": 422
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { fb:en.igneous_rock fb:geology.rock_type.parent_rock_type ?x1 } } } LIMIT 9999", 
    "result": [
      "51"
    ], 
    "targetFormula": "(count (!fb:geology.rock_type.parent_rock_type fb:en.igneous_rock))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { fb:m.03_2f fb:geology.rock_type.parent_rock_type ?x1 } } } LIMIT 9999", 
    "utterance": "how many parent types does igneous rock have", 
    "id": 423
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.game_of_thrones fb:media_common.adaptation.adapted_from ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "A Game of Thrones", 
      "A Song of Ice and Fire"
    ], 
    "targetFormula": "(!fb:media_common.adaptation.adapted_from fb:en.game_of_thrones)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.0524b41 fb:media_common.adaptation.adapted_from ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what series was game of thrones adapted from", 
    "id": 424
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:en.arabic_alphabet fb:language.language_writing_system.used_from ?x1 } LIMIT 9999", 
    "result": [
      "0400"
    ], 
    "targetFormula": "(!fb:language.language_writing_system.used_from fb:en.arabic_alphabet)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.0xn6 fb:language.language_writing_system.used_from ?x1 } LIMIT 9999", 
    "utterance": "since when has the arabic alphabet been used", 
    "id": 425
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { fb:en.australian_dollar fb:finance.currency.countries_used ?x1 } } } LIMIT 9999", 
    "result": [
      "8"
    ], 
    "targetFormula": "(count (!fb:finance.currency.countries_used fb:en.australian_dollar))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { fb:m.0kz1h fb:finance.currency.countries_used ?x1 } } } LIMIT 9999", 
    "utterance": "how many countries use the australian dollar", 
    "id": 426
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.stumpjumper fb:bicycles.bicycle_model.manufacturer ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Specialized Bicycle Components"
    ], 
    "targetFormula": "(!fb:bicycles.bicycle_model.manufacturer fb:en.stumpjumper)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.03qpf8g fb:bicycles.bicycle_model.manufacturer ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "who manufactures the specialized stumpjumper", 
    "id": 427
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { ?x1 fb:celebrities.substance_abuse_problem.celebrity fb:en.robin_williams . FILTER (?x1 != fb:en.robin_williams) . ?x1 fb:celebrities.substance_abuse_problem.substance fb:en.cocaine . FILTER (?x1 != fb:en.cocaine) . ?x1 fb:celebrities.substance_abuse_problem.end ?x2 } LIMIT 9999", 
    "result": [
      "1983"
    ], 
    "targetFormula": "(!fb:celebrities.substance_abuse_problem.end (and ((lambda x (fb:celebrities.substance_abuse_problem.celebrity (var x))) fb:en.robin_williams) ((lambda x (fb:celebrities.substance_abuse_problem.substance (var x))) fb:en.cocaine)))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { ?x1 fb:celebrities.substance_abuse_problem.celebrity fb:m.0dzf_ . FILTER (?x1 != fb:m.0dzf_) . ?x1 fb:celebrities.substance_abuse_problem.substance fb:m.0256b . FILTER (?x1 != fb:m.0256b) . ?x1 fb:celebrities.substance_abuse_problem.end ?x2 } LIMIT 9999", 
    "utterance": "when did robin williams stop abusing cocaine", 
    "id": 428
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x3 WHERE { { SELECT DISTINCT count(?x1) AS ?x3 WHERE { ?x2 fb:tv.tv_producer_term.producer fb:en.jerry_seinfeld . FILTER (?x2 != fb:en.jerry_seinfeld) . ?x2 fb:tv.tv_producer_term.program ?x1 } } } LIMIT 9999", 
    "result": [
      "3"
    ], 
    "targetFormula": "(count (!fb:tv.tv_producer_term.program ((lambda x (fb:tv.tv_producer_term.producer (var x))) fb:en.jerry_seinfeld)))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x3 WHERE { { SELECT DISTINCT count(?x1) AS ?x3 WHERE { ?x2 fb:tv.tv_producer_term.producer fb:m.0q5hw . FILTER (?x2 != fb:m.0q5hw) . ?x2 fb:tv.tv_producer_term.program ?x1 } } } LIMIT 9999", 
    "utterance": "how many tv shows did jerry seinfeld produce", 
    "id": 429
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.meet_the_parents fb:film.film.genre ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Comedy", 
      "Romance Film"
    ], 
    "targetFormula": "(!fb:film.film.genre fb:en.meet_the_parents)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.033fqh fb:film.film.genre ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what genres does meet the parents consist of", 
    "id": 430
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 ?x2name WHERE { ?x1 fb:event.speech_or_presentation.presented_work fb:en.cross_of_gold_speech . FILTER (?x1 != fb:en.cross_of_gold_speech) . ?x1 fb:event.speech_or_presentation.event ?x2 . OPTIONAL { ?x2 fb:type.object.name ?x2name } } LIMIT 9999", 
    "result": [
      "1896 Democratic National Convention"
    ], 
    "targetFormula": "(!fb:event.speech_or_presentation.event ((lambda x (fb:event.speech_or_presentation.presented_work (var x))) fb:en.cross_of_gold_speech))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 ?x2name WHERE { ?x1 fb:event.speech_or_presentation.presented_work fb:m.09nqy . FILTER (?x1 != fb:m.09nqy) . ?x1 fb:event.speech_or_presentation.event ?x2 . OPTIONAL { ?x2 fb:type.object.name ?x2name } } LIMIT 9999", 
    "utterance": "where was the cross of gold speech presented", 
    "id": 431
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:en.rolls-royce_merlin fb:engineering.piston_engine.capacity ?x1 } LIMIT 9999", 
    "result": [
      "27"
    ], 
    "targetFormula": "(!fb:engineering.piston_engine.capacity fb:en.rolls-royce_merlin)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.09qx4 fb:engineering.piston_engine.capacity ?x1 } LIMIT 9999", 
    "utterance": "what is the capacity of a rolls royce merlin", 
    "id": 432
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.0h2krn6 fb:automotive.trim_level.transmission ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "5 Speed Manual"
    ], 
    "targetFormula": "(!fb:automotive.trim_level.transmission fb:m.0h2krn6)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.0h2krn6 fb:automotive.trim_level.transmission ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what is the transmission of a 2011 honda fit", 
    "id": 433
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { fb:en.bath_iron_works fb:boats.ship_builder.ships_built ?x1 } } } LIMIT 9999", 
    "result": [
      "254"
    ], 
    "targetFormula": "(count (!fb:boats.ship_builder.ships_built fb:en.bath_iron_works))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { fb:m.01f99l fb:boats.ship_builder.ships_built ?x1 } } } LIMIT 9999", 
    "utterance": "how many ships were built by bath iron works", 
    "id": 434
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.010s fb:freebase.domain_profile.category ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Commons", 
      "Arts & Entertainment"
    ], 
    "targetFormula": "(!fb:freebase.domain_profile.category fb:m.010s)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.010s fb:freebase.domain_profile.category ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what category does the film domain belong to", 
    "id": 435
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.06x6s fb:ice_hockey.hockey_team.division ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Central Division"
    ], 
    "targetFormula": "(!fb:ice_hockey.hockey_team.division fb:m.06x6s)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.06x6s fb:ice_hockey.hockey_team.division ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "in what division do the st. louis blues play", 
    "id": 436
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.carnegie_mellon_university fb:education.educational_institution.newspaper ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "The Cut", 
      "The Tartan", 
      "Readme"
    ], 
    "targetFormula": "(!fb:education.educational_institution.newspaper fb:en.carnegie_mellon_university)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.0cwx_ fb:education.educational_institution.newspaper ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what newspapers does carnegie mellon publish", 
    "id": 437
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.the_magicians_nephew fb:fictional_universe.work_of_fiction.setting ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "London", 
      "Narnia"
    ], 
    "targetFormula": "(!fb:fictional_universe.work_of_fiction.setting fb:en.the_magicians_nephew)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.0dy6y fb:fictional_universe.work_of_fiction.setting ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what is the setting of the magician_s nephew", 
    "id": 438
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:en.high_court_of_australia fb:law.court.founded ?x1 } LIMIT 9999", 
    "result": [
      "1901"
    ], 
    "targetFormula": "(!fb:law.court.founded fb:en.high_court_of_australia)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.01tm9w fb:law.court.founded ?x1 } LIMIT 9999", 
    "utterance": "when was the high court of australia founded", 
    "id": 439
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.motor_neuron_disease fb:medicine.disease.symptoms ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Spasticity", 
      "Muscle weakness", 
      "Muscle atrophy"
    ], 
    "targetFormula": "(!fb:medicine.disease.symptoms fb:en.motor_neuron_disease)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.0kh3 fb:medicine.disease.symptoms ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what are the symptoms of motor neuron disease", 
    "id": 440
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { fb:m.0b66f5g fb:physics.subatomic_particle_generation.particles ?x1 } } } LIMIT 9999", 
    "result": [
      "7"
    ], 
    "targetFormula": "(count (!fb:physics.subatomic_particle_generation.particles fb:m.0b66f5g))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { fb:m.0b66f5g fb:physics.subatomic_particle_generation.particles ?x1 } } } LIMIT 9999", 
    "utterance": "how many first generation particles are there", 
    "id": 441
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 ?x2name WHERE { ?x1 fb:boxing.match_boxer_relationship.match fb:en.the_battle_of_the_champions . FILTER (?x1 != fb:en.the_battle_of_the_champions) . ?x1 fb:boxing.match_boxer_relationship.boxer ?x2 . OPTIONAL { ?x2 fb:type.object.name ?x2name } } LIMIT 9999", 
    "result": [
      "Aaron Pryor", 
      "Alexis Arg\u00fcello"
    ], 
    "targetFormula": "(!fb:boxing.match_boxer_relationship.boxer ((lambda x (fb:boxing.match_boxer_relationship.match (var x))) fb:en.the_battle_of_the_champions))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 ?x2name WHERE { ?x1 fb:boxing.match_boxer_relationship.match fb:m.0kvlz . FILTER (?x1 != fb:m.0kvlz) . ?x1 fb:boxing.match_boxer_relationship.boxer ?x2 . OPTIONAL { ?x2 fb:type.object.name ?x2name } } LIMIT 9999", 
    "utterance": "who fought in the the battle of the champions", 
    "id": 442
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.lil_hardin_armstrong fb:music.artist.genre ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Jazz"
    ], 
    "targetFormula": "(!fb:music.artist.genre fb:en.lil_hardin_armstrong)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.01ggms fb:music.artist.genre ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what genre did lil hardin armstrong represent", 
    "id": 443
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { fb:en.shaquille_oneal fb:common.topic.alias ?x1 } } } LIMIT 9999", 
    "result": [
      "11"
    ], 
    "targetFormula": "(count (!fb:common.topic.alias fb:en.shaquille_oneal))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { fb:m.012xdf fb:common.topic.alias ?x1 } } } LIMIT 9999", 
    "utterance": "how many nicknames does shaquille o'neal have", 
    "id": 444
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:en.alan_shepard fb:spaceflight.astronaut.space_time_minutes ?x1 } LIMIT 9999", 
    "result": [
      "13017"
    ], 
    "targetFormula": "(!fb:spaceflight.astronaut.space_time_minutes fb:en.alan_shepard)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.0h2_l fb:spaceflight.astronaut.space_time_minutes ?x1 } LIMIT 9999", 
    "utterance": "how much time did alan shepard spend in space", 
    "id": 445
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.the_gross_clinic fb:exhibitions.exhibit.exhibitions_displayed_in ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Thomas Eakins' The Gross Clinic", 
      "An Eakins Masterpiece Restored: Seeing The Gross Clinic Anew"
    ], 
    "targetFormula": "(!fb:exhibitions.exhibit.exhibitions_displayed_in fb:en.the_gross_clinic)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.0dy5fh fb:exhibitions.exhibit.exhibitions_displayed_in ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what exhibitions has the gross clinic been in", 
    "id": 446
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.computer_science fb:book.periodical_subject.periodicals ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "IEEE Transactions on Information Theory", 
      "IEEE Transactions on Software Engineering", 
      "Journal of Machine Learning Research", 
      "Electronic Notes in Theoretical Computer Science", 
      "Computational Linguistics", 
      "Electronic Letters on Computer Vision and Image Analysis", 
      "Journal of Automata, Languages and Combinatorics", 
      "Journal of Chemical Information and Modeling", 
      "Bell Labs Technical Journal", 
      "IJOE", 
      "Journal of Symbolic Computation", 
      "INFOCOMP Journal of Computer Science", 
      "Journal of Web Semantics", 
      "International Journal of Foundations of Computer Science", 
      "Theoretical Computer Science", 
      "IEEE Spectrum", 
      "Communications of the ACM", 
      "Journal of the ACM", 
      "Molecular Informatics", 
      "Artificial Intelligence", 
      "Performance Evaluation", 
      "Computer Graphics", 
      "IEEE Transactions on Computers", 
      "EURASIP Journal on Advances in Signal Processing", 
      "Journal of Statistical Software", 
      "Journal of Information Technology & Politics", 
      "Formal Aspects of Computing", 
      "Machine Learning", 
      "Theory of Computing", 
      "Scientific Computing & Instrumentation", 
      "Fundamenta Informaticae", 
      "IEEE Transactions on Pattern Analysis and Machine Intelligence", 
      "ALGOL Bulletin", 
      "IEEE Transactions on Evolutionary Computation", 
      "Kairos: A Journal of Rhetoric, Technology, and Pedagogy", 
      "ICGA Journal", 
      "Journal of Systems and Software", 
      "Journal of Functional Programming", 
      "ACM Transactions on Multimedia Computing, Communications, and Applications", 
      "Computer Underground Digest", 
      "IEEE MultiMedia", 
      "Software and Systems Modeling", 
      "Archives and Museum Informatics", 
      "Presence: Teleoperators & Virtual Environments", 
      "International Journal of Critical Computer-Based Systems", 
      "International Journal of Software and Informatics", 
      "IEEE Software", 
      "SIAM Journal on Computing", 
      "International Journal of e-Collaboration", 
      "ACM Transactions on Computer-Human Interaction", 
      "Journal of Computer-Mediated Communication", 
      "IEEE Micro", 
      "RISKS Digest", 
      "Software Testing, Verification & Reliability", 
      "Data Mining and Knowledge Discovery", 
      "Journal of Formalized Reasoning", 
      "Combinatorica", 
      "Algorithmica", 
      "International Journal of Computational Cognition", 
      "Program: Electronic Library and Information Systems", 
      "ACM Transactions on Database Systems", 
      "Journal of Artificial Intelligence Research", 
      "SIAM Journal on Scientific Computing", 
      "ReCALL", 
      "Journal of Computer and System Sciences", 
      "IEEE Annals of the History of Computing", 
      "Computer", 
      "Software Engineering Notes", 
      "The Computer Journal", 
      "Logical Methods in Computer Science", 
      "ACM Computing Reviews", 
      "HOOPLA!", 
      "Mobile Computing and Communications Review", 
      "ACM Transactions on Graphics", 
      "Journal of Multimedia", 
      "ACM SIGACT", 
      "Russian IT Quarterly", 
      "Innovations in Systems and Software Engineering", 
      "Computer Law & Security Review", 
      "The Journal of Object Technology", 
      "International Journal of Latest Trends in Multimedia Technologies", 
      "Journal of Cryptology"
    ], 
    "targetFormula": "(!fb:book.periodical_subject.periodicals fb:en.computer_science)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.01mkq fb:book.periodical_subject.periodicals ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what are some periodicals on computer science", 
    "id": 448
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 ?x2name WHERE { ?x1 fb:rail.railway_operator_relationship.operator fb:en.london_overground . FILTER (?x1 != fb:en.london_overground) . ?x1 fb:rail.railway_operator_relationship.railway ?x2 . OPTIONAL { ?x2 fb:type.object.name ?x2name } } LIMIT 9999", 
    "result": [
      "North London Line", 
      "East London Line", 
      "West London Line", 
      "Gospel Oak to Barking Line"
    ], 
    "targetFormula": "(!fb:rail.railway_operator_relationship.railway ((lambda x (fb:rail.railway_operator_relationship.operator (var x))) fb:en.london_overground))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 ?x2name WHERE { ?x1 fb:rail.railway_operator_relationship.operator fb:m.0dfvhl . FILTER (?x1 != fb:m.0dfvhl) . ?x1 fb:rail.railway_operator_relationship.railway ?x2 . OPTIONAL { ?x2 fb:type.object.name ?x2name } } LIMIT 9999", 
    "utterance": "what lines does the london overground operate", 
    "id": 449
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 ?x2name WHERE { ?x1 fb:tv.regular_tv_appearance.actor fb:en.jun_matsumoto . FILTER (?x1 != fb:en.jun_matsumoto) . ?x1 fb:tv.regular_tv_appearance.series fb:m.05f52tw . FILTER (?x1 != fb:m.05f52tw) . ?x1 fb:tv.regular_tv_appearance.character ?x2 . OPTIONAL { ?x2 fb:type.object.name ?x2name } } LIMIT 9999", 
    "result": [
      "Tsukasa Domyouji"
    ], 
    "targetFormula": "(!fb:tv.regular_tv_appearance.character (and ((lambda x (fb:tv.regular_tv_appearance.actor (var x))) fb:en.jun_matsumoto) ((lambda x (fb:tv.regular_tv_appearance.series (var x))) fb:m.05f52tw)))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 ?x2name WHERE { ?x1 fb:tv.regular_tv_appearance.actor fb:m.0621ss . FILTER (?x1 != fb:m.0621ss) . ?x1 fb:tv.regular_tv_appearance.series fb:m.05f52tw . FILTER (?x1 != fb:m.05f52tw) . ?x1 fb:tv.regular_tv_appearance.character ?x2 . OPTIONAL { ?x2 fb:type.object.name ?x2name } } LIMIT 9999", 
    "utterance": "who did jun matsumoto play in hana yori dango", 
    "id": 450
  }
]
