[
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { fb:en.matsushita_electric_industrial_co fb:common.topic.alias ?x1 } } } LIMIT 9999", 
    "result": [
      "2"
    ], 
    "targetFormula": "(count (!fb:common.topic.alias fb:en.matsushita_electric_industrial_co))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { fb:m.0nk5b fb:common.topic.alias ?x1 } } } LIMIT 9999", 
    "utterance": "how many other names is panasonic corporation known by", 
    "id": 572
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:en.the_standard_school_broadcast fb:broadcast.content.production_start ?x1 } LIMIT 9999", 
    "result": [
      "1928"
    ], 
    "targetFormula": "(!fb:broadcast.content.production_start fb:en.the_standard_school_broadcast)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.05mzm59 fb:broadcast.content.production_start ?x1 } LIMIT 9999", 
    "utterance": "when did the standard school broadcast start production", 
    "id": 573
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:en.canon_powershot_a75 fb:digicams.digital_camera.orientation_sensor ?x1 } LIMIT 9999", 
    "result": [
      "1"
    ], 
    "targetFormula": "(!fb:digicams.digital_camera.orientation_sensor fb:en.canon_powershot_a75)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.04xvr8 fb:digicams.digital_camera.orientation_sensor ?x1 } LIMIT 9999", 
    "utterance": "does the canon powershot a75 have an orientation sensor", 
    "id": 574
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { fb:en.straight-4 fb:engineering.piston_configuration.engines ?x1 } } } LIMIT 9999", 
    "result": [
      "4"
    ], 
    "targetFormula": "(count (!fb:engineering.piston_configuration.engines fb:en.straight-4))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { fb:m.01chrk fb:engineering.piston_configuration.engines ?x1 } } } LIMIT 9999", 
    "utterance": "how many engines have a straight-4 piston configuration", 
    "id": 575
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.the_wonderful_wizard_of_oz fb:media_common.adapted_work.adaptations ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "The wonderful Wizard of Oz", 
      "The Wiz", 
      "The Wiz", 
      "The Wizard of Oz", 
      "The Wonderful Wizard of Oz", 
      "Return to Oz", 
      "The Wizard of Oz", 
      "The Fairylogue and Radio-Plays", 
      "The Wizard of Oz", 
      "The Muppets' Wizard of Oz", 
      "Oz: The Great and Powerful", 
      "Tin Man", 
      "His Majesty, the Scarecrow of Oz", 
      "The Wizard of Oz in Concert: Dreams Come True", 
      "The wonderful Wizard of Oz", 
      "The Wizard of Mars", 
      "My Favorite Fairy Tales Volume 4: The Wizard of Oz; The Magic Carpet; Alibaba and Forty Thieves", 
      "The Wizard of Oz", 
      "Wizard of Oz", 
      "Ay\u015fecik ve Sihirli C\u00fcceler R\u00fcyalar \u00dclkesinde", 
      "The Wizard of Oz"
    ], 
    "targetFormula": "(!fb:media_common.adapted_work.adaptations fb:en.the_wonderful_wizard_of_oz)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.0f6vx fb:media_common.adapted_work.adaptations ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what are some adaptations of the wonderful wizard of oz", 
    "id": 576
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.1st_world_science_fiction_convention fb:conferences.conference.venue ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Caravan Hall"
    ], 
    "targetFormula": "(!fb:conferences.conference.venue fb:en.1st_world_science_fiction_convention)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.07c678 fb:conferences.conference.venue ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "where was the 1st world science fiction convention held", 
    "id": 577
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { fb:en.eiffel_tower fb:location.location.geolocation ?x1 . ?x1 fb:location.geocode.longitude ?x2 } LIMIT 9999", 
    "result": [
      "2.2946"
    ], 
    "targetFormula": "(!fb:location.geocode.longitude (!fb:location.location.geolocation fb:en.eiffel_tower))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { fb:m.02j81 fb:location.location.geolocation ?x1 . ?x1 fb:location.geocode.longitude ?x2 } LIMIT 9999", 
    "utterance": "what are the latitude and longitude of the eiffel tower", 
    "id": 578
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.06zl3_x fb:business.shopping_center.retail_floor_space_m_2 ?x1 } LIMIT 9999", 
    "result": [
      "36000"
    ], 
    "targetFormula": "(!fb:business.shopping_center.retail_floor_space_m_2 fb:m.06zl3_x)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.06zl3_x fb:business.shopping_center.retail_floor_space_m_2 ?x1 } LIMIT 9999", 
    "utterance": "what is the retail floor space of the dubai marina mall", 
    "id": 579
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { fb:en.vancouver_public_library fb:library.public_library_system.branches ?x1 } } } LIMIT 9999", 
    "result": [
      "22"
    ], 
    "targetFormula": "(count (!fb:library.public_library_system.branches fb:en.vancouver_public_library))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { fb:m.05w4cy fb:library.public_library_system.branches ?x1 } } } LIMIT 9999", 
    "utterance": "how many branches does the vancouver public library have", 
    "id": 580
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 ?x2name WHERE { ?x1 fb:chess.chess_game_participation.game fb:en.immortal_game . FILTER (?x1 != fb:en.immortal_game) . ?x1 fb:chess.chess_game_participation.player fb:en.adolf_anderssen . FILTER (?x1 != fb:en.adolf_anderssen) . ?x1 fb:chess.chess_game_participation.color ?x2 . OPTIONAL { ?x2 fb:type.object.name ?x2name } } LIMIT 9999", 
    "result": [
      "White"
    ], 
    "targetFormula": "(!fb:chess.chess_game_participation.color (and ((lambda x (fb:chess.chess_game_participation.game (var x))) fb:en.immortal_game) ((lambda x (fb:chess.chess_game_participation.player (var x))) fb:en.adolf_anderssen)))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 ?x2name WHERE { ?x1 fb:chess.chess_game_participation.game fb:m.01pr_r . FILTER (?x1 != fb:m.01pr_r) . ?x1 fb:chess.chess_game_participation.player fb:m.018yf9 . FILTER (?x1 != fb:m.018yf9) . ?x1 fb:chess.chess_game_participation.color ?x2 . OPTIONAL { ?x2 fb:type.object.name ?x2name } } LIMIT 9999", 
    "utterance": "what color did adolf anderssen play in the immortal game", 
    "id": 581
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { fb:en.computer_programming fb:media_common.literary_genre.books_in_this_genre ?x1 } } } LIMIT 9999", 
    "result": [
      "11"
    ], 
    "targetFormula": "(count (!fb:media_common.literary_genre.books_in_this_genre fb:en.computer_programming))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { fb:m.01mf_ fb:media_common.literary_genre.books_in_this_genre ?x1 } } } LIMIT 9999", 
    "utterance": "how many books are there written on computer programming", 
    "id": 582
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 ?x2name WHERE { ?x1 fb:baseball.baseball_roster_position.team fb:en.los_angeles_dodgers . FILTER (?x1 != fb:en.los_angeles_dodgers) . ?x1 fb:baseball.baseball_roster_position.player ?x2 . OPTIONAL { ?x2 fb:type.object.name ?x2name } } LIMIT 9999", 
    "result": [
      "Nick Punto", 
      "Brandon League", 
      "Skip Schumaker", 
      "Matt Kemp", 
      "Josh Beckett", 
      "Clayton Kershaw", 
      "A. J. Ellis", 
      "Ronald Belisario", 
      "Carl Crawford", 
      "Zack Greinke", 
      "Ryu Hyun-jin", 
      "Scott Elbert", 
      "Luis Cruz", 
      "Christopher Withrow", 
      "Ted Lilly", 
      "Chris Capuano", 
      "Mark Ellis", 
      "Jerry Hairston, Jr.", 
      "Juan Uribe", 
      "Hanley Ram\u00edrez", 
      "Matt Guerrier", 
      "Andre Ethier", 
      "Javy Guerra", 
      "Dee Gordon", 
      "Adrian Gonzalez", 
      "J. P. Howell", 
      "Chad Billingsley", 
      "Justin Sellers", 
      "Tim Federowicz", 
      "Josh Wall", 
      "Alex Castellanos", 
      "Elian Herrera", 
      "Shawn Tolleson", 
      "Yasiel Puig", 
      "Stephen Fife", 
      "Paco Rodriguez", 
      "Steve Ames", 
      "Matt Magill", 
      "Kenley Jansen"
    ], 
    "targetFormula": "(!fb:baseball.baseball_roster_position.player ((lambda x (fb:baseball.baseball_roster_position.team (var x))) fb:en.los_angeles_dodgers))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 ?x2name WHERE { ?x1 fb:baseball.baseball_roster_position.team fb:m.04mjl . FILTER (?x1 != fb:m.04mjl) . ?x1 fb:baseball.baseball_roster_position.player ?x2 . OPTIONAL { ?x2 fb:type.object.name ?x2name } } LIMIT 9999", 
    "utterance": "who are the players currently on the los angeles dodgers", 
    "id": 583
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { fb:en.1904_toronto_fire fb:event.disaster.damage ?x1 . ?x1 fb:measurement_unit.money_value.amount ?x2 } LIMIT 9999", 
    "result": [
      "10350000"
    ], 
    "targetFormula": "(!fb:measurement_unit.money_value.amount (!fb:event.disaster.damage fb:en.1904_toronto_fire))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { fb:m.02vq5w fb:event.disaster.damage ?x1 . ?x1 fb:measurement_unit.money_value.amount ?x2 } LIMIT 9999", 
    "utterance": "how much money in damages did the 1904 toronto fire cost", 
    "id": 584
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x3 WHERE { { SELECT DISTINCT count(?x1) AS ?x3 WHERE { ?x2 fb:tv.regular_tv_appearance.actor fb:en.danny_devito . FILTER (?x2 != fb:en.danny_devito) . ?x2 fb:tv.regular_tv_appearance.character ?x1 } } } LIMIT 9999", 
    "result": [
      "14"
    ], 
    "targetFormula": "(count (!fb:tv.regular_tv_appearance.character ((lambda x (fb:tv.regular_tv_appearance.actor (var x))) fb:en.danny_devito)))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x3 WHERE { { SELECT DISTINCT count(?x1) AS ?x3 WHERE { ?x2 fb:tv.regular_tv_appearance.actor fb:m.0q9kd . FILTER (?x2 != fb:m.0q9kd) . ?x2 fb:tv.regular_tv_appearance.character ?x1 } } } LIMIT 9999", 
    "utterance": "how many tv shows did danny devito have a leading role in", 
    "id": 586
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.ford_model_t_engine fb:engineering.piston_engine.piston_configuration ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Straight-4"
    ], 
    "targetFormula": "(!fb:engineering.piston_engine.piston_configuration fb:en.ford_model_t_engine)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.046ql9 fb:engineering.piston_engine.piston_configuration ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what is the piston configuration of a ford model t engine", 
    "id": 587
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { ?x1 fb:american_football.player_game_statistics.season fb:en.2008_nfl_season . FILTER (?x1 != fb:en.2008_nfl_season) . ?x1 fb:american_football.player_game_statistics.player fb:en.donovan_mcnabb . FILTER (?x1 != fb:en.donovan_mcnabb) . ?x1 fb:american_football.player_game_statistics.games ?x2 } LIMIT 9999", 
    "result": [
      "16"
    ], 
    "targetFormula": "(!fb:american_football.player_game_statistics.games (and ((lambda x (fb:american_football.player_game_statistics.season (var x))) fb:en.2008_nfl_season) ((lambda x (fb:american_football.player_game_statistics.player (var x))) fb:en.donovan_mcnabb)))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { ?x1 fb:american_football.player_game_statistics.season fb:m.03gqdq7 . FILTER (?x1 != fb:m.03gqdq7) . ?x1 fb:american_football.player_game_statistics.player fb:m.021h8y . FILTER (?x1 != fb:m.021h8y) . ?x1 fb:american_football.player_game_statistics.games ?x2 } LIMIT 9999", 
    "utterance": "how many games did donovan mcnabb play in the 2008 season", 
    "id": 588
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.the_psychiatrist fb:tv.tv_series_episode.next_episode ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Waldorf Salad"
    ], 
    "targetFormula": "(!fb:tv.tv_series_episode.next_episode fb:en.the_psychiatrist)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.0dtt0z fb:tv.tv_series_episode.next_episode ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what was the fawlty towers episode after the psychiatrist", 
    "id": 589
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.the_rolling_stones_2009_concert_tour fb:time.event.locations ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Europe", 
      "United States of America", 
      "Canada"
    ], 
    "targetFormula": "(!fb:time.event.locations fb:en.the_rolling_stones_2009_concert_tour)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.05z25t7 fb:time.event.locations ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "where did the rolling stones 2009 concert tour take place", 
    "id": 590
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 ?x2name WHERE { ?x1 fb:award.award_honor.award fb:en.golden_globe_award_for_best_motion_picture_-_drama . FILTER (?x1 != fb:en.golden_globe_award_for_best_motion_picture_-_drama) . ?x1 fb:award.award_honor.honored_for ?x2 . OPTIONAL { ?x2 fb:type.object.name ?x2name } } LIMIT 9999", 
    "result": [
      "Gladiator", 
      "E.T. the Extra-Terrestrial", 
      "Kramer vs. Kramer", 
      "The Cardinal", 
      "In the Heat of the Night", 
      "Platoon", 
      "A Place in the Sun", 
      "Sense and Sensibility", 
      "Brokeback Mountain", 
      "The Social Network", 
      "Ordinary People", 
      "Terms of Endearment", 
      "Dances with Wolves", 
      "The Last Emperor", 
      "The Lord of the Rings: The Return of the King", 
      "The Aviator", 
      "The Hours", 
      "The Greatest Show on Earth", 
      "The Best Years of Our Lives", 
      "Out of Africa", 
      "The English Patient", 
      "Saving Private Ryan", 
      "Forrest Gump", 
      "American Beauty", 
      "The Lion in Winter", 
      "Babel", 
      "A Beautiful Mind", 
      "Lawrence of Arabia", 
      "Spartacus", 
      "Born on the Fourth of July", 
      "The Treasure of the Sierra Madre", 
      "East of Eden", 
      "Love Story", 
      "On Golden Pond", 
      "The Turning Point", 
      "Anne of the Thousand Days", 
      "Rocky", 
      "The Song of Bernadette", 
      "Ben-Hur", 
      "Schindler's List", 
      "The Defiant Ones", 
      "The Godfather", 
      "The Lost Weekend", 
      "On the Waterfront", 
      "Chinatown", 
      "The French Connection", 
      "Rain Man", 
      "Avatar", 
      "A Man for All Seasons", 
      "Titanic", 
      "Argo", 
      "Amadeus", 
      "The Descendants", 
      "The Bridge on the River Kwai", 
      "Gentleman's Agreement", 
      "Becket", 
      "Bugsy", 
      "Slumdog Millionaire", 
      "Atonement", 
      "One Flew Over the Cuckoo's Nest", 
      "Johnny Belinda", 
      "The Exorcist", 
      "Sunset Boulevard", 
      "The Guns of Navarone", 
      "The Robe", 
      "Going My Way", 
      "All the King's Men", 
      "Scent of a Woman", 
      "Midnight Express", 
      "Around the World in 80 Days", 
      "Doctor Zhivago"
    ], 
    "targetFormula": "(!fb:award.award_honor.honored_for ( (lambda x (fb:award.award_honor.award (var x))) fb:en.golden_globe_award_for_best_motion_picture_-_drama))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 ?x2name WHERE { ?x1 fb:award.award_honor.award fb:m.019f4d . FILTER (?x1 != fb:m.019f4d) . ?x1 fb:award.award_honor.honored_for ?x2 . OPTIONAL { ?x2 fb:type.object.name ?x2name } } LIMIT 9999", 
    "utterance": "what movies won the golden globe award for best drama film", 
    "id": 591
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:en.2005_atlantic_hurricane_season fb:meteorology.tropical_cyclone_season.total_storms ?x1 } LIMIT 9999", 
    "result": [
      "28"
    ], 
    "targetFormula": "(!fb:meteorology.tropical_cyclone_season.total_storms fb:en.2005_atlantic_hurricane_season)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.049_hw fb:meteorology.tropical_cyclone_season.total_storms ?x1 } LIMIT 9999", 
    "utterance": "how many storms were in the 2005 atlantic hurricane season", 
    "id": 592
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 ?x2name WHERE { ?x1 fb:book.contents.publication fb:en.frontier_times_1967_july . FILTER (?x1 != fb:en.frontier_times_1967_july) . ?x1 fb:book.contents.work ?x2 . OPTIONAL { ?x2 fb:type.object.name ?x2name } } LIMIT 9999", 
    "result": [
      "Swift \"Justice\" at Chilkoot Pass", 
      "The First Cooling Off Period", 
      "Five Months Term in the Piney Woods", 
      "The Frontier Post", 
      "Nuggets", 
      "Western Book Roundup", 
      "Trails Grown Dim", 
      "Tumbleweeds", 
      "Will and Charlie", 
      "Doctor Grandma French", 
      "White Man's Forbidden Ground", 
      "God and the Apaches", 
      "Good Guys of the West", 
      "I Helped Caputure Cherokee Bill!", 
      "Mount Franklin's Lost Treasure", 
      "Special Agent!", 
      "The Mason-Henry Gang", 
      "Oregon's Johnny Appleseed", 
      "Cowboys Of Old Yavapai", 
      "Walt Coburn's Tally Book", 
      "Legend of Squaw Hill"
    ], 
    "targetFormula": "(!fb:book.contents.work ((lambda x (fb:book.contents.publication (var x))) fb:en.frontier_times_1967_july))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 ?x2name WHERE { ?x1 fb:book.contents.publication fb:m.064t8jq . FILTER (?x1 != fb:m.064t8jq) . ?x1 fb:book.contents.work ?x2 . OPTIONAL { ?x2 fb:type.object.name ?x2name } } LIMIT 9999", 
    "utterance": "what articles are in the july 1967 issue of frontier times", 
    "id": 593
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:en.elk_mountain_ski_area fb:skiing.ski_area.top_elevation ?x1 } LIMIT 9999", 
    "result": [
      "821.1312"
    ], 
    "targetFormula": "(!fb:skiing.ski_area.top_elevation fb:en.elk_mountain_ski_area)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.02pl3l5 fb:skiing.ski_area.top_elevation ?x1 } LIMIT 9999", 
    "utterance": "what is the highest elevation at the elk mountain ski area", 
    "id": 594
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x3 WHERE { { SELECT DISTINCT count(?x1) AS ?x3 WHERE { fb:en.new_york_public_library fb:library.public_library_system.annual_visits ?x2 . ?x2 fb:measurement_unit.dated_integer.number ?x1 } } } LIMIT 9999", 
    "result": [
      "1"
    ], 
    "targetFormula": "(count (!fb:measurement_unit.dated_integer.number (!fb:library.public_library_system.annual_visits fb:en.new_york_public_library)))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x3 WHERE { { SELECT DISTINCT count(?x1) AS ?x3 WHERE { fb:m.01hyd9 fb:library.public_library_system.annual_visits ?x2 . ?x2 fb:measurement_unit.dated_integer.number ?x1 } } } LIMIT 9999", 
    "utterance": "how many people visit the new york public library annually", 
    "id": 596
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.the_wind-up_bird_chronicle fb:book.written_work.original_language ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Japanese Language"
    ], 
    "targetFormula": "(!fb:book.written_work.original_language fb:en.the_wind-up_bird_chronicle)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.051r3l fb:book.written_work.original_language ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what is the original language of the wind-up bird chronicle", 
    "id": 597
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.arignar_anna_zoological_park fb:zoos.zoo.exhibits ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Terrestrial Aviary", 
      "Reptile House/Serpentarium", 
      "Crocodile Enclosure", 
      "World of Nocturnal Animals", 
      "Amphibian House", 
      "Butterfly House", 
      "Small Mammals House", 
      "Primate House", 
      "Sanctuary Aviaries"
    ], 
    "targetFormula": "(!fb:zoos.zoo.exhibits fb:en.arignar_anna_zoological_park)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.0772jt fb:zoos.zoo.exhibits ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what exhibits are there at the arignar anna zoological park", 
    "id": 598
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.western_conference fb:ice_hockey.hockey_conference.divisions ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Northwest Division", 
      "Pacific Division", 
      "Central Division"
    ], 
    "targetFormula": "(!fb:ice_hockey.hockey_conference.divisions fb:en.western_conference)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.0c9n_3 fb:ice_hockey.hockey_conference.divisions ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what are the divisions of the western conference of the nhl", 
    "id": 599
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 ?x2name WHERE { ?x1 fb:projects.project_participation.project fb:en.manhattan_project . FILTER (?x1 != fb:en.manhattan_project) . ?x1 fb:projects.project_participation.participant fb:en.robert_oppenheimer . FILTER (?x1 != fb:en.robert_oppenheimer) . ?x1 fb:projects.project_participation.role ?x2 . OPTIONAL { ?x2 fb:type.object.name ?x2name } } LIMIT 9999", 
    "result": [
      "Director of Research"
    ], 
    "targetFormula": "(!fb:projects.project_participation.role (and ((lambda x (fb:projects.project_participation.project (var x))) fb:en.manhattan_project) ((lambda x (fb:projects.project_participation.participant (var x))) fb:en.robert_oppenheimer)))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 ?x2name WHERE { ?x1 fb:projects.project_participation.project fb:m.04yp5 . FILTER (?x1 != fb:m.04yp5) . ?x1 fb:projects.project_participation.participant fb:m.09qxy . FILTER (?x1 != fb:m.09qxy) . ?x1 fb:projects.project_participation.role ?x2 . OPTIONAL { ?x2 fb:type.object.name ?x2name } } LIMIT 9999", 
    "utterance": "what was robert oppenheimer's role in the manhattan project", 
    "id": 600
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { fb:en.school_district_of_philadelphia fb:education.school_district.schools ?x1 } } } LIMIT 9999", 
    "result": [
      "293"
    ], 
    "targetFormula": "(count (!fb:education.school_district.schools fb:en.school_district_of_philadelphia))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { fb:m.074dxf fb:education.school_district.schools ?x1 } } } LIMIT 9999", 
    "utterance": "how many schools are in the school district of philadelphia", 
    "id": 601
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:en.2006_winter_olympics fb:olympics.olympic_games.number_of_countries ?x1 } LIMIT 9999", 
    "result": [
      "80"
    ], 
    "targetFormula": "(!fb:olympics.olympic_games.number_of_countries fb:en.2006_winter_olympics)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.0kbvv fb:olympics.olympic_games.number_of_countries ?x1 } LIMIT 9999", 
    "utterance": "how many countries participated in the 2006 winter olympics", 
    "id": 602
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.court_of_chancery fb:law.court.jurisdiction ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "England and Wales"
    ], 
    "targetFormula": "(!fb:law.court.jurisdiction fb:en.court_of_chancery)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.015r91 fb:law.court.jurisdiction ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "over what area does the court of chancery have jurisdiction", 
    "id": 603
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { fb:en.powershot_tx1 fb:digicams.digital_camera.street_price ?x1 . ?x1 fb:measurement_unit.dated_money_value.amount ?x2 } LIMIT 9999", 
    "result": [
      "499.99"
    ], 
    "targetFormula": "(!fb:measurement_unit.dated_money_value.amount (!fb:digicams.digital_camera.street_price fb:en.powershot_tx1))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { fb:m.03csvxk fb:digicams.digital_camera.street_price ?x1 . ?x1 fb:measurement_unit.dated_money_value.amount ?x2 } LIMIT 9999", 
    "utterance": "how much did a canon powershot tx1 cost when it was released", 
    "id": 604
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 ?x2name WHERE { ?x1 fb:martial_arts.martial_arts_certification.art fb:en.seishindo_kenpo . FILTER (?x1 != fb:en.seishindo_kenpo) . ?x1 fb:martial_arts.martial_arts_certification.person fb:en.woody_strode . FILTER (?x1 != fb:en.woody_strode) . ?x1 fb:martial_arts.martial_arts_certification.qualification ?x2 . OPTIONAL { ?x2 fb:type.object.name ?x2name } } LIMIT 9999", 
    "result": [
      "Black belt"
    ], 
    "targetFormula": "(!fb:martial_arts.martial_arts_certification.qualification (and ((lambda x (fb:martial_arts.martial_arts_certification.art (var x))) fb:en.seishindo_kenpo) ((lambda x (fb:martial_arts.martial_arts_certification.person (var x))) fb:en.woody_strode)))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 ?x2name WHERE { ?x1 fb:martial_arts.martial_arts_certification.art fb:m.03cjpb3 . FILTER (?x1 != fb:m.03cjpb3) . ?x1 fb:martial_arts.martial_arts_certification.person fb:m.06_qlq . FILTER (?x1 != fb:m.06_qlq) . ?x1 fb:martial_arts.martial_arts_certification.qualification ?x2 . OPTIONAL { ?x2 fb:type.object.name ?x2name } } LIMIT 9999", 
    "utterance": "what qualification does woody strode have in seishindo kenpo", 
    "id": 605
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x3 WHERE { { SELECT DISTINCT count(?x1) AS ?x3 WHERE { ?x2 fb:exhibitions.exhibition_run.venue fb:en.science_museum_great_britain . FILTER (?x2 != fb:en.science_museum_great_britain) . ?x2 fb:exhibitions.exhibition_run.exhibition ?x1 } } } LIMIT 9999", 
    "result": [
      "90"
    ], 
    "targetFormula": "(count (!fb:exhibitions.exhibition_run.exhibition ((lambda x (fb:exhibitions.exhibition_run.venue (var x))) fb:en.science_museum_great_britain)))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x3 WHERE { { SELECT DISTINCT count(?x1) AS ?x3 WHERE { ?x2 fb:exhibitions.exhibition_run.venue fb:m.013yrz . FILTER (?x2 != fb:m.013yrz) . ?x2 fb:exhibitions.exhibition_run.exhibition ?x1 } } } LIMIT 9999", 
    "utterance": "how many free exhibits have there been at the science museum", 
    "id": 606
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { fb:en.leonardo_da_vinci fb:exhibitions.exhibition_subject.exhibitions_created_about_this_subject ?x1 } } } LIMIT 9999", 
    "result": [
      "10"
    ], 
    "targetFormula": "(count (!fb:exhibitions.exhibition_subject.exhibitions_created_about_this_subject fb:en.leonardo_da_vinci))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { fb:m.04lg6 fb:exhibitions.exhibition_subject.exhibitions_created_about_this_subject ?x1 } } } LIMIT 9999", 
    "utterance": "how many exhibitions have there been about leonardo da vinci", 
    "id": 607
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { ?x1 fb:automotive.us_fuel_economy.trim_level fb:m.04nbbrp . FILTER (?x1 != fb:m.04nbbrp) . ?x1 fb:automotive.us_fuel_economy.highway_mpg ?x2 } LIMIT 9999", 
    "result": [
      "45"
    ], 
    "targetFormula": "(!fb:automotive.us_fuel_economy.highway_mpg ((lambda x (fb:automotive.us_fuel_economy.trim_level (var x))) fb:m.04nbbrp))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { ?x1 fb:automotive.us_fuel_economy.trim_level fb:m.04nbbrp . FILTER (?x1 != fb:m.04nbbrp) . ?x1 fb:automotive.us_fuel_economy.highway_mpg ?x2 } LIMIT 9999", 
    "utterance": "what is the highway fuel economy of a 2007 honda civic hybrid", 
    "id": 608
  }
]
