[
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:en.a_dream_of_a_thousand_cats fb:comic_books.comic_book_issue.issue_number ?x1 } LIMIT 9999", 
    "result": [
      "18"
    ], 
    "targetFormula": "(!fb:comic_books.comic_book_issue.issue_number fb:en.a_dream_of_a_thousand_cats)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.02_57r_ fb:comic_books.comic_book_issue.issue_number ?x1 } LIMIT 9999", 
    "utterance": "what issue of sandman is a dream of a thousand cats", 
    "id": 531
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 ?x2name WHERE { ?x1 fb:celebrities.rehab.rehab_facility fb:en.betty_ford_center . FILTER (?x1 != fb:en.betty_ford_center) . ?x1 fb:celebrities.rehab.celebrity ?x2 . OPTIONAL { ?x2 fb:type.object.name ?x2name } } LIMIT 9999", 
    "result": [
      "Stevie Nicks", 
      "Keith Urban", 
      "Jerry Garcia"
    ], 
    "targetFormula": "(!fb:celebrities.rehab.celebrity ((lambda x (fb:celebrities.rehab.rehab_facility (var x))) fb:en.betty_ford_center))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 ?x2name WHERE { ?x1 fb:celebrities.rehab.rehab_facility fb:m.02dp0n . FILTER (?x1 != fb:m.02dp0n) . ?x1 fb:celebrities.rehab.celebrity ?x2 . OPTIONAL { ?x2 fb:type.object.name ?x2name } } LIMIT 9999", 
    "utterance": "what celebrities have gone to the betty ford center", 
    "id": 532
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x3 WHERE { { SELECT DISTINCT count(?x1) AS ?x3 WHERE { ?x2 fb:celebrities.legal_entanglement.celebrity fb:en.lindsay_lohan . FILTER (?x2 != fb:en.lindsay_lohan) . ?x2 fb:celebrities.legal_entanglement.location ?x1 } } } LIMIT 9999", 
    "result": [
      "2"
    ], 
    "targetFormula": "(count (!fb:celebrities.legal_entanglement.location ((lambda x (fb:celebrities.legal_entanglement.celebrity (var x))) fb:en.lindsay_lohan)))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x3 WHERE { { SELECT DISTINCT count(?x1) AS ?x3 WHERE { ?x2 fb:celebrities.legal_entanglement.celebrity fb:m.01pgzn_ . FILTER (?x2 != fb:m.01pgzn_) . ?x2 fb:celebrities.legal_entanglement.location ?x1 } } } LIMIT 9999", 
    "utterance": "how many legal offences has lindsey lohan committed", 
    "id": 533
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x3 WHERE { { SELECT DISTINCT count(?x1) AS ?x3 WHERE { ?x2 fb:cvg.musical_game_song_relationship.game fb:en.guitar_hero_aerosmith . FILTER (?x2 != fb:en.guitar_hero_aerosmith) . ?x2 fb:cvg.musical_game_song_relationship.song ?x1 } } } LIMIT 9999", 
    "result": [
      "57"
    ], 
    "targetFormula": "(count (!fb:cvg.musical_game_song_relationship.song ((lambda x (fb:cvg.musical_game_song_relationship.game (var x))) fb:en.guitar_hero_aerosmith)))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x3 WHERE { { SELECT DISTINCT count(?x1) AS ?x3 WHERE { ?x2 fb:cvg.musical_game_song_relationship.game fb:m.03nsxzp . FILTER (?x2 != fb:m.03nsxzp) . ?x2 fb:cvg.musical_game_song_relationship.song ?x1 } } } LIMIT 9999", 
    "utterance": "how many songs are there for guitar hero: aerosmith", 
    "id": 534
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { fb:en.sinking_of_the_titanic fb:event.disaster.survivors ?x1 } } } LIMIT 9999", 
    "result": [
      "45"
    ], 
    "targetFormula": "(count (!fb:event.disaster.survivors fb:en.sinking_of_the_titanic))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { fb:m.059ksb9 fb:event.disaster.survivors ?x1 } } } LIMIT 9999", 
    "utterance": "how many people survived the sinking of the titanic", 
    "id": 535
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { fb:location.citytown fb:freebase.type_profile.equivalent_topic ?x1 } } } LIMIT 9999", 
    "result": [
      "0"
    ], 
    "targetFormula": "(count (!fb:freebase.type_profile.equivalent_topic fb:location.citytown))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { fb:location.citytown fb:freebase.type_profile.equivalent_topic ?x1 } } } LIMIT 9999", 
    "utterance": "how many topics are equivalent to city/town/village", 
    "id": 536
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:en.indonesian_rupiah fb:finance.currency.currency_code ?x1 } LIMIT 9999", 
    "result": [
      "IDR"
    ], 
    "targetFormula": "(!fb:finance.currency.currency_code fb:en.indonesian_rupiah)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.0203sy fb:finance.currency.currency_code ?x1 } LIMIT 9999", 
    "utterance": "what is the currency code for the indonesian rupiah", 
    "id": 537
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x3 WHERE { { SELECT DISTINCT count(?x1) AS ?x3 WHERE { fb:en.detroit_public_library fb:library.public_library_system.collection_size ?x2 . ?x2 fb:measurement_unit.dated_integer.number ?x1 } } } LIMIT 9999", 
    "result": [
      "1"
    ], 
    "targetFormula": "(count (!fb:measurement_unit.dated_integer.number (!fb:library.public_library_system.collection_size fb:en.detroit_public_library)))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x3 WHERE { { SELECT DISTINCT count(?x1) AS ?x3 WHERE { fb:m.026_j8t fb:library.public_library_system.collection_size ?x2 . ?x2 fb:measurement_unit.dated_integer.number ?x1 } } } LIMIT 9999", 
    "utterance": "how many books does the detroit public library have", 
    "id": 538
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { ?x1 fb:sports.sports_team_roster.player fb:en.kevin_youkilis . FILTER (?x1 != fb:en.kevin_youkilis) . ?x1 fb:sports.sports_team_roster.team fb:en.boston_red_sox . FILTER (?x1 != fb:en.boston_red_sox) . ?x1 fb:sports.sports_team_roster.number ?x2 } LIMIT 9999", 
    "result": [
      "20"
    ], 
    "targetFormula": "(!fb:sports.sports_team_roster.number (and ((lambda x (fb:sports.sports_team_roster.player (var x))) fb:en.kevin_youkilis) ((lambda x (fb:sports.sports_team_roster.team (var x))) fb:en.boston_red_sox)))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { ?x1 fb:sports.sports_team_roster.player fb:m.03l3rf . FILTER (?x1 != fb:m.03l3rf) . ?x1 fb:sports.sports_team_roster.team fb:m.01d5z . FILTER (?x1 != fb:m.01d5z) . ?x1 fb:sports.sports_team_roster.number ?x2 } LIMIT 9999", 
    "utterance": "what number is kevin youkilis on the boston red sox", 
    "id": 539
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 ?x2name WHERE { fb:en.apple_inc fb:organization.organization.headquarters ?x1 . FILTER (?x1 != fb:en.apple_inc) . ?x1 fb:location.mailing_address.citytown ?x2 . OPTIONAL { ?x2 fb:type.object.name ?x2name } } LIMIT 9999", 
    "result": [
      "Cupertino"
    ], 
    "targetFormula": "(!fb:location.mailing_address.citytown ((lambda x (!fb:organization.organization.headquarters (var x))) fb:en.apple_inc))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 ?x2name WHERE { fb:m.0k8z fb:organization.organization.headquarters ?x1 . FILTER (?x1 != fb:m.0k8z) . ?x1 fb:location.mailing_address.citytown ?x2 . OPTIONAL { ?x2 fb:type.object.name ?x2name } } LIMIT 9999", 
    "utterance": "what is the address of the apple, inc. headquarters", 
    "id": 540
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { fb:en.magic_kingdom fb:amusement_parks.park.annual_visits ?x1 . ?x1 fb:measurement_unit.dated_integer.number ?x2 } LIMIT 9999", 
    "result": [
      "17000000"
    ], 
    "targetFormula": "(!fb:measurement_unit.dated_integer.number (!fb:amusement_parks.park.annual_visits fb:en.magic_kingdom))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { fb:m.02mv6p fb:amusement_parks.park.annual_visits ?x1 . ?x1 fb:measurement_unit.dated_integer.number ?x2 } LIMIT 9999", 
    "utterance": "how many visits does the magic kingdom get per year", 
    "id": 541
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { ?x1 fb:geology.geological_formation.formed_during_period fb:en.barremian . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Lakota Formation"
    ], 
    "targetFormula": "(fb:geology.geological_formation.formed_during_period fb:en.barremian)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { ?x1 fb:geology.geological_formation.formed_during_period fb:m.02yvwr . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what rock formations formed in the barremian period", 
    "id": 542
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x3 WHERE { { SELECT DISTINCT count(?x1) AS ?x3 WHERE { ?x2 fb:olympics.olympic_medal_honor.medal fb:en.gold_medal . FILTER (?x2 != fb:en.gold_medal) . ?x2 fb:olympics.olympic_medal_honor.medalist ?x1 } } } LIMIT 9999", 
    "result": [
      "5602"
    ], 
    "targetFormula": "(count (!fb:olympics.olympic_medal_honor.medalist ((lambda x (fb:olympics.olympic_medal_honor.medal (var x))) fb:en.gold_medal)))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x3 WHERE { { SELECT DISTINCT count(?x1) AS ?x3 WHERE { ?x2 fb:olympics.olympic_medal_honor.medal fb:m.02lpp7 . FILTER (?x2 != fb:m.02lpp7) . ?x2 fb:olympics.olympic_medal_honor.medalist ?x1 } } } LIMIT 9999", 
    "utterance": "how many athletes have gotten an olympic gold medal", 
    "id": 543
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 ?x2name WHERE { ?x1 fb:basketball.basketball_roster_position.team fb:en.washington_wizards . FILTER (?x1 != fb:en.washington_wizards) . ?x1 fb:basketball.basketball_roster_position.number 6.0 . FILTER (?x1 != 6.0) . ?x1 fb:basketball.basketball_roster_position.player ?x2 . OPTIONAL { ?x2 fb:type.object.name ?x2name } } LIMIT 9999", 
    "result": [], 
    "targetFormula": "(!fb:basketball.basketball_roster_position.player (and ((lambda x (fb:basketball.basketball_roster_position.team (var x))) fb:en.washington_wizards) ((lambda x (fb:basketball.basketball_roster_position.number (var x))) (number 6.0 fb:en.unitless))))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 ?x2name WHERE { ?x1 fb:basketball.basketball_roster_position.team fb:m.0jm5b . FILTER (?x1 != fb:m.0jm5b) . ?x1 fb:basketball.basketball_roster_position.number 6.0 . FILTER (?x1 != 6.0) . ?x1 fb:basketball.basketball_roster_position.player ?x2 . OPTIONAL { ?x2 fb:type.object.name ?x2name } } LIMIT 9999", 
    "utterance": "who is currently number 6 on the washington wizards", 
    "id": 544
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.straight_and_true fb:tv.tv_series_episode.writer ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "David Simon", 
      "Ed Burns"
    ], 
    "targetFormula": "(!fb:tv.tv_series_episode.writer fb:en.straight_and_true)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.0g28q4 fb:tv.tv_series_episode.writer ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "who wrote the episode straight and true of the wire", 
    "id": 545
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:en.order_of_the_golden_fleece fb:royalty.order_of_chivalry.motto ?x1 } LIMIT 9999", 
    "result": [
      "Pretium Laborum Non Vile"
    ], 
    "targetFormula": "(!fb:royalty.order_of_chivalry.motto fb:en.order_of_the_golden_fleece)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.02q5pd fb:royalty.order_of_chivalry.motto ?x1 } LIMIT 9999", 
    "utterance": "what is the motto of the order of the golden fleece", 
    "id": 546
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:en.roller_soaker fb:amusement_parks.ride.height_restriction ?x1 } LIMIT 9999", 
    "result": [
      "1.0668"
    ], 
    "targetFormula": "(!fb:amusement_parks.ride.height_restriction fb:en.roller_soaker)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.0gppsv fb:amusement_parks.ride.height_restriction ?x1 } LIMIT 9999", 
    "utterance": "what is the height restriction on the roller soaker", 
    "id": 547
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { ?x1 fb:travel.travel_destination_monthly_climate.travel_destination fb:en.sydney . FILTER (?x1 != fb:en.sydney) . ?x1 fb:travel.travel_destination_monthly_climate.month fb:en.august . FILTER (?x1 != fb:en.august) . ?x1 fb:travel.travel_destination_monthly_climate.average_max_temp_c ?x2 } LIMIT 9999", 
    "result": [
      "17"
    ], 
    "targetFormula": "(!fb:travel.travel_destination_monthly_climate.average_max_temp_c (and ((lambda x (fb:travel.travel_destination_monthly_climate.travel_destination (var x))) fb:en.sydney) ((lambda x (fb:travel.travel_destination_monthly_climate.month (var x))) fb:en.august)))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { ?x1 fb:travel.travel_destination_monthly_climate.travel_destination fb:m.06y57 . FILTER (?x1 != fb:m.06y57) . ?x1 fb:travel.travel_destination_monthly_climate.month fb:m.0ll3 . FILTER (?x1 != fb:m.0ll3) . ?x1 fb:travel.travel_destination_monthly_climate.average_max_temp_c ?x2 } LIMIT 9999", 
    "utterance": "what is the average temperature in sydney in august", 
    "id": 549
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:en.tryptophan fb:biology.amino_acid.single_letter_abbreviation ?x1 } LIMIT 9999", 
    "result": [
      "W"
    ], 
    "targetFormula": "(!fb:biology.amino_acid.single_letter_abbreviation fb:en.tryptophan)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.0fzjh fb:biology.amino_acid.single_letter_abbreviation ?x1 } LIMIT 9999", 
    "utterance": "what is the single letter abreviation for tryptophan", 
    "id": 550
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.053x52 fb:tv.tv_program.program_creator ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Kevin Eastman", 
      "Peter Laird"
    ], 
    "targetFormula": "(!fb:tv.tv_program.program_creator fb:m.053x52)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.053x52 fb:tv.tv_program.program_creator ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "who are the creators of teenage mutant ninja turtles", 
    "id": 551
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.united_states_presidential_election_1964 fb:government.election.winner ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Lyndon B. Johnson"
    ], 
    "targetFormula": "(!fb:government.election.winner fb:en.united_states_presidential_election_1964)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.0b3fd fb:government.election.winner ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "who won the 1964 united states presidential election", 
    "id": 552
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.tempelhof_international_airport fb:location.location.containedby ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Berlin", 
      "Germany"
    ], 
    "targetFormula": "(!fb:location.location.containedby fb:en.tempelhof_international_airport)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.01nxx6 fb:location.location.containedby ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "where is the tempelhof international airport located", 
    "id": 553
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:en.boston_molasses_disaster fb:event.disaster.fatalities ?x1 } LIMIT 9999", 
    "result": [
      "21"
    ], 
    "targetFormula": "(!fb:event.disaster.fatalities fb:en.boston_molasses_disaster)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.07mnj fb:event.disaster.fatalities ?x1 } LIMIT 9999", 
    "utterance": "how many people died in the boston molasses disaster", 
    "id": 554
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 ?x2name WHERE { ?x1 fb:award.award_nomination.award fb:en.peoples_choice_award_for_favorite_comedy_movie . FILTER (?x1 != fb:en.peoples_choice_award_for_favorite_comedy_movie) . ?x1 fb:award.award_nomination.nominated_for ?x2 . OPTIONAL { ?x2 fb:type.object.name ?x2name } } LIMIT 9999", 
    "result": [
      "My Big Fat Greek Wedding", 
      "Knocked Up", 
      "The Proposal", 
      "Crazy, Stupid, Love.", 
      "Big", 
      "Mrs. Doubtfire", 
      "Wedding Crashers", 
      "The Simpsons Movie", 
      "Hitch", 
      "Bruce Almighty", 
      "Click", 
      "The Santa Clause", 
      "Sex and the City 2", 
      "Dark Shadows", 
      "Home Alone 2: Lost in New York", 
      "Mean Girls", 
      "Liar Liar", 
      "Sister Act", 
      "Shrek 2", 
      "Three Men and a Baby", 
      "Twins", 
      "Look Who's Talking", 
      "Meet the Parents", 
      "Valentine's Day", 
      "Grown Ups", 
      "Bride Wars", 
      "Mamma Mia!", 
      "He's Just Not That Into You", 
      "Talladega Nights: The Ballad of Ricky Bobby", 
      "Failure to Launch", 
      "Wild Hogs", 
      "Ted", 
      "Friends with Benefits", 
      "21 Jump Street", 
      "Anchorman: The Legend of Ron Burgundy", 
      "The Hangover", 
      "The Hangover: Part II", 
      "17 Again", 
      "Bridget Jones: The Edge of Reason", 
      "The Nutty Professor", 
      "Get Smart", 
      "Big Daddy", 
      "13 Going on 30", 
      "27 Dresses", 
      "The Longest Yard", 
      "Easy A", 
      "Bridesmaids", 
      "Pitch Perfect", 
      "There's Something About Mary", 
      "Bad Teacher", 
      "Pretty Woman", 
      "Date Night", 
      "What to Expect When You're Expecting", 
      "City Slickers", 
      "Grumpier Old Men"
    ], 
    "targetFormula": "(!fb:award.award_nomination.nominated_for ( (lambda x (fb:award.award_nomination.award (var x))) fb:en.peoples_choice_award_for_favorite_comedy_movie))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 ?x2name WHERE { ?x1 fb:award.award_nomination.award fb:m.09rpw9q . FILTER (?x1 != fb:m.09rpw9q) . ?x1 fb:award.award_nomination.nominated_for ?x2 . OPTIONAL { ?x2 fb:type.object.name ?x2name } } LIMIT 9999", 
    "utterance": "what movies were nominated for favorite comedy movie", 
    "id": 555
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 ?x2name WHERE { ?x1 fb:soccer.football_goal.match fb:en.2006_fifa_world_cup_final . FILTER (?x1 != fb:en.2006_fifa_world_cup_final) . ?x1 fb:soccer.football_goal.scorer ?x2 . OPTIONAL { ?x2 fb:type.object.name ?x2name } } LIMIT 9999", 
    "result": [
      "Zinedine Zidane", 
      "Marco Materazzi"
    ], 
    "targetFormula": "(!fb:soccer.football_goal.scorer ((lambda x (fb:soccer.football_goal.match (var x))) fb:en.2006_fifa_world_cup_final))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 ?x2name WHERE { ?x1 fb:soccer.football_goal.match fb:m.03bxjjf . FILTER (?x1 != fb:m.03bxjjf) . ?x1 fb:soccer.football_goal.scorer ?x2 . OPTIONAL { ?x2 fb:type.object.name ?x2name } } LIMIT 9999", 
    "utterance": "what players scored in the 2006 fifa world cup final", 
    "id": 556
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:en.rudi_koertzen fb:cricket.cricket_umpire.test_matches_refereed ?x1 } LIMIT 9999", 
    "result": [
      "81"
    ], 
    "targetFormula": "(!fb:cricket.cricket_umpire.test_matches_refereed fb:en.rudi_koertzen)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.06h4yp fb:cricket.cricket_umpire.test_matches_refereed ?x1 } LIMIT 9999", 
    "utterance": "how many test conferences has rudi koertzen refereed", 
    "id": 557
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { fb:en.north_america fb:base.dinosaur.dinosaur_location.dinosaur_s ?x1 } } } LIMIT 9999", 
    "result": [
      "2"
    ], 
    "targetFormula": "(count (!fb:base.dinosaur.dinosaur_location.dinosaur_s fb:en.north_america))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { fb:m.059g4 fb:base.dinosaur.dinosaur_location.dinosaur_s ?x1 } } } LIMIT 9999", 
    "utterance": "how many dinosaur species are there in north america", 
    "id": 558
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x3 WHERE { { SELECT DISTINCT count(?x1) AS ?x3 WHERE { ?x2 fb:military.military_command.military_commander fb:en.benito_mussolini . FILTER (?x2 != fb:en.benito_mussolini) . ?x2 fb:military.military_command.military_conflict ?x1 } } } LIMIT 9999", 
    "result": [
      "9"
    ], 
    "targetFormula": "(count (!fb:military.military_command.military_conflict ((lambda x (fb:military.military_command.military_commander (var x))) fb:en.benito_mussolini)))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x3 WHERE { { SELECT DISTINCT count(?x1) AS ?x3 WHERE { ?x2 fb:military.military_command.military_commander fb:m.0177g . FILTER (?x2 != fb:m.0177g) . ?x2 fb:military.military_command.military_conflict ?x1 } } } LIMIT 9999", 
    "utterance": "in how many military conflicts did mussolini command", 
    "id": 559
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { fb:en.sigma_phi_epsilon fb:education.fraternity_sorority.colleges_and_universities ?x1 } } } LIMIT 9999", 
    "result": [
      "8"
    ], 
    "targetFormula": "(count (!fb:education.fraternity_sorority.colleges_and_universities fb:en.sigma_phi_epsilon))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { fb:m.01sfg5 fb:education.fraternity_sorority.colleges_and_universities ?x1 } } } LIMIT 9999", 
    "utterance": "how many schools have a chapter of sigma phi epsilon", 
    "id": 560
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.a_right_to_death fb:radio.radio_program_episode.program ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Second Sunday"
    ], 
    "targetFormula": "(!fb:radio.radio_program_episode.program fb:en.a_right_to_death)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.065m8h8 fb:radio.radio_program_episode.program ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what radio program is a right to death an episode of", 
    "id": 561
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.0kjl0q fb:common.image.size ?x1 } LIMIT 9999", 
    "result": [
      "m.0kjl13"
    ], 
    "targetFormula": "(!fb:common.image.size fb:m.0kjl0q)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.0kjl0q fb:common.image.size ?x1 } LIMIT 9999", 
    "utterance": "what are the dimensions of the matrix reloaded image", 
    "id": 562
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { fb:en.2006_fifa_world_cup_final fb:soccer.football_match.attendance ?x1 } } } LIMIT 9999", 
    "result": [
      "1"
    ], 
    "targetFormula": "(count (!fb:soccer.football_match.attendance fb:en.2006_fifa_world_cup_final))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { fb:m.03bxjjf fb:soccer.football_match.attendance ?x1 } } } LIMIT 9999", 
    "utterance": "how many people were at the 2006 fifa world cup final", 
    "id": 563
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { fb:en.us fb:common.topic.alias ?x1 } } } LIMIT 9999", 
    "result": [
      "9"
    ], 
    "targetFormula": "(count (!fb:common.topic.alias fb:en.us))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { fb:m.09nqf fb:common.topic.alias ?x1 } } } LIMIT 9999", 
    "utterance": "how many other names are there for the usa_s currency", 
    "id": 564
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.0cdlng fb:amusement_parks.ride.height_restriction ?x1 } LIMIT 9999", 
    "result": [
      "1.2192"
    ], 
    "targetFormula": "(!fb:amusement_parks.ride.height_restriction fb:m.0cdlng)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.0cdlng fb:amusement_parks.ride.height_restriction ?x1 } LIMIT 9999", 
    "utterance": "how tall do you have to be to ride the american eagle", 
    "id": 565
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:en.g_h_mumm_cordon_rouge_brut fb:wine.wine.percentage_alcohol ?x1 } LIMIT 9999", 
    "result": [
      "12"
    ], 
    "targetFormula": "(!fb:wine.wine.percentage_alcohol fb:en.g_h_mumm_cordon_rouge_brut)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.02wsr4g fb:wine.wine.percentage_alcohol ?x1 } LIMIT 9999", 
    "utterance": "what percent alcohol is a g.h. mumm cordon rouge brut", 
    "id": 566
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { fb:en.cessna_citation_x fb:aviation.aircraft_model.passengers ?x1 . ?x1 fb:measurement_unit.integer_range.high_value ?x2 } LIMIT 9999", 
    "result": [
      "12"
    ], 
    "targetFormula": "(!fb:measurement_unit.integer_range.high_value (!fb:aviation.aircraft_model.passengers fb:en.cessna_citation_x))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { fb:m.023jwr fb:aviation.aircraft_model.passengers ?x1 . ?x1 fb:measurement_unit.integer_range.high_value ?x2 } LIMIT 9999", 
    "utterance": "what is the passenger capacity of a cessna citation x", 
    "id": 567
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.london_heathrow_airport fb:aviation.airport.hub_for ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Skyways Limited", 
      "British European Airways", 
      "Lufthansa", 
      "bmi", 
      "British Overseas Airways Corporation", 
      "Canadian Affair", 
      "British Airways", 
      "Pan American World Airways", 
      "BMI Regional", 
      "Virgin Atlantic", 
      "British Mediterranean Airways", 
      "British Eagle", 
      "Hunting-Clan Air Transport"
    ], 
    "targetFormula": "(!fb:aviation.airport.hub_for fb:en.london_heathrow_airport)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.03jn4 fb:aviation.airport.hub_for ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what airlines is the london heathrow airport a hub for", 
    "id": 568
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { ?x1 fb:american_football.football_historical_roster_position.team fb:en.philadelphia_eagles . FILTER (?x1 != fb:en.philadelphia_eagles) . ?x1 fb:american_football.football_historical_roster_position.player fb:en.david_akers . FILTER (?x1 != fb:en.david_akers) . ?x1 fb:american_football.football_historical_roster_position.number ?x2 } LIMIT 9999", 
    "result": [
      "2"
    ], 
    "targetFormula": "(!fb:american_football.football_historical_roster_position.number (and ( (lambda x (fb:american_football.football_historical_roster_position.team (var x))) fb:en.philadelphia_eagles) ( (lambda x (fb:american_football.football_historical_roster_position.player (var x))) fb:en.david_akers)))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { ?x1 fb:american_football.football_historical_roster_position.team fb:m.05tg3 . FILTER (?x1 != fb:m.05tg3) . ?x1 fb:american_football.football_historical_roster_position.player fb:m.02ctg7 . FILTER (?x1 != fb:m.02ctg7) . ?x1 fb:american_football.football_historical_roster_position.number ?x2 } LIMIT 9999", 
    "utterance": "what number was david akers on the philadelphia eagles", 
    "id": 569
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:en.hurricane_katrina fb:meteorology.tropical_cyclone.highest_winds ?x1 } LIMIT 9999", 
    "result": [
      "280"
    ], 
    "targetFormula": "(!fb:meteorology.tropical_cyclone.highest_winds fb:en.hurricane_katrina)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.07nnlb fb:meteorology.tropical_cyclone.highest_winds ?x1 } LIMIT 9999", 
    "utterance": "what were the highest wind speeds in hurricane katrina", 
    "id": 570
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.kitty_pryde fb:comic_books.comic_book_character.first_appearance ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Uncanny X-Men #129"
    ], 
    "targetFormula": "(!fb:comic_books.comic_book_character.first_appearance fb:en.kitty_pryde)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.02321x fb:comic_books.comic_book_character.first_appearance ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "in which comic book issue did kitty pryde first appear", 
    "id": 571
  }
]
