[
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.uluru fb:geology.geological_formation.formed_during_period ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Paleozoic"
    ], 
    "targetFormula": "(!fb:geology.geological_formation.formed_during_period fb:en.uluru)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.0_5xc fb:geology.geological_formation.formed_during_period ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "during what time period did uluru form", 
    "id": 282
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x3 WHERE { { SELECT DISTINCT count(?x1) AS ?x3 WHERE { ?x2 fb:american_football.football_historical_roster_position.player fb:en.jim_thorpe . FILTER (?x2 != fb:en.jim_thorpe) . ?x2 fb:american_football.football_historical_roster_position.team ?x1 } } } LIMIT 9999", 
    "result": [
      "10"
    ], 
    "targetFormula": "(count (!fb:american_football.football_historical_roster_position.team ( (lambda x (fb:american_football.football_historical_roster_position.player (var x))) fb:en.jim_thorpe)))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x3 WHERE { { SELECT DISTINCT count(?x1) AS ?x3 WHERE { ?x2 fb:american_football.football_historical_roster_position.player fb:m.0f2zc . FILTER (?x2 != fb:m.0f2zc) . ?x2 fb:american_football.football_historical_roster_position.team ?x1 } } } LIMIT 9999", 
    "utterance": "how many teams did jim thorpe play for", 
    "id": 283
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x3 WHERE { { SELECT DISTINCT count(?x1) AS ?x3 WHERE { ?x2 fb:boats.ship_ownership.owner fb:en.navy_dept . FILTER (?x2 != fb:en.navy_dept) . ?x2 fb:boats.ship_ownership.ship ?x1 } } } LIMIT 9999", 
    "result": [
      "283"
    ], 
    "targetFormula": "(count (!fb:boats.ship_ownership.ship ((lambda x (fb:boats.ship_ownership.owner (var x))) fb:en.navy_dept)))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x3 WHERE { { SELECT DISTINCT count(?x1) AS ?x3 WHERE { ?x2 fb:boats.ship_ownership.owner fb:m.06hhp . FILTER (?x2 != fb:m.06hhp) . ?x2 fb:boats.ship_ownership.ship ?x1 } } } LIMIT 9999", 
    "utterance": "how many boats does the royal navy own", 
    "id": 284
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.leukemia fb:medicine.disease.treatments ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Radiation therapy", 
      "Hematopoietic stem cell transplantation", 
      "Pipobroman", 
      "Methotrexate", 
      "Immunotherapy", 
      "Irinotecan", 
      "Isotretinoin", 
      "Doxorubicin", 
      "Vincristine", 
      "Cytarabine", 
      "Chemotherapy", 
      "Imatinib"
    ], 
    "targetFormula": "(!fb:medicine.disease.treatments fb:en.leukemia)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.04psf fb:medicine.disease.treatments ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what treatments are there for leukemia", 
    "id": 285
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.egypt fb:olympics.olympic_participating_country.olympics_participated_in ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "1936 Summer Olympics", 
      "2008 Summer Olympics", 
      "1952 Summer Olympics"
    ], 
    "targetFormula": "(!fb:olympics.olympic_participating_country.olympics_participated_in fb:en.egypt)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.02k54 fb:olympics.olympic_participating_country.olympics_participated_in ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what olympics has egypt participated in", 
    "id": 287
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { ?x1 fb:food.beer_containment.beer fb:en.pilsner_urquell . FILTER (?x1 != fb:en.pilsner_urquell) . ?x1 fb:food.beer_containment.size ?x2 } LIMIT 9999", 
    "result": [
      "330", 
      "500"
    ], 
    "targetFormula": "(!fb:food.beer_containment.size ((lambda x (fb:food.beer_containment.beer (var x))) fb:en.pilsner_urquell))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { ?x1 fb:food.beer_containment.beer fb:m.031n3s . FILTER (?x1 != fb:m.031n3s) . ?x1 fb:food.beer_containment.size ?x2 } LIMIT 9999", 
    "utterance": "what sizes does pilsner urquell come in", 
    "id": 288
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.09y2k2 fb:dining.cuisine.ingredients ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Marsala wine", 
      "Italian Integrale flour", 
      "Sage", 
      "Parmigiano-Reggiano", 
      "Ham", 
      "Tomato", 
      "Guanciale", 
      "Extra virgin olive oil", 
      "Pecorino Romano", 
      "Pasta"
    ], 
    "targetFormula": "(!fb:dining.cuisine.ingredients fb:m.09y2k2)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.09y2k2 fb:dining.cuisine.ingredients ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what ingredients are in italian cuisine", 
    "id": 289
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.lepton fb:physics.particle_family.particles ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Neutrino", 
      "Muon", 
      "Antimuon", 
      "Electron", 
      "Positron"
    ], 
    "targetFormula": "(!fb:physics.particle_family.particles fb:en.lepton)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.0gj2r fb:physics.particle_family.particles ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what particles are in the lepton family", 
    "id": 290
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.cape_may_lighthouse fb:architecture.lighthouse.construction ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Brick"
    ], 
    "targetFormula": "(!fb:architecture.lighthouse.construction fb:en.cape_may_lighthouse)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.032w60 fb:architecture.lighthouse.construction ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what is the cape may lighthouse made of", 
    "id": 291
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 ?x2name WHERE { ?x1 fb:boxing.match_boxer_relationship.winner_won true . FILTER (?x1 != true) . ?x1 fb:boxing.match_boxer_relationship.match fb:en.ali-frazier_ii . FILTER (?x1 != fb:en.ali-frazier_ii) . ?x1 fb:boxing.match_boxer_relationship.boxer ?x2 . OPTIONAL { ?x2 fb:type.object.name ?x2name } } LIMIT 9999", 
    "result": [
      "Muhammad Ali"
    ], 
    "targetFormula": "(!fb:boxing.match_boxer_relationship.boxer (and ((lambda x (fb:boxing.match_boxer_relationship.winner_won (var x))) true) ((lambda x (fb:boxing.match_boxer_relationship.match (var x))) fb:en.ali-frazier_ii)))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 ?x2name WHERE { ?x1 fb:boxing.match_boxer_relationship.winner_won true . FILTER (?x1 != true) . ?x1 fb:boxing.match_boxer_relationship.match fb:m.02_wyl . FILTER (?x1 != fb:m.02_wyl) . ?x1 fb:boxing.match_boxer_relationship.boxer ?x2 . OPTIONAL { ?x2 fb:type.object.name ?x2name } } LIMIT 9999", 
    "utterance": "who won muhammad ali vs. joe frazier ii", 
    "id": 292
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 ?x2name WHERE { fb:en.h_r_block fb:organization.organization.headquarters ?x1 . FILTER (?x1 != fb:en.h_r_block) . ?x1 fb:location.mailing_address.citytown ?x2 . OPTIONAL { ?x2 fb:type.object.name ?x2name } } LIMIT 9999", 
    "result": [
      "Kansas City"
    ], 
    "targetFormula": "(!fb:location.mailing_address.citytown ((lambda x (!fb:organization.organization.headquarters (var x))) fb:en.h_r_block))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 ?x2name WHERE { fb:m.02rdct fb:organization.organization.headquarters ?x1 . FILTER (?x1 != fb:m.02rdct) . ?x1 fb:location.mailing_address.citytown ?x2 . OPTIONAL { ?x2 fb:type.object.name ?x2name } } LIMIT 9999", 
    "utterance": "in what city is h&r block headquartered", 
    "id": 293
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.the_nutty_professor_1996 fb:film.film.produced_by ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Brian Grazer", 
      "Russell Simmons", 
      "Mark Lipsky"
    ], 
    "targetFormula": "(!fb:film.film.produced_by fb:en.the_nutty_professor_1996)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.0d87hc fb:film.film.produced_by ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "who was the nutty professor produced by", 
    "id": 294
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x3 WHERE { { SELECT DISTINCT count(?x1) AS ?x3 WHERE { fb:en.mclean_hospital fb:medicine.hospital.beds ?x2 . ?x2 fb:measurement_unit.dated_integer.number ?x1 } } } LIMIT 9999", 
    "result": [
      "1"
    ], 
    "targetFormula": "(count (!fb:measurement_unit.dated_integer.number (!fb:medicine.hospital.beds fb:en.mclean_hospital)))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x3 WHERE { { SELECT DISTINCT count(?x1) AS ?x3 WHERE { fb:m.09rfy fb:medicine.hospital.beds ?x2 . ?x2 fb:measurement_unit.dated_integer.number ?x1 } } } LIMIT 9999", 
    "utterance": "how many beds does mclean hospital have", 
    "id": 295
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:en.porgy_and_bess fb:opera.opera.date_of_first_performance ?x1 } LIMIT 9999", 
    "result": [
      "1935-09-30"
    ], 
    "targetFormula": "(!fb:opera.opera.date_of_first_performance fb:en.porgy_and_bess)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.01g380 fb:opera.opera.date_of_first_performance ?x1 } LIMIT 9999", 
    "utterance": "when was porgy and bess first performed", 
    "id": 296
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.bianchi_pista fb:bicycles.bicycle_model.bicycle_type ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Fixed-gear bicycle"
    ], 
    "targetFormula": "(!fb:bicycles.bicycle_model.bicycle_type fb:en.bianchi_pista)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.05nm029 fb:bicycles.bicycle_model.bicycle_type ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what type of bicycle is a bianchi pista", 
    "id": 297
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.state_v_kelly fb:law.legal_case.judges ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Daniel Joseph O'Hern"
    ], 
    "targetFormula": "(!fb:law.legal_case.judges fb:en.state_v_kelly)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.02qd60n fb:law.legal_case.judges ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what judge presided over state v. kelly", 
    "id": 298
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.six_flags_america fb:amusement_parks.park.rides ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Batwing", 
      "The Joker's Jinx", 
      "The Wild One", 
      "Mind Eraser", 
      "Two Face: The Flip Side", 
      "Ultra Twister", 
      "Great Chase", 
      "Roar", 
      "Superman \u2013 Ride of Steel"
    ], 
    "targetFormula": "(!fb:amusement_parks.park.rides fb:en.six_flags_america)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.01ymk2 fb:amusement_parks.park.rides ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what are the rides at six flags america", 
    "id": 299
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:en.girl_scouts_of_the_usa fb:organization.organization.date_founded ?x1 } LIMIT 9999", 
    "result": [
      "1912"
    ], 
    "targetFormula": "(!fb:organization.organization.date_founded fb:en.girl_scouts_of_the_usa)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.01r3kd fb:organization.organization.date_founded ?x1 } LIMIT 9999", 
    "utterance": "when was girl scouts of the usa founded", 
    "id": 300
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 ?x2name WHERE { ?x1 fb:soccer.football_roster_position.player fb:en.dennis_bergkamp . FILTER (?x1 != fb:en.dennis_bergkamp) . ?x1 fb:soccer.football_roster_position.team ?x2 . OPTIONAL { ?x2 fb:type.object.name ?x2name } } LIMIT 9999", 
    "result": [
      "Netherlands national football team", 
      "Arsenal F.C.", 
      "AFC Ajax", 
      "Inter Milan"
    ], 
    "targetFormula": "(!fb:soccer.football_roster_position.team ((lambda x (fb:soccer.football_roster_position.player (var x))) fb:en.dennis_bergkamp))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 ?x2name WHERE { ?x1 fb:soccer.football_roster_position.player fb:m.0ccbf . FILTER (?x1 != fb:m.0ccbf) . ?x1 fb:soccer.football_roster_position.team ?x2 . OPTIONAL { ?x2 fb:type.object.name ?x2name } } LIMIT 9999", 
    "utterance": "what team does dennis bergkamp play for", 
    "id": 301
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { fb:en.goalkeeper_football fb:soccer.football_position.players ?x1 } } } LIMIT 9999", 
    "result": [
      "7028"
    ], 
    "targetFormula": "(count (!fb:soccer.football_position.players fb:en.goalkeeper_football))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { fb:m.0dgrmp fb:soccer.football_position.players ?x1 } } } LIMIT 9999", 
    "utterance": "how many soccer players are goalkeepers", 
    "id": 302
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.cardiology fb:medicine.medical_specialty.hospitals_with_this_specialty ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "UAB Hospital", 
      "Bakersfield Heart Hospital", 
      "St. Francis Hospital", 
      "Banner Baywood Heart Hospital", 
      "Veterans Affairs Medical Center", 
      "Arizona Heart Hospital", 
      "Lubbock Heart Hospital", 
      "Baylor Jack and Jane Hamilton Heart and Vascular Hospital", 
      "Glasgow Royal Infirmary", 
      "Montreal Heart Institute", 
      "Requena", 
      "Toronto General Hospital", 
      "Montreal Chest Institute", 
      "University of Ottawa Heart Institute"
    ], 
    "targetFormula": "(!fb:medicine.medical_specialty.hospitals_with_this_specialty fb:en.cardiology)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.01nd8 fb:medicine.medical_specialty.hospitals_with_this_specialty ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what hospitals specialize in cardiology", 
    "id": 303
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:en.proton fb:physics.particle.electric_charge ?x1 } LIMIT 9999", 
    "result": [
      "1"
    ], 
    "targetFormula": "(!fb:physics.particle.electric_charge fb:en.proton)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.05t5p fb:physics.particle.electric_charge ?x1 } LIMIT 9999", 
    "utterance": "what is the electric charge of a proton", 
    "id": 304
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { fb:en.indian_rupee fb:finance.currency.countries_used ?x1 } } } LIMIT 9999", 
    "result": [
      "2"
    ], 
    "targetFormula": "(count (!fb:finance.currency.countries_used fb:en.indian_rupee))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { fb:m.02gsvk fb:finance.currency.countries_used ?x1 } } } LIMIT 9999", 
    "utterance": "how many countries use the indian rupee", 
    "id": 305
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x3 WHERE { { SELECT DISTINCT count(?x1) AS ?x3 WHERE { ?x2 fb:tv.regular_tv_appearance.actor fb:en.hayden_panettiere . FILTER (?x2 != fb:en.hayden_panettiere) . ?x2 fb:tv.regular_tv_appearance.character ?x1 } } } LIMIT 9999", 
    "result": [
      "20"
    ], 
    "targetFormula": "(count (!fb:tv.regular_tv_appearance.character ((lambda x (fb:tv.regular_tv_appearance.actor (var x))) fb:en.hayden_panettiere)))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x3 WHERE { { SELECT DISTINCT count(?x1) AS ?x3 WHERE { ?x2 fb:tv.regular_tv_appearance.actor fb:m.02jyhv . FILTER (?x2 != fb:m.02jyhv) . ?x2 fb:tv.regular_tv_appearance.character ?x1 } } } LIMIT 9999", 
    "utterance": "how many shows was hayden panettiere on", 
    "id": 306
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 ?x2name WHERE { ?x1 fb:award.award_honor.honored_for fb:en.the_english_patient . FILTER (?x1 != fb:en.the_english_patient) . ?x1 fb:award.award_honor.award ?x2 . OPTIONAL { ?x2 fb:type.object.name ?x2name } } LIMIT 9999", 
    "result": [
      "Man Booker Prize", 
      "Governor General's Award for English-language fiction"
    ], 
    "targetFormula": "(!fb:award.award_honor.award ((lambda x (fb:award.award_honor.honored_for (var x))) fb:en.the_english_patient))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 ?x2name WHERE { ?x1 fb:award.award_honor.honored_for fb:m.0c047 . FILTER (?x1 != fb:m.0c047) . ?x1 fb:award.award_honor.award ?x2 . OPTIONAL { ?x2 fb:type.object.name ?x2name } } LIMIT 9999", 
    "utterance": "what awards has the english patient won", 
    "id": 307
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:en.domesticated_horse fb:biology.organism_classification.scientific_name ?x1 } LIMIT 9999", 
    "result": [
      "Equus ferus caballus"
    ], 
    "targetFormula": "(!fb:biology.organism_classification.scientific_name fb:en.domesticated_horse)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.03k3r fb:biology.organism_classification.scientific_name ?x1 } LIMIT 9999", 
    "utterance": "what is the scientific name for a horse", 
    "id": 308
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:en.universal_studios_japan fb:amusement_parks.park.opened ?x1 } LIMIT 9999", 
    "result": [
      "2001-03-31"
    ], 
    "targetFormula": "(!fb:amusement_parks.park.opened fb:en.universal_studios_japan)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.0737x5 fb:amusement_parks.park.opened ?x1 } LIMIT 9999", 
    "utterance": "when was universal studios japan opened", 
    "id": 309
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:en.butane fb:chemistry.chemical_compound.formula ?x1 } LIMIT 9999", 
    "result": [
      "C4H10"
    ], 
    "targetFormula": "(!fb:chemistry.chemical_compound.formula fb:en.butane)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.0dx4k fb:chemistry.chemical_compound.formula ?x1 } LIMIT 9999", 
    "utterance": "what is the chemical formula for butane", 
    "id": 310
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.sesame_street fb:tv.tv_program.theme_song ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Can You Tell Me How to Get to Sesame Street?"
    ], 
    "targetFormula": "(!fb:tv.tv_program.theme_song fb:en.sesame_street)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.0cwrr fb:tv.tv_program.theme_song ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what is the theme song of sesame street", 
    "id": 311
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:location.us_county fb:freebase.type_profile.equivalent_topic ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [], 
    "targetFormula": "(!fb:freebase.type_profile.equivalent_topic fb:location.us_county)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:location.us_county fb:freebase.type_profile.equivalent_topic ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what topics are equivalent to us county", 
    "id": 312
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.woodrow_wilson fb:government.us_president.vice_president ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Thomas R. Marshall"
    ], 
    "targetFormula": "(!fb:government.us_president.vice_president fb:en.woodrow_wilson)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.083q7 fb:government.us_president.vice_president ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "who was vice president to woodrow wilson", 
    "id": 313
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:en.galileo_spacecraft fb:spaceflight.satellite.launch_date ?x1 } LIMIT 9999", 
    "result": [
      "1989-10-18"
    ], 
    "targetFormula": "(!fb:spaceflight.satellite.launch_date fb:en.galileo_spacecraft)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.03f7r fb:spaceflight.satellite.launch_date ?x1 } LIMIT 9999", 
    "utterance": "when was the galileo spacecraft launched", 
    "id": 314
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 ?x2name WHERE { ?x1 fb:government.government_position_held.office_position_or_title fb:en.united_states_senator . FILTER (?x1 != fb:en.united_states_senator) . ?x1 fb:government.government_position_held.district_represented fb:en.colorado . FILTER (?x1 != fb:en.colorado) . ?x1 fb:government.government_position_held.office_holder ?x2 . OPTIONAL { ?x2 fb:type.object.name ?x2name } } LIMIT 9999", 
    "result": [
      "Karl C. Schuyler", 
      "Hank Brown", 
      "Gary Hart", 
      "Thomas M. Patterson", 
      "Charles W. Waterman", 
      "Nathaniel P. Hill", 
      "Gordon L. Allott", 
      "Henry M. Teller", 
      "Charles J. Hughes, Jr.", 
      "Thomas M. Bowen", 
      "Edward O. Wolcott", 
      "Edward P. Costigan", 
      "Floyd K. Haskell", 
      "Tim Wirth", 
      "Peter H. Dominick", 
      "Wayne Allard", 
      "Ken Salazar", 
      "Edwin C. Johnson", 
      "Charles S. Thomas", 
      "John F. Shafroth", 
      "Alva B. Adams", 
      "George M. Chilcott", 
      "Simon Guggenheim", 
      "Ben Nighthorse Campbell", 
      "Mark Udall", 
      "Walter Walker", 
      "Jerome B. Chaffee", 
      "Michael Bennet", 
      "Horace Tabor", 
      "William L. Armstrong", 
      "Eugene Millikin", 
      "Lawrence C. Phipps", 
      "John A. Carroll", 
      "Rice W. Means", 
      "Samuel D. Nicholson"
    ], 
    "targetFormula": "(!fb:government.government_position_held.office_holder (and ( (lambda x (fb:government.government_position_held.office_position_or_title (var x))) fb:en.united_states_senator) ((lambda x (fb:government.government_position_held.district_represented (var x))) fb:en.colorado)))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 ?x2name WHERE { ?x1 fb:government.government_position_held.office_position_or_title fb:m.02_7l8y . FILTER (?x1 != fb:m.02_7l8y) . ?x1 fb:government.government_position_held.district_represented fb:m.01n4w . FILTER (?x1 != fb:m.01n4w) . ?x1 fb:government.government_position_held.office_holder ?x2 . OPTIONAL { ?x2 fb:type.object.name ?x2name } } LIMIT 9999", 
    "utterance": "who are the current senators of colorado", 
    "id": 315
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.boston_red_sox fb:sports.sports_team.team_mascot ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Wally the Green Monster"
    ], 
    "targetFormula": "(!fb:sports.sports_team.team_mascot fb:en.boston_red_sox)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.01d5z fb:sports.sports_team.team_mascot ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what is the mascot of the boston red sox", 
    "id": 316
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.prostate_cancer fb:medicine.disease.symptoms ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Urinary incontinence", 
      "Nocturia", 
      "Bone fracture", 
      "Erectile dysfunction", 
      "Urinary Frequency", 
      "Bone pain", 
      "Dysuria", 
      "Hematuria", 
      "Fecal incontinence", 
      "Urinary retention", 
      "Painful ejaculation", 
      "Difficulty starting and maintaining a steady stream of urine"
    ], 
    "targetFormula": "(!fb:medicine.disease.symptoms fb:en.prostate_cancer)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.0m32h fb:medicine.disease.symptoms ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what are the symptoms of prostate cancer", 
    "id": 317
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.charlies_angels fb:film.film.written_by ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "John August", 
      "Ed Solomon", 
      "Ryan Rowe"
    ], 
    "targetFormula": "(!fb:film.film.written_by fb:en.charlies_angels)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.01y9jr fb:film.film.written_by ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "who was the story of charlie_s angels by", 
    "id": 318
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 ?x2name WHERE { fb:m.02ncllz fb:library.public_library.address ?x1 . FILTER (?x1 != fb:m.02ncllz) . ?x1 fb:location.mailing_address.citytown ?x2 . OPTIONAL { ?x2 fb:type.object.name ?x2name } } LIMIT 9999", 
    "result": [
      "Mobile"
    ], 
    "targetFormula": "(!fb:location.mailing_address.citytown ((lambda x (!fb:library.public_library.address (var x))) fb:m.02ncllz))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 ?x2name WHERE { fb:m.02ncllz fb:library.public_library.address ?x1 . FILTER (?x1 != fb:m.02ncllz) . ?x1 fb:location.mailing_address.citytown ?x2 . OPTIONAL { ?x2 fb:type.object.name ?x2name } } LIMIT 9999", 
    "utterance": "what city is the ben may main library in", 
    "id": 319
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x3 WHERE { { SELECT DISTINCT count(?x1) AS ?x3 WHERE { ?x2 fb:american_football.football_historical_coach_position.coach fb:en.curly_lambeau . FILTER (?x2 != fb:en.curly_lambeau) . ?x2 fb:american_football.football_historical_coach_position.team ?x1 } } } LIMIT 9999", 
    "result": [
      "3"
    ], 
    "targetFormula": "(count (!fb:american_football.football_historical_coach_position.team ( (lambda x (fb:american_football.football_historical_coach_position.coach (var x))) fb:en.curly_lambeau)))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x3 WHERE { { SELECT DISTINCT count(?x1) AS ?x3 WHERE { ?x2 fb:american_football.football_historical_coach_position.coach fb:m.0136tm . FILTER (?x2 != fb:m.0136tm) . ?x2 fb:american_football.football_historical_coach_position.team ?x1 } } } LIMIT 9999", 
    "utterance": "how many teams has curly lambeau coached", 
    "id": 320
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { fb:en.fleet_foxes fb:music.artist.album ?x1 } } } LIMIT 9999", 
    "result": [
      "11"
    ], 
    "targetFormula": "(count (!fb:music.artist.album fb:en.fleet_foxes))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { fb:m.03qmrpl fb:music.artist.album ?x1 } } } LIMIT 9999", 
    "utterance": "how many albums has fleet foxes released", 
    "id": 321
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { ?x1 fb:book.author.series_written_or_contributed_to fb:en.a_series_of_unfortunate_events . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Daniel Handler"
    ], 
    "targetFormula": "(fb:book.author.series_written_or_contributed_to fb:en.a_series_of_unfortunate_events)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { ?x1 fb:book.author.series_written_or_contributed_to fb:m.02qxjy . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "who wrote a series of unfortunate events", 
    "id": 322
  }
]
