[
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x3 WHERE { { SELECT DISTINCT count(?x1) AS ?x3 WHERE { ?x2 fb:award.award_nomination.nominated_for fb:en.the_nutty_professor_1996 . FILTER (?x2 != fb:en.the_nutty_professor_1996) . ?x2 fb:award.award_nomination.award ?x1 } } } LIMIT 9999", 
    "result": [
      "10"
    ], 
    "targetFormula": "(count (!fb:award.award_nomination.award ((lambda x (fb:award.award_nomination.nominated_for (var x))) fb:en.the_nutty_professor_1996)))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x3 WHERE { { SELECT DISTINCT count(?x1) AS ?x3 WHERE { ?x2 fb:award.award_nomination.nominated_for fb:m.0d87hc . FILTER (?x2 != fb:m.0d87hc) . ?x2 fb:award.award_nomination.award ?x1 } } } LIMIT 9999", 
    "utterance": "how many nominations did nutty professor have", 
    "id": 451
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { fb:en.the_x_men_1 fb:comic_books.comic_book_issue.cover_price ?x1 . ?x1 fb:measurement_unit.money_value.amount ?x2 } LIMIT 9999", 
    "result": [
      "0.12"
    ], 
    "targetFormula": "(!fb:measurement_unit.money_value.amount (!fb:comic_books.comic_book_issue.cover_price fb:en.the_x_men_1))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { fb:m.02hqp3h fb:comic_books.comic_book_issue.cover_price ?x1 . ?x1 fb:measurement_unit.money_value.amount ?x2 } LIMIT 9999", 
    "utterance": "what was the cover price of the x-men issue 1", 
    "id": 452
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:en.2_fast_2_furious fb:film.film.initial_release_date ?x1 } LIMIT 9999", 
    "result": [
      "2003-06-03"
    ], 
    "targetFormula": "(!fb:film.film.initial_release_date fb:en.2_fast_2_furious)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.024lff fb:film.film.initial_release_date ?x1 } LIMIT 9999", 
    "utterance": "what is the release date for 2 fast 2 furious", 
    "id": 453
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:en.canadian_dollar fb:finance.currency.currency_code ?x1 } LIMIT 9999", 
    "result": [
      "CAD"
    ], 
    "targetFormula": "(!fb:finance.currency.currency_code fb:en.canadian_dollar)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.0ptk_ fb:finance.currency.currency_code ?x1 } LIMIT 9999", 
    "utterance": "what is currency code for the canadian dollar", 
    "id": 454
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { fb:en.girl_scouts_of_the_usa fb:business.brand.products ?x1 } } } LIMIT 9999", 
    "result": [
      "9"
    ], 
    "targetFormula": "(count (!fb:business.brand.products fb:en.girl_scouts_of_the_usa))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { fb:m.01r3kd fb:business.brand.products ?x1 } } } LIMIT 9999", 
    "utterance": "how many different products does gsusa produce", 
    "id": 455
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { fb:en.delaware fb:military.military_unit_place_of_origin.military_units ?x1 } } } LIMIT 9999", 
    "result": [
      "14"
    ], 
    "targetFormula": "(count (!fb:military.military_unit_place_of_origin.military_units fb:en.delaware))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { fb:m.026mj fb:military.military_unit_place_of_origin.military_units ?x1 } } } LIMIT 9999", 
    "utterance": "how many military units originated in delaware", 
    "id": 456
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:en.stratus fb:meteorology.cloud.maximum_altitude_m ?x1 } LIMIT 9999", 
    "result": [
      "2000"
    ], 
    "targetFormula": "(!fb:meteorology.cloud.maximum_altitude_m fb:en.stratus)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.016873 fb:meteorology.cloud.maximum_altitude_m ?x1 } LIMIT 9999", 
    "utterance": "what is the maximum altitude of stratus clouds", 
    "id": 457
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { fb:en.beaver fb:education.school_mascot.school ?x1 } } } LIMIT 9999", 
    "result": [
      "0"
    ], 
    "targetFormula": "(count (!fb:education.school_mascot.school fb:en.beaver))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { fb:m.01dw9 fb:education.school_mascot.school ?x1 } } } LIMIT 9999", 
    "utterance": "how many schools have a beaver as their mascot", 
    "id": 458
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 ?x2name WHERE { ?x1 fb:tv.regular_tv_appearance.series fb:en.sesame_street . FILTER (?x1 != fb:en.sesame_street) . ?x1 fb:tv.regular_tv_appearance.actor ?x2 . OPTIONAL { ?x2 fb:type.object.name ?x2name } } LIMIT 9999", 
    "result": [
      "Sonia Manzano", 
      "Jim Henson", 
      "Kevin Clash", 
      "Frank Oz", 
      "Leslie Carrara-Rudolph", 
      "Pam Arciero", 
      "Martin P. Robinson", 
      "Richard Hunt", 
      "Caroll Spinney", 
      "David Rudman", 
      "Roscoe Orman", 
      "Fran Brill", 
      "Dave Goelz", 
      "Joey Mazzarino", 
      "Emilio Delgado", 
      "Linda Bove", 
      "Jerry Nelson", 
      "Bob McGrath", 
      "Loretta Long", 
      "Eric Jacobson"
    ], 
    "targetFormula": "(!fb:tv.regular_tv_appearance.actor ((lambda x (fb:tv.regular_tv_appearance.series (var x))) fb:en.sesame_street))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 ?x2name WHERE { ?x1 fb:tv.regular_tv_appearance.series fb:m.0cwrr . FILTER (?x1 != fb:m.0cwrr) . ?x1 fb:tv.regular_tv_appearance.actor ?x2 . OPTIONAL { ?x2 fb:type.object.name ?x2name } } LIMIT 9999", 
    "utterance": "who are the main cast members of sesame street", 
    "id": 459
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:en.singapore_dollar fb:finance.currency.currency_code ?x1 } LIMIT 9999", 
    "result": [
      "SGD"
    ], 
    "targetFormula": "(!fb:finance.currency.currency_code fb:en.singapore_dollar)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.02f32g fb:finance.currency.currency_code ?x1 } LIMIT 9999", 
    "utterance": "what is currency code for the singapore dollar", 
    "id": 460
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 ?x2name WHERE { ?x1 fb:base.politicalconventions.convention_speech.speaker fb:en.hillary_rodham_clinton . FILTER (?x1 != fb:en.hillary_rodham_clinton) . ?x1 fb:base.politicalconventions.convention_speech.venue ?x2 . OPTIONAL { ?x2 fb:type.object.name ?x2name } } LIMIT 9999", 
    "result": [], 
    "targetFormula": "(!fb:base.politicalconventions.convention_speech.venue ( (lambda x (fb:base.politicalconventions.convention_speech.speaker (var x))) fb:en.hillary_rodham_clinton))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 ?x2name WHERE { ?x1 fb:base.politicalconventions.convention_speech.speaker fb:m.0d06m5 . FILTER (?x1 != fb:m.0d06m5) . ?x1 fb:base.politicalconventions.convention_speech.venue ?x2 . OPTIONAL { ?x2 fb:type.object.name ?x2name } } LIMIT 9999", 
    "utterance": "what conventions has hillary clinton spoken at", 
    "id": 461
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x3 ?x3name WHERE { ?x1 fb:tv.tv_regular_personal_appearance.program fb:en.cbs_evening_news . FILTER (?x1 != fb:en.cbs_evening_news) . ?x1 fb:tv.tv_regular_personal_appearance.appearance_type fb:en.co_host . FILTER (?x1 != fb:en.co_host) . FILTER (xsd:dateTime(?x2) >= xsd:dateTime(\"1993\"^^xsd:datetime)) . FILTER (xsd:dateTime(?x2) < xsd:dateTime(\"1994\"^^xsd:datetime)) . ?x1 fb:tv.tv_regular_personal_appearance.from ?x2 . FILTER (?x1 != \"1993\"^^xsd:datetime) . ?x1 fb:tv.tv_regular_personal_appearance.person ?x3 . OPTIONAL { ?x3 fb:type.object.name ?x3name } } LIMIT 9999", 
    "result": [
      "Connie Chung"
    ], 
    "targetFormula": "(!fb:tv.tv_regular_personal_appearance.person (and (and ((lambda x (fb:tv.tv_regular_personal_appearance.program (var x))) fb:en.cbs_evening_news) ((lambda x (fb:tv.tv_regular_personal_appearance.appearance_type (var x))) fb:en.co_host)) ((lambda x (fb:tv.tv_regular_personal_appearance.from (var x))) (date 1993 -1 -1))))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x3 ?x3name WHERE { ?x1 fb:tv.tv_regular_personal_appearance.program fb:m.01bndp . FILTER (?x1 != fb:m.01bndp) . ?x1 fb:tv.tv_regular_personal_appearance.appearance_type fb:m.02kdrs1 . FILTER (?x1 != fb:m.02kdrs1) . FILTER (xsd:dateTime(?x2) >= xsd:dateTime(\"1993\"^^xsd:datetime)) . FILTER (xsd:dateTime(?x2) < xsd:dateTime(\"1994\"^^xsd:datetime)) . ?x1 fb:tv.tv_regular_personal_appearance.from ?x2 . FILTER (?x1 != \"1993\"^^xsd:datetime) . ?x1 fb:tv.tv_regular_personal_appearance.person ?x3 . OPTIONAL { ?x3 fb:type.object.name ?x3name } } LIMIT 9999", 
    "utterance": "who was the cohost in 1993 on cbs evening news", 
    "id": 462
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { fb:en.hurricane_ivan fb:meteorology.tropical_cyclone.affected_areas ?x1 } } } LIMIT 9999", 
    "result": [
      "11"
    ], 
    "targetFormula": "(count (!fb:meteorology.tropical_cyclone.affected_areas fb:en.hurricane_ivan))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { fb:m.03tn0n fb:meteorology.tropical_cyclone.affected_areas ?x1 } } } LIMIT 9999", 
    "utterance": "how many areas were affected by hurricane ivan", 
    "id": 463
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 ?x2name WHERE { ?x1 fb:celebrities.rehab.celebrity fb:en.jerry_garcia . FILTER (?x1 != fb:en.jerry_garcia) . ?x1 fb:celebrities.rehab.rehab_facility ?x2 . OPTIONAL { ?x2 fb:type.object.name ?x2name } } LIMIT 9999", 
    "result": [
      "Serenity Knolls", 
      "Betty Ford Center"
    ], 
    "targetFormula": "(!fb:celebrities.rehab.rehab_facility ((lambda x (fb:celebrities.rehab.celebrity (var x))) fb:en.jerry_garcia))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 ?x2name WHERE { ?x1 fb:celebrities.rehab.celebrity fb:m.0k1bs . FILTER (?x1 != fb:m.0k1bs) . ?x1 fb:celebrities.rehab.rehab_facility ?x2 . OPTIONAL { ?x2 fb:type.object.name ?x2name } } LIMIT 9999", 
    "utterance": "what rehab facilities has jerry garcia gone to", 
    "id": 464
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:en.second_grade fb:education.grade_level.typical_age_minimum ?x1 } LIMIT 9999", 
    "result": [
      "7"
    ], 
    "targetFormula": "(!fb:education.grade_level.typical_age_minimum fb:en.second_grade)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.042_bx fb:education.grade_level.typical_age_minimum ?x1 } LIMIT 9999", 
    "utterance": "at what age to kids usually start second grade", 
    "id": 465
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x3 WHERE { { SELECT DISTINCT count(?x1) AS ?x3 WHERE { ?x2 fb:interests.collection.collector fb:en.jay_leno . FILTER (?x2 != fb:en.jay_leno) . ?x2 fb:interests.collection.category fb:en.automobile . FILTER (?x2 != fb:en.automobile) . ?x2 fb:interests.collection.items ?x1 } } } LIMIT 9999", 
    "result": [
      "10"
    ], 
    "targetFormula": "(count (!fb:interests.collection.items (and ((lambda x (fb:interests.collection.collector (var x))) fb:en.jay_leno) ((lambda x (fb:interests.collection.category (var x))) fb:en.automobile))))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x3 WHERE { { SELECT DISTINCT count(?x1) AS ?x3 WHERE { ?x2 fb:interests.collection.collector fb:m.046lt . FILTER (?x2 != fb:m.046lt) . ?x2 fb:interests.collection.category fb:m.0k4j . FILTER (?x2 != fb:m.0k4j) . ?x2 fb:interests.collection.items ?x1 } } } LIMIT 9999", 
    "utterance": "how many cars are in jay leno's car collection", 
    "id": 466
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.roman_catholicism fb:religion.religion.branched_into ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Anglicanism", 
      "Lutheranism", 
      "Protestantism"
    ], 
    "targetFormula": "(!fb:religion.religion.branched_into fb:en.roman_catholicism)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.0c8wxp fb:religion.religion.branched_into ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what religions branched from roman catholicism", 
    "id": 467
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.tai_chi_chuan fb:martial_arts.martial_art.category ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Strike", 
      "Grappling", 
      "Internal"
    ], 
    "targetFormula": "(!fb:martial_arts.martial_art.category fb:en.tai_chi_chuan)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.07k4r fb:martial_arts.martial_art.category ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what category of martial arts is tai chi chuan", 
    "id": 468
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { fb:en.final_fantasy fb:cvg.game_series.games_in_series ?x1 } } } LIMIT 9999", 
    "result": [
      "56"
    ], 
    "targetFormula": "(count (!fb:cvg.game_series.games_in_series fb:en.final_fantasy))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { fb:m.02ywx fb:cvg.game_series.games_in_series ?x1 } } } LIMIT 9999", 
    "utterance": "how many games are in the final fantasy series", 
    "id": 469
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:en.larry_bird fb:basketball.basketball_coach.season_wins ?x1 } LIMIT 9999", 
    "result": [
      "147"
    ], 
    "targetFormula": "(!fb:basketball.basketball_coach.season_wins fb:en.larry_bird)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.0fbbl fb:basketball.basketball_coach.season_wins ?x1 } LIMIT 9999", 
    "utterance": "how many wins has larry bird had in his career", 
    "id": 470
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.bruce_almighty fb:film.film.costume_design_by ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Judy L. Ruskin"
    ], 
    "targetFormula": "(!fb:film.film.costume_design_by fb:en.bruce_almighty)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.01jft4 fb:film.film.costume_design_by ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "who is the costume designer for bruce almighty", 
    "id": 471
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.matthew_hayden fb:cricket.cricket_bowler.technique ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Seam bowling"
    ], 
    "targetFormula": "(!fb:cricket.cricket_bowler.technique fb:en.matthew_hayden)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.0291sp fb:cricket.cricket_bowler.technique ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what bowling technique does matthew hayden use", 
    "id": 472
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.university_of_oxford fb:fictional_universe.school_in_fiction.students_graduates ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Catsmeat Potter-Pirbright", 
      "Tom Brown", 
      "Professor X", 
      "Inspector Morse"
    ], 
    "targetFormula": "(!fb:fictional_universe.school_in_fiction.students_graduates fb:en.university_of_oxford)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.07tgn fb:fictional_universe.school_in_fiction.students_graduates ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what fictional characters have attended oxford", 
    "id": 473
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.first_generation_ford_mustang fb:automotive.generation.designer ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Lee Iacocca", 
      "Larry Shinoda"
    ], 
    "targetFormula": "(!fb:automotive.generation.designer fb:en.first_generation_ford_mustang)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.02k_k6k fb:automotive.generation.designer ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "who designed the first generation ford mustang", 
    "id": 474
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.046chvq fb:exhibitions.exhibition.subjects ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Climate change"
    ], 
    "targetFormula": "(!fb:exhibitions.exhibition.subjects fb:m.046chvq)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.046chvq fb:exhibitions.exhibition.subjects ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what was the science of survival exhibit about", 
    "id": 475
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.iceman fb:comic_books.comic_book_character.cover_appearances ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "The X-Men #1", 
      "The X-Men #2", 
      "X-Men #4"
    ], 
    "targetFormula": "(!fb:comic_books.comic_book_character.cover_appearances fb:en.iceman)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.03zw5 fb:comic_books.comic_book_character.cover_appearances ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "which issues of x-men have iceman on the cover", 
    "id": 476
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.to_kill_a_mockingbird fb:book.book.characters ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Atticus Finch", 
      "Jem Finch", 
      "Scout Finch", 
      "Dill Harris", 
      "Boo Radley", 
      "Mayella Violet Ewell", 
      "Tom Robinson", 
      "Maudie Atkinson", 
      "Calpurnia", 
      "Robert Ewell", 
      "Alexandra Hancock"
    ], 
    "targetFormula": "(!fb:book.book.characters fb:en.to_kill_a_mockingbird)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.0jqbz fb:book.book.characters ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "who are the characters in to kill a mockingbird", 
    "id": 477
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { fb:m.0hgwnr4 fb:automotive.trim_level.msrp ?x1 . ?x1 fb:measurement_unit.money_value.amount ?x2 } LIMIT 9999", 
    "result": [
      "22045"
    ], 
    "targetFormula": "(!fb:measurement_unit.money_value.amount (!fb:automotive.trim_level.msrp fb:m.0hgwnr4))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { fb:m.0hgwnr4 fb:automotive.trim_level.msrp ?x1 . ?x1 fb:measurement_unit.money_value.amount ?x2 } LIMIT 9999", 
    "utterance": "what is the price of a 2012 jeep wrangler sport", 
    "id": 478
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.africa fb:location.location.events ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "World War II", 
      "World War I", 
      "Seven Years' War", 
      "United States Exploring Expedition", 
      "Sulla's second civil war", 
      "Caesar's Civil War", 
      "Blockade of Africa", 
      "Taking Back the Cities Tour", 
      "KylieX2009", 
      "African Slave Trade Patrol", 
      "Battle of Guinea", 
      "British Expedition to Abyssinia"
    ], 
    "targetFormula": "(!fb:location.location.events fb:en.africa)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.0dg3n1 fb:location.location.events ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what major events in history happened in africa", 
    "id": 479
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { fb:en.adrienne_roy fb:comic_books.comic_book_colorist.comic_stories_colored ?x1 } } } LIMIT 9999", 
    "result": [
      "6"
    ], 
    "targetFormula": "(count (!fb:comic_books.comic_book_colorist.comic_stories_colored fb:en.adrienne_roy))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { fb:m.09fw6v fb:comic_books.comic_book_colorist.comic_stories_colored ?x1 } } } LIMIT 9999", 
    "utterance": "how many comic stories has adrienne roy colored", 
    "id": 480
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.us_route_101 fb:transportation.road.highway_system ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "US Numbered Highways"
    ], 
    "targetFormula": "(!fb:transportation.road.highway_system fb:en.us_route_101)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.0j9xz fb:transportation.road.highway_system ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what highway system does us route 101 belong to", 
    "id": 481
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:en.united_nations fb:common.topic.alias ?x1 } LIMIT 9999", 
    "result": [
      "UN", 
      "Nations-Unies", 
      "U.N.", 
      "United Nations Staff"
    ], 
    "targetFormula": "(!fb:common.topic.alias fb:en.united_nations)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.07t65 fb:common.topic.alias ?x1 } LIMIT 9999", 
    "utterance": "what other names is the united nations known by", 
    "id": 483
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { fb:en.supreme_court_of_the_united_states fb:law.court.legal_cases ?x1 } } } LIMIT 9999", 
    "result": [
      "942"
    ], 
    "targetFormula": "(count (!fb:law.court.legal_cases fb:en.supreme_court_of_the_united_states))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { fb:m.07sz1 fb:law.court.legal_cases ?x1 } } } LIMIT 9999", 
    "utterance": "how many us supreme court cases have there been", 
    "id": 484
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { fb:en.prostate_cancer fb:medicine.disease.survival_rates ?x1 . FILTER (?x1 != fb:en.prostate_cancer) . ?x1 fb:medicine.survival_rate.rate ?x2 } LIMIT 9999", 
    "result": [
      "100", 
      "89", 
      "37"
    ], 
    "targetFormula": "(!fb:medicine.survival_rate.rate ((lambda x (!fb:medicine.disease.survival_rates (var x))) fb:en.prostate_cancer))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { fb:m.0m32h fb:medicine.disease.survival_rates ?x1 . FILTER (?x1 != fb:m.0m32h) . ?x1 fb:medicine.survival_rate.rate ?x2 } LIMIT 9999", 
    "utterance": "what are the survival rates for prostate cancer", 
    "id": 485
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:en.the_catcher_in_the_rye fb:book.written_work.date_of_first_publication ?x1 } LIMIT 9999", 
    "result": [
      "1951-07-16"
    ], 
    "targetFormula": "(!fb:book.written_work.date_of_first_publication fb:en.the_catcher_in_the_rye)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.019g32 fb:book.written_work.date_of_first_publication ?x1 } LIMIT 9999", 
    "utterance": "when was the catcher in the rye first published", 
    "id": 486
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { fb:en.jerry_seinfeld fb:common.topic.alias ?x1 } } } LIMIT 9999", 
    "result": [
      "6"
    ], 
    "targetFormula": "(count (!fb:common.topic.alias fb:en.jerry_seinfeld))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { fb:m.0q5hw fb:common.topic.alias ?x1 } } } LIMIT 9999", 
    "utterance": "how many other names is jerry seinfeld known by", 
    "id": 487
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.0h33xbs fb:automotive.trim_level.engine ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Ferrari 4.3L 8 Cylinder 460 hp 357 ft-lbs"
    ], 
    "targetFormula": "(!fb:automotive.trim_level.engine fb:m.0h33xbs)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.0h33xbs fb:automotive.trim_level.engine ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what is the engine in a 2010 ferrari california", 
    "id": 488
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.kirkstall_abbey fb:religion.monastery.religious_order ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Cistercians"
    ], 
    "targetFormula": "(!fb:religion.monastery.religious_order fb:en.kirkstall_abbey)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.0d00l fb:religion.monastery.religious_order ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what religious order belongs to kirkstall abbey", 
    "id": 489
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.september_11_2001_attacks fb:event.disaster.structures_destroyed ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [], 
    "targetFormula": "(!fb:event.disaster.structures_destroyed fb:en.september_11_2001_attacks)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.0d0vp3 fb:event.disaster.structures_destroyed ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what buildings were destroyed in september 11th", 
    "id": 490
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x3 WHERE { { SELECT DISTINCT count(?x1) AS ?x3 WHERE { ?x2 fb:military.military_command.military_conflict fb:en.american_civil_war . FILTER (?x2 != fb:en.american_civil_war) . ?x2 fb:military.military_command.military_commander ?x1 } } } LIMIT 9999", 
    "result": [
      "10"
    ], 
    "targetFormula": "(count (!fb:military.military_command.military_commander ((lambda x (fb:military.military_command.military_conflict (var x))) fb:en.american_civil_war)))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x3 WHERE { { SELECT DISTINCT count(?x1) AS ?x3 WHERE { ?x2 fb:military.military_command.military_conflict fb:m.0kbq . FILTER (?x2 != fb:m.0kbq) . ?x2 fb:military.military_command.military_commander ?x1 } } } LIMIT 9999", 
    "utterance": "how many commanders were there in the civil war", 
    "id": 491
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { fb:en.mathematics fb:conferences.conference_subject.series_of_conferences_about_this ?x1 } } } LIMIT 9999", 
    "result": [
      "7"
    ], 
    "targetFormula": "(count (!fb:conferences.conference_subject.series_of_conferences_about_this fb:en.mathematics))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { fb:m.04rjg fb:conferences.conference_subject.series_of_conferences_about_this ?x1 } } } LIMIT 9999", 
    "utterance": "how many conferences about mathematics are there", 
    "id": 492
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.apollo_12 fb:spaceflight.space_mission.astronauts ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Pete Conrad", 
      "Alan Bean", 
      "Richard F. Gordon, Jr."
    ], 
    "targetFormula": "(!fb:spaceflight.space_mission.astronauts fb:en.apollo_12)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.0vq4 fb:spaceflight.space_mission.astronauts ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "who were the astronauts in the apollo 12 mission", 
    "id": 493
  }
]
