[
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.uss_cobia fb:boats.ship.ship_class ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Gato-class submarine"
    ], 
    "targetFormula": "(!fb:boats.ship.ship_class fb:en.uss_cobia)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.05wfjz fb:boats.ship.ship_class ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what ship class is the uss cobia", 
    "id": 146
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:en.uss_croaker fb:boats.ship.launched ?x1 } LIMIT 9999", 
    "result": [
      "1943-12-19"
    ], 
    "targetFormula": "(!fb:boats.ship.launched fb:en.uss_croaker)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.0444f9 fb:boats.ship.launched ?x1 } LIMIT 9999", 
    "utterance": "when was the uss croaker launched", 
    "id": 149
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.bengali_script fb:language.language_writing_system.languages ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Arabic Language", 
      "Sanskrit Language", 
      "Sylheti Language", 
      "Bengali Language", 
      "Meitei Language", 
      "Assamese Language"
    ], 
    "targetFormula": "(!fb:language.language_writing_system.languages fb:en.bengali_script)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.01xrpc fb:language.language_writing_system.languages ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what languages use bengali script", 
    "id": 150
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.oracle_corporation fb:computer.software_developer.software ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Java", 
      "NetBeans", 
      "OpenGrok", 
      "Solaris Operating System", 
      "Oracle Media Objects", 
      "MySQL", 
      "Berkeley DB", 
      "OpenOffice.org", 
      "Network Security Services", 
      "OpenOffice Draw", 
      "Oracle iPlanet Web Server", 
      "BEA WebLogic", 
      "Oracle Application Server", 
      "GlassFish", 
      "JavaFX", 
      "Oracle Application Express", 
      "TopLink", 
      "dbx", 
      "Sun Java System Web Proxy Server", 
      "OpenOffice Impress", 
      "VirtualBox", 
      "Apache OpenOffice Writer", 
      "OpenOffice Calc", 
      "InnoDB", 
      "Oracle Database", 
      "OC4J", 
      "Hyperion Planning", 
      "OpenOffice Base", 
      "StarOffice", 
      "OpenSolaris", 
      "MySQL Cluster", 
      "MyISAM", 
      "MySQL Enterprise", 
      "Oracle Data Mining", 
      "Oracle Spatial and Graph", 
      "Oracle Database", 
      "MySQL Workbench", 
      "JBuilder", 
      "Apache OpenOffice Math"
    ], 
    "targetFormula": "(!fb:computer.software_developer.software fb:en.oracle_corporation)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.05njw fb:computer.software_developer.software ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what software has oracle designed", 
    "id": 151
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.8_mile fb:film.film.genre ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Drama", 
      "Coming of age", 
      "Musical Drama", 
      "Musical", 
      "Hip hop film"
    ], 
    "targetFormula": "(!fb:film.film.genre fb:en.8_mile)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.017d93 fb:film.film.genre ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what genres did 8 mile consist of", 
    "id": 152
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:en.north_america fb:location.location.area ?x1 } LIMIT 9999", 
    "result": [
      "24709000"
    ], 
    "targetFormula": "(!fb:location.location.area fb:en.north_america)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.059g4 fb:location.location.area ?x1 } LIMIT 9999", 
    "utterance": "what is the area of north america", 
    "id": 153
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.psychology fb:education.field_of_study.journals_in_this_discipline ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Journal of Abnormal Child Psychology", 
      "The Journal of Psychology", 
      "American Imago", 
      "Cultic Studies Review", 
      "Children, Youth and Environments", 
      "Journal of Neuroscience, Psychology, and Economics", 
      "Professional Psychology: Research and Practice", 
      "American Psychologist", 
      "Philosophy, Psychiatry, & Psychology", 
      "American Journal of Psychology", 
      "Journal of Vision", 
      "Work & Stress", 
      "Radical Psychology", 
      "Multivariate Behavioral Research", 
      "Journal of Autism and Developmental Disorders", 
      "Review of Philosophy and Psychology", 
      "Psychoanalytic Psychology", 
      "Psychological Medicine", 
      "Psychological Bulletin", 
      "Journal of Abnormal Psychology", 
      "Psychological Review", 
      "Journal of Occupational Health Psychology", 
      "Psychology of Addictive Behaviors", 
      "Developmental Psychobiology", 
      "Journal of Occupational and Organizational Psychology", 
      "African Journal for the Psychological Study of Social Issues", 
      "Journal of Personnel Psychology", 
      "Psychophysiology"
    ], 
    "targetFormula": "(!fb:education.field_of_study.journals_in_this_discipline fb:en.psychology)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.05qfh fb:education.field_of_study.journals_in_this_discipline ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what are some psychology journals", 
    "id": 154
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.peanuts fb:comic_strips.comic_strip.characters ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Little Red-Haired Girl", 
      "Linus van Pelt", 
      "Rerun van Pelt", 
      "Olaf", 
      "Lucy van Pelt", 
      "Sally Brown", 
      "Charlie Brown", 
      "Woodstock", 
      "Snoopy", 
      "Schroeder", 
      "Shermy", 
      "Violet Gray", 
      "Frieda", 
      "Pig-Pen", 
      "Patty", 
      "Peppermint Patty", 
      "The Great Pumpkin", 
      "Franklin", 
      "Peggy Jean", 
      "Charlotte Braun", 
      "Kite-Eating Tree", 
      "Marcie"
    ], 
    "targetFormula": "(!fb:comic_strips.comic_strip.characters fb:en.peanuts)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.0blh2 fb:comic_strips.comic_strip.characters ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "who are the characters in peanuts", 
    "id": 155
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.025rs2z fb:chemistry.chemical_element.melting_point ?x1 } LIMIT 9999", 
    "result": [
      "1064.18"
    ], 
    "targetFormula": "(!fb:chemistry.chemical_element.melting_point fb:m.025rs2z)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.025rs2z fb:chemistry.chemical_element.melting_point ?x1 } LIMIT 9999", 
    "utterance": "what is the melting point of gold", 
    "id": 156
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 ?x2name WHERE { ?x1 fb:chess.chess_game_participation.outcome fb:m.0454vkd . FILTER (?x1 != fb:m.0454vkd) . ?x1 fb:chess.chess_game_participation.game ?x2 . OPTIONAL { ?x2 fb:type.object.name ?x2name } } LIMIT 9999", 
    "result": [
      "Immortal Zugzwang Game", 
      "Immortal Losing Game", 
      "Deep Blue versus Kasparov, 1997, Game 6", 
      "Poole versus HAL 9000", 
      "Kasparov versus the World", 
      "Lasker versus Bauer, Amsterdam, 1889", 
      "Evergreen Game", 
      "Immortal Game", 
      "Morphy versus the Duke of Brunswick and Count Isouard", 
      "The Game of the Century", 
      "Deep Blue versus Kasparov, 1996, Game 1", 
      "Polish Immortal", 
      "Peruvian Immortal"
    ], 
    "targetFormula": "(!fb:chess.chess_game_participation.game ((lambda x (fb:chess.chess_game_participation.outcome (var x))) fb:m.0454vkd))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 ?x2name WHERE { ?x1 fb:chess.chess_game_participation.outcome fb:m.0454vkd . FILTER (?x1 != fb:m.0454vkd) . ?x1 fb:chess.chess_game_participation.game ?x2 . OPTIONAL { ?x2 fb:type.object.name ?x2name } } LIMIT 9999", 
    "utterance": "what games has garry kasparov won", 
    "id": 157
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:en.hey_arnold fb:tv.tv_program.air_date_of_final_episode ?x1 } LIMIT 9999", 
    "result": [
      "2004-06-08"
    ], 
    "targetFormula": "(!fb:tv.tv_program.air_date_of_final_episode fb:en.hey_arnold)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.01d98n fb:tv.tv_program.air_date_of_final_episode ?x1 } LIMIT 9999", 
    "utterance": "when did hey arnold! stop running", 
    "id": 158
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.gunpowder_tea fb:food.tea.tea_type ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Green tea"
    ], 
    "targetFormula": "(!fb:food.tea.tea_type fb:en.gunpowder_tea)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.05q6nq fb:food.tea.tea_type ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what type of tea is gunpowder tea", 
    "id": 159
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.bruce_lee fb:martial_arts.martial_artist.martial_arts_students ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Jesse Glover", 
      "Lee Marvin", 
      "Larry Hartsell"
    ], 
    "targetFormula": "(!fb:martial_arts.martial_artist.martial_arts_students fb:en.bruce_lee)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.099d4 fb:martial_arts.martial_artist.martial_arts_students ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "who are the students of bruce lee", 
    "id": 160
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.doom fb:cvg.computer_videogame.gameplay_modes fb:en.multiplayer_game . FILTER (?x1 = fb:en.doom) . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Doom"
    ], 
    "targetFormula": "(and fb:en.doom (fb:cvg.computer_videogame.gameplay_modes fb:en.multiplayer_game))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.02ckk fb:cvg.computer_videogame.gameplay_modes fb:m.01z747 . FILTER (?x1 = fb:m.02ckk) . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "does doom have a multiplayer mode", 
    "id": 161
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.sikhism fb:religion.religion.practices ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Vegetarianism", 
      "The Five Ks", 
      "Kirat Karo", 
      "Naam Japo", 
      "Vand Chhako", 
      "Lacto vegetarianism", 
      "Langar", 
      "Kirtan", 
      "Charhdi Kala", 
      "Simran", 
      "Dasvand", 
      "Amrit Sanskar", 
      "Ard\u0101s", 
      "Three pillars of Sikhism"
    ], 
    "targetFormula": "(!fb:religion.religion.practices fb:en.sikhism)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.06yyp fb:religion.religion.practices ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what are the practices of sikhism", 
    "id": 162
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.claris fb:computer.software_developer.software ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "FileMaker", 
      "MacPaint", 
      "MacDraw", 
      "MacProject"
    ], 
    "targetFormula": "(!fb:computer.software_developer.software fb:en.claris)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.01st38 fb:computer.software_developer.software ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what software has claris developed", 
    "id": 163
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.william_shakespeare fb:people.person.place_of_birth ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Stratford-upon-Avon"
    ], 
    "targetFormula": "(!fb:people.person.place_of_birth fb:en.william_shakespeare)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.081k8 fb:people.person.place_of_birth ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "where was william shakespeare born", 
    "id": 164
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.0kjyrc7 fb:astronomy.star.temperature_k ?x1 } LIMIT 9999", 
    "result": [
      "7200"
    ], 
    "targetFormula": "(!fb:astronomy.star.temperature_k fb:m.0kjyrc7)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.0kjyrc7 fb:astronomy.star.temperature_k ?x1 } LIMIT 9999", 
    "utterance": "what is the temperature of polaris", 
    "id": 165
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { fb:en.angelina_jolie fb:celebrities.celebrity.net_worth ?x1 . ?x1 fb:measurement_unit.dated_money_value.amount ?x2 } LIMIT 9999", 
    "result": [
      "120000000"
    ], 
    "targetFormula": "(!fb:measurement_unit.dated_money_value.amount (!fb:celebrities.celebrity.net_worth fb:en.angelina_jolie))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { fb:m.0f4vbz fb:celebrities.celebrity.net_worth ?x1 . ?x1 fb:measurement_unit.dated_money_value.amount ?x2 } LIMIT 9999", 
    "utterance": "what is angelina jolie's net worth", 
    "id": 166
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { ?x1 fb:basketball.basketball_roster_position.player fb:en.lamarcus_aldridge . FILTER (?x1 != fb:en.lamarcus_aldridge) . ?x1 fb:basketball.basketball_roster_position.number ?x2 } LIMIT 9999", 
    "result": [
      "12"
    ], 
    "targetFormula": "(!fb:basketball.basketball_roster_position.number ((lambda x (fb:basketball.basketball_roster_position.player (var x))) fb:en.lamarcus_aldridge))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { ?x1 fb:basketball.basketball_roster_position.player fb:m.094hjr . FILTER (?x1 != fb:m.094hjr) . ?x1 fb:basketball.basketball_roster_position.number ?x2 } LIMIT 9999", 
    "utterance": "what is lamarcus aldridge's number", 
    "id": 168
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:en.australian_dollar fb:finance.currency.currency_code ?x1 } LIMIT 9999", 
    "result": [
      "AUD"
    ], 
    "targetFormula": "(!fb:finance.currency.currency_code fb:en.australian_dollar)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.0kz1h fb:finance.currency.currency_code ?x1 } LIMIT 9999", 
    "utterance": "what is the australian dollar code", 
    "id": 169
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.syphillis fb:medicine.infectious_disease.infectious_agent_type ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Pathogenic bacteria"
    ], 
    "targetFormula": "(!fb:medicine.infectious_disease.infectious_agent_type fb:en.syphillis)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.074m2 fb:medicine.infectious_disease.infectious_agent_type ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what type of infection is syphilis", 
    "id": 170
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.06zh9s fb:media_common.quotation.spoken_by_character ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "The Terminator"
    ], 
    "targetFormula": "(!fb:media_common.quotation.spoken_by_character fb:m.06zh9s)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.06zh9s fb:media_common.quotation.spoken_by_character ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what character says \"i'll be back\"", 
    "id": 171
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:en.jerry_seinfeld fb:people.person.date_of_birth ?x1 } LIMIT 9999", 
    "result": [
      "1954-04-29"
    ], 
    "targetFormula": "(!fb:people.person.date_of_birth fb:en.jerry_seinfeld)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.0q5hw fb:people.person.date_of_birth ?x1 } LIMIT 9999", 
    "utterance": "when is jerry seinfeld 's birthday", 
    "id": 172
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.robert_scoble fb:internet.blogger.blog ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Scobleizer", 
      "Scobleizer", 
      "scobleizer"
    ], 
    "targetFormula": "(!fb:internet.blogger.blog fb:en.robert_scoble)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.04xmcj fb:internet.blogger.blog ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what blog does robert scoble write", 
    "id": 173
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 ?x2name WHERE { ?x1 fb:media_common.dedication.work_dedicated fb:en.invisible_man . FILTER (?x1 != fb:en.invisible_man) . ?x1 fb:media_common.dedication.dedicated_to ?x2 . OPTIONAL { ?x2 fb:type.object.name ?x2name } } LIMIT 9999", 
    "result": [
      "Ida Millsap"
    ], 
    "targetFormula": "(!fb:media_common.dedication.dedicated_to ((lambda x (fb:media_common.dedication.work_dedicated (var x))) fb:en.invisible_man))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 ?x2name WHERE { ?x1 fb:media_common.dedication.work_dedicated fb:m.023cpd . FILTER (?x1 != fb:m.023cpd) . ?x1 fb:media_common.dedication.dedicated_to ?x2 . OPTIONAL { ?x2 fb:type.object.name ?x2name } } LIMIT 9999", 
    "utterance": "to whom is invisible man dedicated", 
    "id": 174
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x3 WHERE { { SELECT DISTINCT count(?x1) AS ?x3 WHERE { ?x2 fb:tv.regular_tv_appearance.actor fb:en.ron_glass . FILTER (?x2 != fb:en.ron_glass) . ?x2 fb:tv.regular_tv_appearance.series ?x1 } } } LIMIT 9999", 
    "result": [
      "7"
    ], 
    "targetFormula": "(count (!fb:tv.regular_tv_appearance.series ((lambda x (fb:tv.regular_tv_appearance.actor (var x))) fb:en.ron_glass)))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x3 WHERE { { SELECT DISTINCT count(?x1) AS ?x3 WHERE { ?x2 fb:tv.regular_tv_appearance.actor fb:m.03h82p . FILTER (?x2 != fb:m.03h82p) . ?x2 fb:tv.regular_tv_appearance.series ?x1 } } } LIMIT 9999", 
    "utterance": "how many tv shows was ron glass in", 
    "id": 175
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.cotton fb:fashion.fiber.textiles_made_from_this_fiber ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Voile", 
      "Crinoline", 
      "Denim", 
      "Moleskin"
    ], 
    "targetFormula": "(!fb:fashion.fiber.textiles_made_from_this_fiber fb:en.cotton)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.095zt fb:fashion.fiber.textiles_made_from_this_fiber ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what textiles are made from cotton", 
    "id": 176
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 ?x2name WHERE { ?x1 fb:fashion.designer_label_association.label fb:en.bill_blass_limited . FILTER (?x1 != fb:en.bill_blass_limited) . ?x1 fb:fashion.designer_label_association.designer ?x2 . OPTIONAL { ?x2 fb:type.object.name ?x2name } } LIMIT 9999", 
    "result": [
      "Michael Bastian", 
      "Bill Blass", 
      "Peter Som", 
      "Jose Solis"
    ], 
    "targetFormula": "(!fb:fashion.designer_label_association.designer ((lambda x (fb:fashion.designer_label_association.label (var x))) fb:en.bill_blass_limited))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 ?x2name WHERE { ?x1 fb:fashion.designer_label_association.label fb:m.02qkgwj . FILTER (?x1 != fb:m.02qkgwj) . ?x1 fb:fashion.designer_label_association.designer ?x2 . OPTIONAL { ?x2 fb:type.object.name ?x2name } } LIMIT 9999", 
    "utterance": "who designs for bill blass limited", 
    "id": 177
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:en.charlies_angels fb:film.film.initial_release_date ?x1 } LIMIT 9999", 
    "result": [
      "2000-10-22"
    ], 
    "targetFormula": "(!fb:film.film.initial_release_date fb:en.charlies_angels)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.01y9jr fb:film.film.initial_release_date ?x1 } LIMIT 9999", 
    "utterance": "when did charlie_s angels come out", 
    "id": 178
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.judo fb:martial_arts.martial_art.well_known_practitioner ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Jason DeLucia", 
      "Yushin Okami", 
      "Danielli Yuri", 
      "G\u014dz\u014d Shioda", 
      "Morihei Ueshiba", 
      "Vladimir Putin", 
      "Steven Seagal", 
      "Koichi Tohei", 
      "Doug Williams", 
      "Fedor Emelianenko", 
      "Jigoro Kano", 
      "Demian Maia", 
      "Erik Paulson", 
      "Keiko Fukuda", 
      "Tsuyoshi Kohsaka", 
      "Oleg Taktarov", 
      "Kyung Sun Shin", 
      "Sokoudjou", 
      "H\u00e9lio Gracie", 
      "Chris Adams", 
      "Nam Phan", 
      "Ronda Rousey", 
      "Chang Kyun Yu", 
      "Paulo Thiago", 
      "Lee So-yeon", 
      "Carlos Gracie", 
      "Kristof Midoux", 
      "Yun Dukan", 
      "Roxanne Modafferi", 
      "Matthew Jago", 
      "William Durbin", 
      "Megumi Fujii", 
      "Hector Lombard"
    ], 
    "targetFormula": "(!fb:martial_arts.martial_art.well_known_practitioner fb:en.judo)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.03_8r fb:martial_arts.martial_art.well_known_practitioner ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "who are some practitioners of judo", 
    "id": 179
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.independence_hall fb:location.location.containedby ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Philadelphia"
    ], 
    "targetFormula": "(!fb:location.location.containedby fb:en.independence_hall)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.01_yh5 fb:location.location.containedby ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "where is independence hall located", 
    "id": 180
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:en.golden_gate_bridge fb:transportation.bridge.total_length ?x1 } LIMIT 9999", 
    "result": [
      "2737"
    ], 
    "targetFormula": "(!fb:transportation.bridge.total_length fb:en.golden_gate_bridge)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.035p3 fb:transportation.bridge.total_length ?x1 } LIMIT 9999", 
    "utterance": "how long is the golden gate bridge", 
    "id": 181
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:en.kingda_ka fb:amusement_parks.ride.max_speed ?x1 } LIMIT 9999", 
    "result": [
      "206"
    ], 
    "targetFormula": "(!fb:amusement_parks.ride.max_speed fb:en.kingda_ka)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.040f6g fb:amusement_parks.ride.max_speed ?x1 } LIMIT 9999", 
    "utterance": "what is the max speed of kingda ka", 
    "id": 182
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.01482f fb:food.cheese.texture ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Soft-ripened"
    ], 
    "targetFormula": "(!fb:food.cheese.texture fb:m.01482f)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.01482f fb:food.cheese.texture ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what is the texture of brie cheese", 
    "id": 183
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.aspirin fb:medicine.medical_treatment.used_to_treat ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Fever", 
      "Gout", 
      "Stroke", 
      "Inflammation", 
      "Pain", 
      "Rheumatoid arthritis", 
      "Osteoarthritis", 
      "Rheumatic fever"
    ], 
    "targetFormula": "(!fb:medicine.medical_treatment.used_to_treat fb:en.aspirin)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.0qkc fb:medicine.medical_treatment.used_to_treat ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what conditions does aspirin treat", 
    "id": 184
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.art_deco fb:book.book_subject.works ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Art Deco New York", 
      "Streamline", 
      "The Art of Rockefeller Center", 
      "Art deco style", 
      "Art Deco, 1910-1939", 
      "French modern", 
      "Italian art deco", 
      "Deco type", 
      "Euro deco", 
      "Art deco furniture: the French designers"
    ], 
    "targetFormula": "(!fb:book.book_subject.works fb:en.art_deco)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.0tyq fb:book.book_subject.works ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what are some books about art deco", 
    "id": 187
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:en.cpd_c00001_h2o fb:chemistry.chemical_compound.boiling_point ?x1 } LIMIT 9999", 
    "result": [
      "99.98"
    ], 
    "targetFormula": "(!fb:chemistry.chemical_compound.boiling_point fb:en.cpd_c00001_h2o)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.0838f fb:chemistry.chemical_compound.boiling_point ?x1 } LIMIT 9999", 
    "utterance": "what is the boiling point of water", 
    "id": 188
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x3 WHERE { { SELECT DISTINCT count(?x1) AS ?x3 WHERE { ?x2 fb:interests.collection.category fb:en.automobile . FILTER (?x2 != fb:en.automobile) . ?x2 fb:interests.collection.collector ?x1 } } } LIMIT 9999", 
    "result": [
      "20"
    ], 
    "targetFormula": "(count (!fb:interests.collection.collector ((lambda x (fb:interests.collection.category (var x))) fb:en.automobile)))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x3 WHERE { { SELECT DISTINCT count(?x1) AS ?x3 WHERE { ?x2 fb:interests.collection.category fb:m.0k4j . FILTER (?x2 != fb:m.0k4j) . ?x2 fb:interests.collection.collector ?x1 } } } LIMIT 9999", 
    "utterance": "how many people collect automobiles", 
    "id": 189
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.03d5yt5 fb:broadcast.content.location ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Atlanta metropolitan area"
    ], 
    "targetFormula": "(!fb:broadcast.content.location fb:m.03d5yt5)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.03d5yt5 fb:broadcast.content.location ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "where is between the lines produced", 
    "id": 190
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.craig_adams_1977 fb:ice_hockey.hockey_player.hockey_position ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Right wing"
    ], 
    "targetFormula": "(!fb:ice_hockey.hockey_player.hockey_position fb:en.craig_adams_1977)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.01z39d fb:ice_hockey.hockey_player.hockey_position ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what position does craig adams play", 
    "id": 191
  }
]
