[
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.microsoft_corporation fb:computer.programming_language_designer.languages_designed ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "C#", 
      "QuickBASIC", 
      "QBasic", 
      "Visual Basic .NET", 
      "J#", 
      "Visual Basic", 
      "Microsoft BASIC", 
      "Abstract State Machine Language", 
      "Applesoft BASIC"
    ], 
    "targetFormula": "(!fb:computer.programming_language_designer.languages_designed fb:en.microsoft_corporation)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.04sv4 fb:computer.programming_language_designer.languages_designed ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what languages has microsoft designed", 
    "id": 239
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.2003_cricket_world_cup fb:cricket.cricket_tournament_event.host ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "South Africa", 
      "Zimbabwe", 
      "Kenya"
    ], 
    "targetFormula": "(!fb:cricket.cricket_tournament_event.host fb:en.2003_cricket_world_cup)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.015blr fb:cricket.cricket_tournament_event.host ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "who hosted the 2003 cricket world cup", 
    "id": 240
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.gruta_das_torres fb:geology.geological_formation.type_of_rock ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Basalt"
    ], 
    "targetFormula": "(!fb:geology.geological_formation.type_of_rock fb:en.gruta_das_torres)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.04112qf fb:geology.geological_formation.type_of_rock ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what rock is gruta das torres made of", 
    "id": 241
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { fb:en.the_band fb:music.artist.track ?x1 } } } LIMIT 9999", 
    "result": [
      "741"
    ], 
    "targetFormula": "(count (!fb:music.artist.track fb:en.the_band))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { fb:m.07m4c fb:music.artist.track ?x1 } } } LIMIT 9999", 
    "utterance": "how many tracks has the band recorded", 
    "id": 242
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.morphine fb:medicine.medical_treatment.side_effects ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Dizziness", 
      "Headache", 
      "Pruritus", 
      "Constipation"
    ], 
    "targetFormula": "(!fb:medicine.medical_treatment.side_effects fb:en.morphine)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.055pr fb:medicine.medical_treatment.side_effects ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what are the side effects of morphine", 
    "id": 243
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.bruce_almighty fb:film.film.music ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "John Debney"
    ], 
    "targetFormula": "(!fb:film.film.music fb:en.bruce_almighty)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.01jft4 fb:film.film.music ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "who is the music by in bruce almighty", 
    "id": 244
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.martin_luther fb:religion.founding_figure.religion_founded ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Lutheranism", 
      "Protestantism"
    ], 
    "targetFormula": "(!fb:religion.founding_figure.religion_founded fb:en.martin_luther)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.04yd_ fb:religion.founding_figure.religion_founded ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what religion did martin luther found", 
    "id": 245
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:en.princetown_railway fb:rail.railway.closed ?x1 } LIMIT 9999", 
    "result": [
      "1956-03-03"
    ], 
    "targetFormula": "(!fb:rail.railway.closed fb:en.princetown_railway)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.09v5s9x fb:rail.railway.closed ?x1 } LIMIT 9999", 
    "utterance": "when did the princetown railway close", 
    "id": 246
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.07sbkfb fb:computer.programming_language.developers ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Martin Odersky"
    ], 
    "targetFormula": "(!fb:computer.programming_language.developers fb:m.07sbkfb)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.07sbkfb fb:computer.programming_language.developers ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "who is the developer of java language", 
    "id": 247
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.road_bicycle fb:bicycles.bicycle_type.bicycle_models_of_this_type ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Avanti Cadent 3.0 2009", 
      "Avanti Giro 2009", 
      "Panasonic DX3000", 
      "Avanti Cadent 1.0 2009", 
      "Avanti Cadent 2.0 2009", 
      "Avanti Cadent Team 2009", 
      "Avanti Corsa 2009", 
      "Avanti Monza", 
      "Avanti Prima", 
      "Avanti Quantum 1.0", 
      "Avanti Quantum 2.0 2009", 
      "Avanti Quantum 3.0", 
      "Avanti Quantum Team 2009", 
      "Avanti Sprint 2009", 
      "Giant CRX Four 2008", 
      "Giant CRX Four 2007", 
      "Giant CRX Four 2009"
    ], 
    "targetFormula": "(!fb:bicycles.bicycle_type.bicycle_models_of_this_type fb:en.road_bicycle)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.09rgp fb:bicycles.bicycle_type.bicycle_models_of_this_type ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what are some examples of a road bike", 
    "id": 248
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x3 WHERE { { SELECT DISTINCT count(?x1) AS ?x3 WHERE { ?x2 fb:award.award_honor.honored_for fb:en.sesame_street . FILTER (?x2 != fb:en.sesame_street) . ?x2 fb:award.award_honor.award ?x1 } } } LIMIT 9999", 
    "result": [
      "149"
    ], 
    "targetFormula": "(count (!fb:award.award_honor.award ((lambda x (fb:award.award_honor.honored_for (var x))) fb:en.sesame_street)))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x3 WHERE { { SELECT DISTINCT count(?x1) AS ?x3 WHERE { ?x2 fb:award.award_honor.honored_for fb:m.0cwrr . FILTER (?x2 != fb:m.0cwrr) . ?x2 fb:award.award_honor.award ?x1 } } } LIMIT 9999", 
    "utterance": "how many awards did sesame street win", 
    "id": 249
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:en.first_amendment_to_the_united_states_constitution fb:law.constitutional_amendment.ratification_completed_on ?x1 } LIMIT 9999", 
    "result": [
      "1791-12-15"
    ], 
    "targetFormula": "(!fb:law.constitutional_amendment.ratification_completed_on fb:en.first_amendment_to_the_united_states_constitution)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.07sgz fb:law.constitutional_amendment.ratification_completed_on ?x1 } LIMIT 9999", 
    "utterance": "when was the first amendment ratified", 
    "id": 250
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.agnosticism fb:religion.religion.notable_figures ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Bertrand Russell", 
      "Robert G. Ingersoll"
    ], 
    "targetFormula": "(!fb:religion.religion.notable_figures fb:en.agnosticism)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.0kq2 fb:religion.religion.notable_figures ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "who are some notable agnostic figures", 
    "id": 251
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { ?x1 fb:medicine.disease.symptoms fb:en.fatigue . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Stomach cancer", 
      "Diabetes mellitus", 
      "Multiple sclerosis", 
      "Pneumonia", 
      "Parkinson's disease", 
      "Myocardial infarction", 
      "Primary aldosteronism", 
      "Leukemia", 
      "AIDS", 
      "Anxiety disorder", 
      "Hypoparathyroidism", 
      "Prediabetes", 
      "Thyroiditis", 
      "Tertiary hyperparathyroidism", 
      "Diabetes insipidus", 
      "Polymyalgia rheumatica", 
      "Hodgkin's lymphoma", 
      "Alcoholic hepatitis", 
      "Vitamin B12 deficiency anemia", 
      "Syphilis", 
      "Hepatitis E", 
      "Food poisoning", 
      "Salmonellosis", 
      "Heart valve disease", 
      "Carbuncle", 
      "Myocarditis", 
      "Endocarditis", 
      "Pericarditis", 
      "Hyperparathyroidism", 
      "Systemic lupus erythematosus", 
      "Inflammatory heart disease", 
      "Primary hyperparathyroidism", 
      "Meningitis", 
      "Hypothyroidism", 
      "Colorectal cancer", 
      "Cardiovascular disease", 
      "Lung cancer", 
      "Rhinitis", 
      "Liver failure", 
      "Hyperthyroidism", 
      "Dermatomyositis", 
      "Renal failure", 
      "Chronic myelogenous leukemia", 
      "HIV", 
      "Tuberculosis", 
      "Dehydration", 
      "Hepatitis A", 
      "Pre-eclampsia", 
      "Kidney cancer", 
      "Gestational diabetes", 
      "Hepatitis", 
      "Jaundice", 
      "Type 1 diabetes", 
      "Cardiomyopathy", 
      "Chronic fatigue syndrome", 
      "Hepatitis C", 
      "West Nile fever", 
      "Duchenne muscular dystrophy", 
      "Pityriasis rosea", 
      "Morgellons", 
      "Obesity", 
      "Seasonal affective disorder", 
      "Typhoid fever", 
      "Atrial septal defect", 
      "Chronic renal failure", 
      "Bipolar disorder", 
      "Acute myeloid leukemia", 
      "Cirrhosis", 
      "Obstructive sleep apnea", 
      "Acromegaly", 
      "Jet lag", 
      "Pulmonary valve stenosis", 
      "Abdominal aortic aneurysm", 
      "Pelvic inflammatory disease", 
      "Sickle cell disease", 
      "Iron deficiency anemia", 
      "Folic Acid Deficiency Anemia", 
      "Anemia", 
      "Sinusitis", 
      "Astigmatism", 
      "Anorexia nervosa", 
      "Pectus excavatum", 
      "Glomerulonephritis", 
      "Ovarian cancer", 
      "Liver tumour", 
      "B-cell chronic lymphocytic leukemia", 
      "Non-Hodgkin lymphoma", 
      "Peptic ulcer", 
      "Type 2 diabetes", 
      "Ankylosing spondylitis", 
      "Kyphosis", 
      "Cushing's syndrome", 
      "Crohn's disease", 
      "Celiac disease", 
      "Scleroderma", 
      "Lupus erythematosus", 
      "Cyclosporiasis", 
      "Graves' disease", 
      "Hepatitis B", 
      "Aplastic anemia", 
      "Amoebiasis", 
      "Hepatitis D", 
      "Gastric dumping syndrome", 
      "Pyoderma gangrenosum", 
      "Arthritis", 
      "Pyelonephritis", 
      "Pharyngitis", 
      "Viral meningitis", 
      "Premenstrual syndrome", 
      "Multiple myeloma", 
      "Generalized anxiety disorder", 
      "Rheumatic Heart Disease", 
      "Meningeal Tuberculosis", 
      "Hashimoto's thyroiditis", 
      "Ebstein's anomaly", 
      "Sunburn", 
      "Chronic bronchitis", 
      "Colorectal polyp", 
      "Angina Pectoris", 
      "Common cold", 
      "Scoliosis", 
      "Major depression", 
      "Atrial fibrillation", 
      "Bulimia nervosa", 
      "Acute lymphoblastic leukemia", 
      "Iron overload", 
      "Sarcoma", 
      "Dilated cardiomyopathy"
    ], 
    "targetFormula": "(fb:medicine.disease.symptoms fb:en.fatigue)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { ?x1 fb:medicine.disease.symptoms fb:m.01j6t0 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what diseases is fatigue a symptom of", 
    "id": 252
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.us_interstate_5 fb:transportation.road.major_cities ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Portland", 
      "Los Angeles", 
      "Sacramento", 
      "Redding", 
      "San Diego", 
      "Seattle"
    ], 
    "targetFormula": "(!fb:transportation.road.major_cities fb:en.us_interstate_5)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.0kd_x fb:transportation.road.major_cities ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what cities does us interstate 5 pass", 
    "id": 253
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.columbia_university fb:education.educational_institution.colors ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "White", 
      "Columbia blue"
    ], 
    "targetFormula": "(!fb:education.educational_institution.colors fb:en.columbia_university)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.01w5m fb:education.educational_institution.colors ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what are columbia university's colors", 
    "id": 254
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.keyon_dooling fb:basketball.basketball_player.position_s ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Shooting guard", 
      "Point guard"
    ], 
    "targetFormula": "(!fb:basketball.basketball_player.position_s fb:en.keyon_dooling)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.07f3by fb:basketball.basketball_player.position_s ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what position does keyon dooling play", 
    "id": 255
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { fb:en.beyond_robson fb:internet.blog.blogger ?x1 } } } LIMIT 9999", 
    "result": [
      "10"
    ], 
    "targetFormula": "(count (!fb:internet.blog.blogger fb:en.beyond_robson))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { fb:m.04_65ty fb:internet.blog.blogger ?x1 } } } LIMIT 9999", 
    "utterance": "how many people blog on beyond robson", 
    "id": 256
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:en.big_daddy fb:film.film.initial_release_date ?x1 } LIMIT 9999", 
    "result": [
      "1999-06-25"
    ], 
    "targetFormula": "(!fb:film.film.initial_release_date fb:en.big_daddy)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.02hxhz fb:film.film.initial_release_date ?x1 } LIMIT 9999", 
    "utterance": "when was the movie big daddy released", 
    "id": 257
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.batman_477 fb:book.magazine_issue.cover_artist ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Tom Taggart"
    ], 
    "targetFormula": "(!fb:book.magazine_issue.cover_artist fb:en.batman_477)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.03dfh34 fb:book.magazine_issue.cover_artist ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "who did the cover art for batman #477", 
    "id": 258
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 ?x2name WHERE { ?x1 fb:chess.chess_game_participation.game fb:en.the_game_of_the_century . FILTER (?x1 != fb:en.the_game_of_the_century) . ?x1 fb:chess.chess_game_participation.player ?x2 . OPTIONAL { ?x2 fb:type.object.name ?x2name } } LIMIT 9999", 
    "result": [
      "Bobby Fischer", 
      "Donald Byrne"
    ], 
    "targetFormula": "(!fb:chess.chess_game_participation.player ((lambda x (fb:chess.chess_game_participation.game (var x))) fb:en.the_game_of_the_century))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 ?x2name WHERE { ?x1 fb:chess.chess_game_participation.game fb:m.01j1v2 . FILTER (?x1 != fb:m.01j1v2) . ?x1 fb:chess.chess_game_participation.player ?x2 . OPTIONAL { ?x2 fb:type.object.name ?x2name } } LIMIT 9999", 
    "utterance": "who played in the game of the century", 
    "id": 259
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.jonathan_miller fb:opera.opera_director.operas_directed ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "La boh\u00e8me"
    ], 
    "targetFormula": "(!fb:opera.opera_director.operas_directed fb:en.jonathan_miller)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.01m_c6 fb:opera.opera_director.operas_directed ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what opera did jonathan miller direct", 
    "id": 260
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.heart_failure fb:medicine.disease.causes ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Atherosclerosis", 
      "Embolism", 
      "Cocaine", 
      "Aneurysm", 
      "Amphetamine", 
      "Aortic dissection", 
      "Ventricular hypertrophy"
    ], 
    "targetFormula": "(!fb:medicine.disease.causes fb:en.heart_failure)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.0gk4g fb:medicine.disease.causes ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what are the causes of a heart attack", 
    "id": 262
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.13_going_on_30 fb:film.film.subjects ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Time travel", 
      "Body swap"
    ], 
    "targetFormula": "(!fb:film.film.subjects fb:en.13_going_on_30)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.02vzpb fb:film.film.subjects ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what is the subject of 13 going on 30", 
    "id": 263
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { fb:en.arabic_language fb:language.human_language.dialects ?x1 } } } LIMIT 9999", 
    "result": [
      "18"
    ], 
    "targetFormula": "(count (!fb:language.human_language.dialects fb:en.arabic_language))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { fb:m.0jzc fb:language.human_language.dialects ?x1 } } } LIMIT 9999", 
    "utterance": "how many dialects of arabic are there", 
    "id": 264
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.dave_grohl fb:music.artist.genre ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Alternative rock", 
      "Doom metal", 
      "Death metal", 
      "Heavy metal", 
      "Post-hardcore", 
      "Post-grunge", 
      "Punk rock", 
      "Rock music", 
      "Grunge", 
      "Hardcore punk", 
      "Thrash metal", 
      "Hard rock", 
      "Stoner rock"
    ], 
    "targetFormula": "(!fb:music.artist.genre fb:en.dave_grohl)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.0285c fb:music.artist.genre ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what are dave grohl 's musical genres", 
    "id": 265
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:en.massive_attack fb:music.artist.active_start ?x1 } LIMIT 9999", 
    "result": [
      "1987"
    ], 
    "targetFormula": "(!fb:music.artist.active_start fb:en.massive_attack)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.0jvy1 fb:music.artist.active_start ?x1 } LIMIT 9999", 
    "utterance": "when did the band massive attack form", 
    "id": 266
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 ?x2name WHERE { ?x1 fb:travel.transportation.travel_destination fb:en.paris . FILTER (?x1 != fb:en.paris) . ?x1 fb:travel.transportation.transport_operator ?x2 . OPTIONAL { ?x2 fb:type.object.name ?x2name } } LIMIT 9999", 
    "result": [
      "SNCF", 
      "Eurolines"
    ], 
    "targetFormula": "(!fb:travel.transportation.transport_operator ((lambda x (fb:travel.transportation.travel_destination (var x))) fb:en.paris))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 ?x2name WHERE { ?x1 fb:travel.transportation.travel_destination fb:m.05qtj . FILTER (?x1 != fb:m.05qtj) . ?x1 fb:travel.transportation.transport_operator ?x2 . OPTIONAL { ?x2 fb:type.object.name ?x2name } } LIMIT 9999", 
    "utterance": "what bus operators run buses to paris", 
    "id": 267
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { fb:en.euro fb:finance.currency.countries_used ?x1 } } } LIMIT 9999", 
    "result": [
      "33"
    ], 
    "targetFormula": "(count (!fb:finance.currency.countries_used fb:en.euro))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { fb:m.02l6h fb:finance.currency.countries_used ?x1 } } } LIMIT 9999", 
    "utterance": "in how many countries is the euro used", 
    "id": 268
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 ?x2name WHERE { ?x1 fb:soccer.football_league_participation.team fb:en.real_madrid . FILTER (?x1 != fb:en.real_madrid) . ?x1 fb:soccer.football_league_participation.league ?x2 . OPTIONAL { ?x2 fb:type.object.name ?x2name } } LIMIT 9999", 
    "result": [
      "La Liga"
    ], 
    "targetFormula": "(!fb:soccer.football_league_participation.league ((lambda x (fb:soccer.football_league_participation.team (var x))) fb:en.real_madrid))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 ?x2name WHERE { ?x1 fb:soccer.football_league_participation.team fb:m.06l22 . FILTER (?x1 != fb:m.06l22) . ?x1 fb:soccer.football_league_participation.league ?x2 . OPTIONAL { ?x2 fb:type.object.name ?x2name } } LIMIT 9999", 
    "utterance": "what league is real madrid a member of", 
    "id": 269
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x3 WHERE { { SELECT DISTINCT count(?x1) AS ?x3 WHERE { ?x2 fb:sports.sports_league_participation.league fb:en.uefa . FILTER (?x2 != fb:en.uefa) . ?x2 fb:sports.sports_league_participation.team ?x1 } } } LIMIT 9999", 
    "result": [
      "53"
    ], 
    "targetFormula": "(count (!fb:sports.sports_league_participation.team ((lambda x (fb:sports.sports_league_participation.league (var x))) fb:en.uefa)))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x3 WHERE { { SELECT DISTINCT count(?x1) AS ?x3 WHERE { ?x2 fb:sports.sports_league_participation.league fb:m.07y9k . FILTER (?x2 != fb:m.07y9k) . ?x2 fb:sports.sports_league_participation.team ?x1 } } } LIMIT 9999", 
    "utterance": "how many teams participate in the uefa", 
    "id": 270
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.stroke fb:medicine.disease.parent_disease ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Cardiovascular disease", 
      "Nervous system disease", 
      "Central nervous system disease"
    ], 
    "targetFormula": "(!fb:medicine.disease.parent_disease fb:en.stroke)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.02y0js fb:medicine.disease.parent_disease ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what is the parent disease of a stroke", 
    "id": 271
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:en.moon fb:astronomy.orbital_relationship.orbital_period ?x1 } LIMIT 9999", 
    "result": [
      "27.321582"
    ], 
    "targetFormula": "(!fb:astronomy.orbital_relationship.orbital_period fb:en.moon)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.04wv_ fb:astronomy.orbital_relationship.orbital_period ?x1 } LIMIT 9999", 
    "utterance": "what is the orbital period of the moon", 
    "id": 272
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.gotham_city fb:fictional_universe.fictional_setting.fictional_characters_born_here ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Batman"
    ], 
    "targetFormula": "(!fb:fictional_universe.fictional_setting.fictional_characters_born_here fb:en.gotham_city)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.03fdg fb:fictional_universe.fictional_setting.fictional_characters_born_here ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what character was born in gotham city", 
    "id": 273
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:en.matsushita_electric_industrial_co fb:organization.organization.date_founded ?x1 } LIMIT 9999", 
    "result": [
      "1918-03"
    ], 
    "targetFormula": "(!fb:organization.organization.date_founded fb:en.matsushita_electric_industrial_co)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.0nk5b fb:organization.organization.date_founded ?x1 } LIMIT 9999", 
    "utterance": "when was panasonic corporation founded", 
    "id": 275
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.02hqp38 fb:comic_books.comic_book_series.number_of_issues ?x1 } LIMIT 9999", 
    "result": [
      "141"
    ], 
    "targetFormula": "(!fb:comic_books.comic_book_series.number_of_issues fb:m.02hqp38)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.02hqp38 fb:comic_books.comic_book_series.number_of_issues ?x1 } LIMIT 9999", 
    "utterance": "how many issues are there in the x-men", 
    "id": 276
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x3 WHERE { { SELECT DISTINCT count(?x1) AS ?x3 WHERE { ?x2 fb:award.award_honor.award_winner fb:en.jack_albertson . FILTER (?x2 != fb:en.jack_albertson) . ?x2 fb:award.award_honor.award ?x1 } } } LIMIT 9999", 
    "result": [
      "4"
    ], 
    "targetFormula": "(count (!fb:award.award_honor.award ((lambda x (fb:award.award_honor.award_winner (var x))) fb:en.jack_albertson)))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x3 WHERE { { SELECT DISTINCT count(?x1) AS ?x3 WHERE { ?x2 fb:award.award_honor.award_winner fb:m.0hw6_ . FILTER (?x2 != fb:m.0hw6_) . ?x2 fb:award.award_honor.award ?x1 } } } LIMIT 9999", 
    "utterance": "how many awards did jack albertson win", 
    "id": 277
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { ?x1 fb:film.film.subjects fb:en.antarctica } } } LIMIT 9999", 
    "result": [
      "2"
    ], 
    "targetFormula": "(count (fb:film.film.subjects fb:en.antarctica))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { ?x1 fb:film.film.subjects fb:m.0jfx } } } LIMIT 9999", 
    "utterance": "how many films are there on antarctica", 
    "id": 278
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.13_going_on_30 fb:film.film.produced_by ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Donna Roth", 
      "Gina Matthews", 
      "Susan Arnold"
    ], 
    "targetFormula": "(!fb:film.film.produced_by fb:en.13_going_on_30)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.02vzpb fb:film.film.produced_by ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "who is the producer for 13 going on 30", 
    "id": 280
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.yip_man fb:martial_arts.martial_artist.martial_arts_students ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Bruce Lee", 
      "Leung Ting", 
      "Wong Shun Leung"
    ], 
    "targetFormula": "(!fb:martial_arts.martial_artist.martial_arts_students fb:en.yip_man)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.014y87 fb:martial_arts.martial_artist.martial_arts_students ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "who studied martial arts under yip man", 
    "id": 281
  }
]
