[
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { ?x1 fb:celebrities.rehab.rehab_facility fb:m.04fz39z . FILTER (?x1 != fb:m.04fz39z) . ?x1 fb:celebrities.rehab.celebrity fb:en.charlie_sheen . FILTER (?x1 != fb:en.charlie_sheen) . ?x1 fb:celebrities.rehab.entered ?x2 } LIMIT 9999", 
    "result": [
      "1998-05-20"
    ], 
    "targetFormula": "(!fb:celebrities.rehab.entered (and ((lambda x (fb:celebrities.rehab.rehab_facility (var x))) fb:m.04fz39z) ((lambda x (fb:celebrities.rehab.celebrity (var x))) fb:en.charlie_sheen)))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { ?x1 fb:celebrities.rehab.rehab_facility fb:m.04fz39z . FILTER (?x1 != fb:m.04fz39z) . ?x1 fb:celebrities.rehab.celebrity fb:m.01pllx . FILTER (?x1 != fb:m.01pllx) . ?x1 fb:celebrities.rehab.entered ?x2 } LIMIT 9999", 
    "utterance": "when did charlie sheen enter the thousand oaks rehab facility", 
    "id": 609
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.0fq7hj3 fb:projects.project.planned_completion_date ?x1 } LIMIT 9999", 
    "result": [
      "2013"
    ], 
    "targetFormula": "(!fb:projects.project.planned_completion_date fb:m.0fq7hj3)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.0fq7hj3 fb:projects.project.planned_completion_date ?x1 } LIMIT 9999", 
    "utterance": "when is the restoration of the rijksmuseum supposed to finish", 
    "id": 610
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.aol_instant_messenger fb:computer.software.languages_used ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "C++", 
      "Cascading Style Sheets", 
      "XML", 
      "JavaScript", 
      "Adobe Flash"
    ], 
    "targetFormula": "(!fb:computer.software.languages_used fb:en.aol_instant_messenger)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.01258 fb:computer.software.languages_used ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what programming languages were used for aol instant messenger", 
    "id": 611
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 ?x2name WHERE { ?x1 fb:award.ranking.list fb:en.rolling_stones_100_greatest_guitarists_of_all_time . FILTER (?x1 != fb:en.rolling_stones_100_greatest_guitarists_of_all_time) . ?x1 fb:award.ranking.item ?x2 . OPTIONAL { ?x2 fb:type.object.name ?x2name } } LIMIT 9999", 
    "result": [
      "Mick Ronson", 
      "Mark Knopfler", 
      "Tom Verlaine", 
      "Johnny Winter", 
      "Robbie Robertson", 
      "Johnny Ramone", 
      "Joni Mitchell", 
      "John Cipollina", 
      "Robert Fripp", 
      "Brian May", 
      "Jeff Beck", 
      "Link Wray", 
      "John Frusciante", 
      "George Harrison", 
      "Lou Reed", 
      "Kurt Cobain", 
      "D. Boon", 
      "Paul Kossoff", 
      "Eddie Hazel", 
      "Mike Bloomfield", 
      "Adam Jones", 
      "Steve Cropper", 
      "Robby Krieger", 
      "Eric Clapton", 
      "Carlos Santana", 
      "The Edge", 
      "John McLaughlin", 
      "Thurston Moore", 
      "Lee Ranaldo", 
      "James Burton", 
      "Eddie Cochran", 
      "Jimmy Page", 
      "Bo Diddley", 
      "B.B. King", 
      "Buddy Guy", 
      "Frank Zappa", 
      "Bert Jansch", 
      "Mickey Baker", 
      "Kirk Hammett", 
      "Steve Howe", 
      "Zoot Horn Rollo", 
      "David Gilmour", 
      "Chuck Berry", 
      "Stevie Ray Vaughan", 
      "John Fogerty", 
      "Hubert Sumlin", 
      "Pete Townshend", 
      "Eddie Van Halen", 
      "Robert Quine", 
      "Ed O'Brien", 
      "Dave Davies", 
      "Randy Rhoads", 
      "Robert Johnson", 
      "Ali Farka Tour\u00e9", 
      "Richard Betts", 
      "Jerry Miller", 
      "Joan Jett", 
      "Jerry Garcia", 
      "Jonny Greenwood", 
      "Keith Richards", 
      "Jack White", 
      "Jimi Hendrix", 
      "Scotty Moore", 
      "T-Bone Walker", 
      "Ry Cooder", 
      "Vernon Reid", 
      "Peter Green", 
      "Richard Thompson", 
      "Derek Trucks", 
      "Dick Dale", 
      "Tony Iommi", 
      "Trey Anastasio", 
      "Clarence White", 
      "Freddie King", 
      "Greg Ginn", 
      "Joe Perry", 
      "Duane Allman", 
      "Les Paul", 
      "Roy Buchanan", 
      "Tom Morello", 
      "Stephen Stills", 
      "Kim Thayil", 
      "Warren Haynes", 
      "Neil Young: Heart of Gold", 
      "Ritchie Blackmore", 
      "Ike Turner", 
      "Glen Buxton", 
      "Fred Sonic Smith", 
      "Lightnin' Hopkins", 
      "John Fahey", 
      "Danny Gatton", 
      "Leigh Stephens", 
      "Wayne Kramer", 
      "Angus Young", 
      "Cliff Gallup", 
      "Ron Asheton", 
      "Kevin Shields", 
      "Jorma Kaukonen", 
      "Robert Randolph", 
      "Henry Vestine"
    ], 
    "targetFormula": "(!fb:award.ranking.item ( (lambda x (fb:award.ranking.list (var x))) fb:en.rolling_stones_100_greatest_guitarists_of_all_time))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 ?x2name WHERE { ?x1 fb:award.ranking.list fb:m.04ggxn2 . FILTER (?x1 != fb:m.04ggxn2) . ?x1 fb:award.ranking.item ?x2 . OPTIONAL { ?x2 fb:type.object.name ?x2name } } LIMIT 9999", 
    "utterance": "who was rolling stones' greatest guitarist of all time in 2003", 
    "id": 612
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { ?x1 fb:location.location_symbol_relationship.administrative_division fb:en.utah . FILTER (?x1 != fb:en.utah) . ?x1 fb:location.location_symbol_relationship.Kind_of_symbol fb:en.state_bird . FILTER (?x1 != fb:en.state_bird) . ?x1 fb:location.location_symbol_relationship.symbol fb:en.california_gull . FILTER (?x1 != fb:en.california_gull) . ?x1 fb:location.location_symbol_relationship.date_adopted ?x2 } LIMIT 9999", 
    "result": [
      "1955"
    ], 
    "targetFormula": "(!fb:location.location_symbol_relationship.date_adopted (and (and ((lambda x (fb:location.location_symbol_relationship.administrative_division (var x))) fb:en.utah) ((lambda x (fb:location.location_symbol_relationship.Kind_of_symbol (var x))) fb:en.state_bird)) ((lambda x (fb:location.location_symbol_relationship.symbol (var x))) fb:en.california_gull)))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { ?x1 fb:location.location_symbol_relationship.administrative_division fb:m.07srw . FILTER (?x1 != fb:m.07srw) . ?x1 fb:location.location_symbol_relationship.Kind_of_symbol fb:m.04627hw . FILTER (?x1 != fb:m.04627hw) . ?x1 fb:location.location_symbol_relationship.symbol fb:m.037lsy . FILTER (?x1 != fb:m.037lsy) . ?x1 fb:location.location_symbol_relationship.date_adopted ?x2 } LIMIT 9999", 
    "utterance": "since when has the california gull been the state bird of utah", 
    "id": 613
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { fb:en.mammoth_cave_national_park fb:protected_sites.protected_site.annual_visitors ?x1 . ?x1 fb:measurement_unit.dated_integer.number ?x2 } LIMIT 9999", 
    "result": [
      "597934"
    ], 
    "targetFormula": "(!fb:measurement_unit.dated_integer.number (!fb:protected_sites.protected_site.annual_visitors fb:en.mammoth_cave_national_park))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { fb:m.0hr86 fb:protected_sites.protected_site.annual_visitors ?x1 . ?x1 fb:measurement_unit.dated_integer.number ?x2 } LIMIT 9999", 
    "utterance": "how many visitors does mammoth cave national park get in a year", 
    "id": 614
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x3 WHERE { { SELECT DISTINCT count(?x1) AS ?x3 WHERE { ?x2 fb:royalty.chivalric_order_membership.order fb:en.order_of_the_garter . FILTER (?x2 != fb:en.order_of_the_garter) . ?x2 fb:royalty.chivalric_order_membership.title fb:en.knight_of_the_garter . FILTER (?x2 != fb:en.knight_of_the_garter) . ?x2 fb:royalty.chivalric_order_membership.recipient ?x1 } } } LIMIT 9999", 
    "result": [
      "14"
    ], 
    "targetFormula": "(count (!fb:royalty.chivalric_order_membership.recipient (and ((lambda x (fb:royalty.chivalric_order_membership.order (var x))) fb:en.order_of_the_garter) ((lambda x (fb:royalty.chivalric_order_membership.title (var x))) fb:en.knight_of_the_garter))))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x3 WHERE { { SELECT DISTINCT count(?x1) AS ?x3 WHERE { ?x2 fb:royalty.chivalric_order_membership.order fb:m.0jpgc . FILTER (?x2 != fb:m.0jpgc) . ?x2 fb:royalty.chivalric_order_membership.title fb:m.05ywlyg . FILTER (?x2 != fb:m.05ywlyg) . ?x2 fb:royalty.chivalric_order_membership.recipient ?x1 } } } LIMIT 9999", 
    "utterance": "how many knights of the garter did the order of the garter have", 
    "id": 615
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 ?x2name WHERE { ?x1 fb:olympics.olympic_medal_honor.olympics fb:en.2004_summer_olympics . FILTER (?x1 != fb:en.2004_summer_olympics) . ?x1 fb:olympics.olympic_medal_honor.medalist fb:en.graeme_brown . FILTER (?x1 != fb:en.graeme_brown) . ?x1 fb:olympics.olympic_medal_honor.medal ?x2 . OPTIONAL { ?x2 fb:type.object.name ?x2name } } LIMIT 9999", 
    "result": [
      "Gold medal"
    ], 
    "targetFormula": "(!fb:olympics.olympic_medal_honor.medal (and ((lambda x (fb:olympics.olympic_medal_honor.olympics (var x))) fb:en.2004_summer_olympics) ((lambda x (fb:olympics.olympic_medal_honor.medalist (var x))) fb:en.graeme_brown)))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 ?x2name WHERE { ?x1 fb:olympics.olympic_medal_honor.olympics fb:m.0kbvb . FILTER (?x1 != fb:m.0kbvb) . ?x1 fb:olympics.olympic_medal_honor.medalist fb:m.062yf5 . FILTER (?x1 != fb:m.062yf5) . ?x1 fb:olympics.olympic_medal_honor.medal ?x2 . OPTIONAL { ?x2 fb:type.object.name ?x2name } } LIMIT 9999", 
    "utterance": "what medal did graeme brown receive at the 2004 summer olympics", 
    "id": 616
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { ?x1 fb:exhibitions.exhibition_run.exhibition fb:m.04d14h7 . FILTER (?x1 != fb:m.04d14h7) . ?x1 fb:exhibitions.exhibition_run.venue fb:en.philadelphia_museum_of_art . FILTER (?x1 != fb:en.philadelphia_museum_of_art) . ?x1 fb:exhibitions.exhibition_run.opened_on ?x2 } LIMIT 9999", 
    "result": [
      "2008-02-20"
    ], 
    "targetFormula": "(!fb:exhibitions.exhibition_run.opened_on (and ((lambda x (fb:exhibitions.exhibition_run.exhibition (var x))) fb:m.04d14h7) ((lambda x (fb:exhibitions.exhibition_run.venue (var x))) fb:en.philadelphia_museum_of_art)))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { ?x1 fb:exhibitions.exhibition_run.exhibition fb:m.04d14h7 . FILTER (?x1 != fb:m.04d14h7) . ?x1 fb:exhibitions.exhibition_run.venue fb:m.0246rh . FILTER (?x1 != fb:m.0246rh) . ?x1 fb:exhibitions.exhibition_run.opened_on ?x2 } LIMIT 9999", 
    "utterance": "when was the frida kahlo exhibit at the philadelphia art museum", 
    "id": 617
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:en.yosemite_national_park fb:protected_sites.protected_site.date_established ?x1 } LIMIT 9999", 
    "result": [
      "1890-10-01"
    ], 
    "targetFormula": "(!fb:protected_sites.protected_site.date_established fb:en.yosemite_national_park)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.0c_y8 fb:protected_sites.protected_site.date_established ?x1 } LIMIT 9999", 
    "utterance": "when was yosemite national park designated as a protected place", 
    "id": 618
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x3 WHERE { { SELECT DISTINCT count(?x1) AS ?x3 WHERE { ?x2 fb:award.award_honor.award_winner fb:en.beyonce . FILTER (?x2 != fb:en.beyonce) . ?x2 fb:award.award_honor.award ?x1 } } } LIMIT 9999", 
    "result": [
      "49"
    ], 
    "targetFormula": "(count (!fb:award.award_honor.award ((lambda x (fb:award.award_honor.award_winner (var x))) fb:en.beyonce)))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x3 WHERE { { SELECT DISTINCT count(?x1) AS ?x3 WHERE { ?x2 fb:award.award_honor.award_winner fb:m.01mpq7s . FILTER (?x2 != fb:m.01mpq7s) . ?x2 fb:award.award_honor.award ?x1 } } } LIMIT 9999", 
    "utterance": "how many grammy awards did beyonce receive in her singing career", 
    "id": 619
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x3 ?x3name WHERE { ?x1 fb:award.award_nomination.award fb:en.academy_award_for_best_director . FILTER (?x1 != fb:en.academy_award_for_best_director) . FILTER (xsd:dateTime(?x2) >= xsd:dateTime(\"2011\"^^xsd:datetime)) . FILTER (xsd:dateTime(?x2) < xsd:dateTime(\"2012\"^^xsd:datetime)) . ?x1 fb:award.award_nomination.year ?x2 . FILTER (?x1 != \"2011\"^^xsd:datetime) . ?x1 fb:award.award_nomination.award_nominee ?x3 . OPTIONAL { ?x3 fb:type.object.name ?x3name } } LIMIT 9999", 
    "result": [
      "Martin Scorsese", 
      "Michel Hazanavicius", 
      "Woody Allen", 
      "Terrence Malick", 
      "Alexander Payne"
    ], 
    "targetFormula": "(!fb:award.award_nomination.award_nominee (and ((lambda x (fb:award.award_nomination.award (var x))) fb:en.academy_award_for_best_director) ((lambda x (fb:award.award_nomination.year (var x))) (date 2011 -1 -1))))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x3 ?x3name WHERE { ?x1 fb:award.award_nomination.award fb:m.0gs9p . FILTER (?x1 != fb:m.0gs9p) . FILTER (xsd:dateTime(?x2) >= xsd:dateTime(\"2011\"^^xsd:datetime)) . FILTER (xsd:dateTime(?x2) < xsd:dateTime(\"2012\"^^xsd:datetime)) . ?x1 fb:award.award_nomination.year ?x2 . FILTER (?x1 != \"2011\"^^xsd:datetime) . ?x1 fb:award.award_nomination.award_nominee ?x3 . OPTIONAL { ?x3 fb:type.object.name ?x3name } } LIMIT 9999", 
    "utterance": "who was nominated for the academy award for best director in 2011", 
    "id": 620
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.royal_institute_of_british_architects fb:award.award_presenting_organization.awards_presented ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Stirling Prize"
    ], 
    "targetFormula": "(!fb:award.award_presenting_organization.awards_presented fb:en.royal_institute_of_british_architects)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.0386gq fb:award.award_presenting_organization.awards_presented ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what award does the royal institute of british architects present", 
    "id": 621
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { ?x1 fb:geology.geological_formation.formed_during_period fb:en.cretaceous } } } LIMIT 9999", 
    "result": [
      "1"
    ], 
    "targetFormula": "(count (fb:geology.geological_formation.formed_during_period fb:en.cretaceous))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { ?x1 fb:geology.geological_formation.formed_during_period fb:m.01pt4 } } } LIMIT 9999", 
    "utterance": "how many rock formations were formed during the cretaceous period", 
    "id": 622
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:en.san_francisco_international_airport fb:aviation.airport.number_of_runways ?x1 } LIMIT 9999", 
    "result": [
      "4"
    ], 
    "targetFormula": "(!fb:aviation.airport.number_of_runways fb:en.san_francisco_international_airport)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.01l4xk fb:aviation.airport.number_of_runways ?x1 } LIMIT 9999", 
    "utterance": "how many runways does the san francisco international airport have", 
    "id": 623
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.1992_atlantic_hurricane_season fb:meteorology.tropical_cyclone_season.strongest_storm ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Hurricane Andrew"
    ], 
    "targetFormula": "(!fb:meteorology.tropical_cyclone_season.strongest_storm fb:en.1992_atlantic_hurricane_season)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.03b4cy fb:meteorology.tropical_cyclone_season.strongest_storm ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what was the strongest storm in the 1992 atlantic hurricane season", 
    "id": 624
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 ?x2name WHERE { ?x1 fb:ice_hockey.hockey_roster_position.player fb:en.colby_armstrong . FILTER (?x1 != fb:en.colby_armstrong) . ?x1 fb:ice_hockey.hockey_roster_position.team fb:en.toronto_maple_leafs . FILTER (?x1 != fb:en.toronto_maple_leafs) . ?x1 fb:ice_hockey.hockey_roster_position.position ?x2 . OPTIONAL { ?x2 fb:type.object.name ?x2name } } LIMIT 9999", 
    "result": [], 
    "targetFormula": "(!fb:ice_hockey.hockey_roster_position.position (and ((lambda x (fb:ice_hockey.hockey_roster_position.player (var x))) fb:en.colby_armstrong) ((lambda x (fb:ice_hockey.hockey_roster_position.team (var x))) fb:en.toronto_maple_leafs)))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 ?x2name WHERE { ?x1 fb:ice_hockey.hockey_roster_position.player fb:m.09zv8b . FILTER (?x1 != fb:m.09zv8b) . ?x1 fb:ice_hockey.hockey_roster_position.team fb:m.0j6tr . FILTER (?x1 != fb:m.0j6tr) . ?x1 fb:ice_hockey.hockey_roster_position.position ?x2 . OPTIONAL { ?x2 fb:type.object.name ?x2name } } LIMIT 9999", 
    "utterance": "what position does colby armstrong play on the toronto maple leafs", 
    "id": 625
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { ?x1 fb:award.hall_of_fame_induction.inductee fb:en.joni_mitchell . FILTER (?x1 != fb:en.joni_mitchell) . ?x1 fb:award.hall_of_fame_induction.hall_of_fame fb:en.rock_and_roll_hall_of_fame . FILTER (?x1 != fb:en.rock_and_roll_hall_of_fame) . ?x1 fb:award.hall_of_fame_induction.date ?x2 } LIMIT 9999", 
    "result": [
      "1997"
    ], 
    "targetFormula": "(!fb:award.hall_of_fame_induction.date (and ((lambda x (fb:award.hall_of_fame_induction.inductee (var x))) fb:en.joni_mitchell) ((lambda x (fb:award.hall_of_fame_induction.hall_of_fame (var x))) fb:en.rock_and_roll_hall_of_fame)))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { ?x1 fb:award.hall_of_fame_induction.inductee fb:m.045zr . FILTER (?x1 != fb:m.045zr) . ?x1 fb:award.hall_of_fame_induction.hall_of_fame fb:m.0g2c8 . FILTER (?x1 != fb:m.0g2c8) . ?x1 fb:award.hall_of_fame_induction.date ?x2 } LIMIT 9999", 
    "utterance": "when was joni mitchell inducted into the rock and roll hall of fame", 
    "id": 626
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 ?x2name WHERE { ?x1 fb:american_football.football_historical_roster_position.player fb:en.ray_lewis . FILTER (?x1 != fb:en.ray_lewis) . ?x1 fb:american_football.football_historical_roster_position.team fb:en.baltimore_ravens . FILTER (?x1 != fb:en.baltimore_ravens) . ?x1 fb:american_football.football_historical_roster_position.position_s ?x2 . OPTIONAL { ?x2 fb:type.object.name ?x2name } } LIMIT 9999", 
    "result": [
      "Linebacker"
    ], 
    "targetFormula": "(!fb:american_football.football_historical_roster_position.position_s (and ( (lambda x (fb:american_football.football_historical_roster_position.player (var x))) fb:en.ray_lewis) ( (lambda x (fb:american_football.football_historical_roster_position.team (var x))) fb:en.baltimore_ravens)))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 ?x2name WHERE { ?x1 fb:american_football.football_historical_roster_position.player fb:m.029wyf . FILTER (?x1 != fb:m.029wyf) . ?x1 fb:american_football.football_historical_roster_position.team fb:m.01ct6 . FILTER (?x1 != fb:m.01ct6) . ?x1 fb:american_football.football_historical_roster_position.position_s ?x2 . OPTIONAL { ?x2 fb:type.object.name ?x2name } } LIMIT 9999", 
    "utterance": "what positon does ray lewis currently play for the baltimore ravens", 
    "id": 627
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { ?x1 fb:ice_hockey.hockey_previous_roster_position.player fb:en.christopher_higgins . FILTER (?x1 != fb:en.christopher_higgins) . ?x1 fb:ice_hockey.hockey_previous_roster_position.team fb:en.montreal_canadiens . FILTER (?x1 != fb:en.montreal_canadiens) . ?x1 fb:ice_hockey.hockey_previous_roster_position.to ?x2 } LIMIT 9999", 
    "result": [
      "2009"
    ], 
    "targetFormula": "(!fb:ice_hockey.hockey_previous_roster_position.to (and ( (lambda x (fb:ice_hockey.hockey_previous_roster_position.player (var x))) fb:en.christopher_higgins) ((lambda x (fb:ice_hockey.hockey_previous_roster_position.team (var x))) fb:en.montreal_canadiens)))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { ?x1 fb:ice_hockey.hockey_previous_roster_position.player fb:m.04pq4b . FILTER (?x1 != fb:m.04pq4b) . ?x1 fb:ice_hockey.hockey_previous_roster_position.team fb:m.0bszz . FILTER (?x1 != fb:m.0bszz) . ?x1 fb:ice_hockey.hockey_previous_roster_position.to ?x2 } LIMIT 9999", 
    "utterance": "when did christopher higgins stop playing for the montreal canadiens", 
    "id": 628
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { ?x1 fb:award.award_honor.honored_for fb:en.everything_is_illuminated . FILTER (?x1 != fb:en.everything_is_illuminated) . ?x1 fb:award.award_honor.award fb:en.guardian_first_book_award . FILTER (?x1 != fb:en.guardian_first_book_award) . ?x1 fb:award.award_honor.year ?x2 } LIMIT 9999", 
    "result": [
      "2002"
    ], 
    "targetFormula": "(!fb:award.award_honor.year (and ((lambda x (fb:award.award_honor.honored_for (var x))) fb:en.everything_is_illuminated) ((lambda x (fb:award.award_honor.award (var x))) fb:en.guardian_first_book_award)))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { ?x1 fb:award.award_honor.honored_for fb:m.05w8jz . FILTER (?x1 != fb:m.05w8jz) . ?x1 fb:award.award_honor.award fb:m.06nyyl . FILTER (?x1 != fb:m.06nyyl) . ?x1 fb:award.award_honor.year ?x2 } LIMIT 9999", 
    "utterance": "when did everything is illuminated win the guardian first book award", 
    "id": 629
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x3 WHERE { { SELECT DISTINCT count(?x1) AS ?x3 WHERE { ?x2 fb:biology.breed_registration.breed_group fb:en.sporting_group . FILTER (?x2 != fb:en.sporting_group) . ?x2 fb:biology.breed_registration.registry fb:en.american_kennel_club . FILTER (?x2 != fb:en.american_kennel_club) . ?x2 fb:biology.breed_registration.breed ?x1 } } } LIMIT 9999", 
    "result": [
      "27"
    ], 
    "targetFormula": "(count (!fb:biology.breed_registration.breed (and ((lambda x (fb:biology.breed_registration.breed_group (var x))) fb:en.sporting_group) ((lambda x (fb:biology.breed_registration.registry (var x))) fb:en.american_kennel_club))))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x3 WHERE { { SELECT DISTINCT count(?x1) AS ?x3 WHERE { ?x2 fb:biology.breed_registration.breed_group fb:m.0265rtm . FILTER (?x2 != fb:m.0265rtm) . ?x2 fb:biology.breed_registration.registry fb:m.0ljl8 . FILTER (?x2 != fb:m.0ljl8) . ?x2 fb:biology.breed_registration.breed ?x1 } } } LIMIT 9999", 
    "utterance": "how many breeds are in the sporting group of the american kennel club", 
    "id": 630
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { ?x1 fb:projects.project_participation.project fb:m.0gk9x46 . FILTER (?x1 != fb:m.0gk9x46) . ?x1 fb:projects.project_participation.participant fb:en.francesco_sabatini . FILTER (?x1 != fb:en.francesco_sabatini) . ?x1 fb:projects.project_participation.from_date ?x2 } LIMIT 9999", 
    "result": [
      "1775"
    ], 
    "targetFormula": "(!fb:projects.project_participation.from_date (and ((lambda x (fb:projects.project_participation.project (var x))) fb:m.0gk9x46) ((lambda x (fb:projects.project_participation.participant (var x))) fb:en.francesco_sabatini)))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { ?x1 fb:projects.project_participation.project fb:m.0gk9x46 . FILTER (?x1 != fb:m.0gk9x46) . ?x1 fb:projects.project_participation.participant fb:m.09dqyz . FILTER (?x1 != fb:m.09dqyz) . ?x1 fb:projects.project_participation.from_date ?x2 } LIMIT 9999", 
    "utterance": "when did francesco sabatini start working on the puerta de san vicente", 
    "id": 631
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { ?x1 fb:protected_sites.natural_or_cultural_site_listing.designation fb:en.world_heritage_site . FILTER (?x1 != fb:en.world_heritage_site) . ?x1 fb:protected_sites.natural_or_cultural_site_listing.listed_site fb:en.abbey_of_st_gall . FILTER (?x1 != fb:en.abbey_of_st_gall) . ?x1 fb:protected_sites.natural_or_cultural_site_listing.date_listed ?x2 } LIMIT 9999", 
    "result": [
      "1983"
    ], 
    "targetFormula": "(!fb:protected_sites.natural_or_cultural_site_listing.date_listed (and ( (lambda x (fb:protected_sites.natural_or_cultural_site_listing.designation (var x))) fb:en.world_heritage_site) ( (lambda x (fb:protected_sites.natural_or_cultural_site_listing.listed_site (var x))) fb:en.abbey_of_st_gall)))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { ?x1 fb:protected_sites.natural_or_cultural_site_listing.designation fb:m.0c7g7 . FILTER (?x1 != fb:m.0c7g7) . ?x1 fb:protected_sites.natural_or_cultural_site_listing.listed_site fb:m.079g7 . FILTER (?x1 != fb:m.079g7) . ?x1 fb:protected_sites.natural_or_cultural_site_listing.date_listed ?x2 } LIMIT 9999", 
    "utterance": "when was the abbey of st. gall listed as an unesco world heritage site", 
    "id": 632
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { ?x1 fb:automotive.us_fuel_economy.trim_level fb:m.04nbpg5 . FILTER (?x1 != fb:m.04nbpg5) . ?x1 fb:automotive.us_fuel_economy.highway_mpg ?x2 } LIMIT 9999", 
    "result": [
      "32"
    ], 
    "targetFormula": "(!fb:automotive.us_fuel_economy.highway_mpg ((lambda x (fb:automotive.us_fuel_economy.trim_level (var x))) fb:m.04nbpg5))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { ?x1 fb:automotive.us_fuel_economy.trim_level fb:m.04nbpg5 . FILTER (?x1 != fb:m.04nbpg5) . ?x1 fb:automotive.us_fuel_economy.highway_mpg ?x2 } LIMIT 9999", 
    "utterance": "what is the fuel economy of a 2008 hyundai accent gls sedan in the city", 
    "id": 633
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x3 WHERE { { SELECT DISTINCT count(?x1) AS ?x3 WHERE { ?x2 fb:celebrities.legal_entanglement.offense fb:en.driving_under_the_influence . FILTER (?x2 != fb:en.driving_under_the_influence) . ?x2 fb:celebrities.legal_entanglement.celebrity ?x1 } } } LIMIT 9999", 
    "result": [
      "14"
    ], 
    "targetFormula": "(count (!fb:celebrities.legal_entanglement.celebrity ((lambda x (fb:celebrities.legal_entanglement.offense (var x))) fb:en.driving_under_the_influence)))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x3 WHERE { { SELECT DISTINCT count(?x1) AS ?x3 WHERE { ?x2 fb:celebrities.legal_entanglement.offense fb:m.02k2cg . FILTER (?x2 != fb:m.02k2cg) . ?x2 fb:celebrities.legal_entanglement.celebrity ?x1 } } } LIMIT 9999", 
    "utterance": "how many celebrities have been charged with driving under the influence", 
    "id": 634
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 ?x2name WHERE { ?x1 fb:olympics.olympic_medal_honor.event fb:en.tennis_at_the_1896_summer_olympics_mens_singles . FILTER (?x1 != fb:en.tennis_at_the_1896_summer_olympics_mens_singles) . ?x1 fb:olympics.olympic_medal_honor.medal fb:en.gold_medal . FILTER (?x1 != fb:en.gold_medal) . ?x1 fb:olympics.olympic_medal_honor.medalist ?x2 . OPTIONAL { ?x2 fb:type.object.name ?x2name } } LIMIT 9999", 
    "result": [
      "John Pius Boland"
    ], 
    "targetFormula": "(!fb:olympics.olympic_medal_honor.medalist (and ( (lambda x (fb:olympics.olympic_medal_honor.event (var x))) fb:en.tennis_at_the_1896_summer_olympics_mens_singles) ((lambda x (fb:olympics.olympic_medal_honor.medal (var x))) fb:en.gold_medal)))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 ?x2name WHERE { ?x1 fb:olympics.olympic_medal_honor.event fb:m.0cf3_w . FILTER (?x1 != fb:m.0cf3_w) . ?x1 fb:olympics.olympic_medal_honor.medal fb:m.02lpp7 . FILTER (?x1 != fb:m.02lpp7) . ?x1 fb:olympics.olympic_medal_honor.medalist ?x2 . OPTIONAL { ?x2 fb:type.object.name ?x2name } } LIMIT 9999", 
    "utterance": "who got the gold medal in men_s singles tennis at the 1896 summer olympics", 
    "id": 635
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 ?x2name WHERE { ?x1 fb:award.award_honor.award fb:en.grammy_award_for_best_spoken_word_album . FILTER (?x1 != fb:en.grammy_award_for_best_spoken_word_album) . ?x1 fb:award.award_honor.award_winner fb:en.barack_obama . FILTER (?x1 != fb:en.barack_obama) . ?x1 fb:award.award_honor.honored_for ?x2 . OPTIONAL { ?x2 fb:type.object.name ?x2name } } LIMIT 9999", 
    "result": [
      "Dreams from My Father", 
      "The Audacity of Hope: Thoughts on Reclaiming the American Dream"
    ], 
    "targetFormula": "(!fb:award.award_honor.honored_for (and ((lambda x (fb:award.award_honor.award (var x))) fb:en.grammy_award_for_best_spoken_word_album) ((lambda x (fb:award.award_honor.award_winner (var x))) fb:en.barack_obama)))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 ?x2name WHERE { ?x1 fb:award.award_honor.award fb:m.02grdc . FILTER (?x1 != fb:m.02grdc) . ?x1 fb:award.award_honor.award_winner fb:m.02mjmr . FILTER (?x1 != fb:m.02mjmr) . ?x1 fb:award.award_honor.honored_for ?x2 . OPTIONAL { ?x2 fb:type.object.name ?x2name } } LIMIT 9999", 
    "utterance": "for what albums did barack obama win a grammy award for best spoken word album", 
    "id": 636
  }
]
