[
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.henry_iii_of_england fb:people.deceased_person.place_of_burial ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Westminster Abbey"
    ], 
    "targetFormula": "(!fb:people.deceased_person.place_of_burial fb:en.henry_iii_of_england)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.0cl53 fb:people.deceased_person.place_of_burial ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "where was henry iii buried", 
    "id": 57
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x3 ?x3name WHERE { ?x1 fb:award.award_honor.award fb:en.academy_award_for_best_picture . FILTER (?x1 != fb:en.academy_award_for_best_picture) . FILTER (xsd:dateTime(?x2) >= xsd:dateTime(\"2010\"^^xsd:datetime)) . FILTER (xsd:dateTime(?x2) < xsd:dateTime(\"2011\"^^xsd:datetime)) . ?x1 fb:award.award_honor.year ?x2 . FILTER (?x1 != \"2010\"^^xsd:datetime) . ?x1 fb:award.award_honor.award_winner ?x3 . OPTIONAL { ?x3 fb:type.object.name ?x3name } } LIMIT 9999", 
    "result": [
      "Emile Sherman", 
      "Iain Canning", 
      "Gareth Unwin"
    ], 
    "targetFormula": "(!fb:award.award_honor.award_winner (and ((lambda x (fb:award.award_honor.award (var x))) fb:en.academy_award_for_best_picture) ((lambda x (fb:award.award_honor.year (var x))) (date 2010 -1 -1))))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x3 ?x3name WHERE { ?x1 fb:award.award_honor.award fb:m.0gq9h . FILTER (?x1 != fb:m.0gq9h) . FILTER (xsd:dateTime(?x2) >= xsd:dateTime(\"2010\"^^xsd:datetime)) . FILTER (xsd:dateTime(?x2) < xsd:dateTime(\"2011\"^^xsd:datetime)) . ?x1 fb:award.award_honor.year ?x2 . FILTER (?x1 != \"2010\"^^xsd:datetime) . ?x1 fb:award.award_honor.award_winner ?x3 . OPTIONAL { ?x3 fb:type.object.name ?x3name } } LIMIT 9999", 
    "utterance": "who won best movie of 2010", 
    "id": 58
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:en.japanese_yen fb:finance.currency.prefix_symbol ?x1 } LIMIT 9999", 
    "result": [
      "\u00a5"
    ], 
    "targetFormula": "(!fb:finance.currency.prefix_symbol fb:en.japanese_yen)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.088n7 fb:finance.currency.prefix_symbol ?x1 } LIMIT 9999", 
    "utterance": "what is the symbol for yen", 
    "id": 59
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:en.coronet_peak fb:skiing.ski_area.opening_date ?x1 } LIMIT 9999", 
    "result": [
      "1947"
    ], 
    "targetFormula": "(!fb:skiing.ski_area.opening_date fb:en.coronet_peak)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.044f85 fb:skiing.ski_area.opening_date ?x1 } LIMIT 9999", 
    "utterance": "when did coronet peak open", 
    "id": 60
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { ?x1 fb:government.us_president.presidency_number 22.0 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Grover Cleveland"
    ], 
    "targetFormula": "(fb:government.us_president.presidency_number (number 22.0 fb:en.unitless))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { ?x1 fb:government.us_president.presidency_number 22.0 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "who was the 22nd president", 
    "id": 61
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.b12 fb:music.artist.genre ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Electronic music", 
      "Techno", 
      "Intelligent dance music"
    ], 
    "targetFormula": "(!fb:music.artist.genre fb:en.b12)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.07sxww fb:music.artist.genre ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what genre of music is b12", 
    "id": 62
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.the_doctor fb:fictional_universe.fictional_character.species ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Time Lord"
    ], 
    "targetFormula": "(!fb:fictional_universe.fictional_character.species fb:en.the_doctor)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.03thkf fb:fictional_universe.fictional_character.species ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what species is the doctor", 
    "id": 63
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.samuel_beckett fb:people.deceased_person.cause_of_death ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Emphysema"
    ], 
    "targetFormula": "(!fb:people.deceased_person.cause_of_death fb:en.samuel_beckett)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.06whf fb:people.deceased_person.cause_of_death ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "how did samuel beckett die", 
    "id": 64
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.the_dabble_blog fb:internet.blog.blogger ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Avi Bryant"
    ], 
    "targetFormula": "(!fb:internet.blog.blogger fb:en.the_dabble_blog)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.04sxg_l fb:internet.blog.blogger ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "who writes the dabble blog", 
    "id": 65
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.nbc_meet_the_press_video fb:broadcast.content.producer ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "MSNBC"
    ], 
    "targetFormula": "(!fb:broadcast.content.producer fb:en.nbc_meet_the_press_video)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.041w8j2 fb:broadcast.content.producer ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "who produces meet the press", 
    "id": 66
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.13_going_on_30 fb:film.film.directed_by ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Gary Winick"
    ], 
    "targetFormula": "(!fb:film.film.directed_by fb:en.13_going_on_30)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.02vzpb fb:film.film.directed_by ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "who directed 13 going on 30", 
    "id": 67
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.hat fb:fashion.garment.more_specialized_forms ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Toque", 
      "Baseball cap", 
      "Tam o' Shanter", 
      "Square academic cap", 
      "Kippah", 
      "Bowler hat", 
      "Fedora", 
      "Beanie", 
      "Straw hat", 
      "Shtreimel", 
      "Spodik", 
      "Kalimavkion", 
      "Kolpik", 
      "Helmet"
    ], 
    "targetFormula": "(!fb:fashion.garment.more_specialized_forms fb:en.hat)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.02dl1y fb:fashion.garment.more_specialized_forms ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what are some types of hats", 
    "id": 68
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:en.mark_mckinney fb:people.person.date_of_birth ?x1 } LIMIT 9999", 
    "result": [
      "1959-06-26"
    ], 
    "targetFormula": "(!fb:people.person.date_of_birth fb:en.mark_mckinney)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.04bt9q fb:people.person.date_of_birth ?x1 } LIMIT 9999", 
    "utterance": "when was mark mckinney born", 
    "id": 69
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.syphillis fb:medicine.infectious_disease.transmission ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Vertical transmission", 
      "Sex"
    ], 
    "targetFormula": "(!fb:medicine.infectious_disease.transmission fb:en.syphillis)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.074m2 fb:medicine.infectious_disease.transmission ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "how is syphilis transmitted", 
    "id": 70
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:en.jack_albertson fb:people.deceased_person.date_of_death ?x1 } LIMIT 9999", 
    "result": [
      "1981-11-25"
    ], 
    "targetFormula": "(!fb:people.deceased_person.date_of_death fb:en.jack_albertson)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.0hw6_ fb:people.deceased_person.date_of_death ?x1 } LIMIT 9999", 
    "utterance": "when did jack albertson die", 
    "id": 71
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.titanic_special_edition_dvd fb:film.film.produced_by ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "James Cameron", 
      "Jon Landau"
    ], 
    "targetFormula": "(!fb:film.film.produced_by fb:en.titanic_special_edition_dvd)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.0dr_4 fb:film.film.produced_by ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "who was titanic produced by", 
    "id": 72
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.the_thinker fb:visual_art.artwork.media ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Bronze", 
      "Marble"
    ], 
    "targetFormula": "(!fb:visual_art.artwork.media fb:en.the_thinker)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.030ljv fb:visual_art.artwork.media ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what is the thinker made of", 
    "id": 73
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:en.john_f_kennedy fb:people.deceased_person.date_of_death ?x1 } LIMIT 9999", 
    "result": [
      "1963-11-22"
    ], 
    "targetFormula": "(!fb:people.deceased_person.date_of_death fb:en.john_f_kennedy)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.0d3k14 fb:people.deceased_person.date_of_death ?x1 } LIMIT 9999", 
    "utterance": "when did john f kennedy die", 
    "id": 74
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.leukemia fb:medicine.disease.causes ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Mutation"
    ], 
    "targetFormula": "(!fb:medicine.disease.causes fb:en.leukemia)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.04psf fb:medicine.disease.causes ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what diseases cause leukemia", 
    "id": 75
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.windows_live_search fb:internet.website.category ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Search engine", 
      "Web search engine"
    ], 
    "targetFormula": "(!fb:internet.website.category fb:en.windows_live_search)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.0bx7rw fb:internet.website.category ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what kind of website is bing", 
    "id": 76
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { fb:en.euro fb:finance.currency.countries_used ?x1 } } } LIMIT 9999", 
    "result": [
      "33"
    ], 
    "targetFormula": "(count (!fb:finance.currency.countries_used fb:en.euro))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { fb:m.02l6h fb:finance.currency.countries_used ?x1 } } } LIMIT 9999", 
    "utterance": "how many countries use euros", 
    "id": 77
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:en.wells_fargo fb:organization.organization.date_founded ?x1 } LIMIT 9999", 
    "result": [
      "1852-03-18"
    ], 
    "targetFormula": "(!fb:organization.organization.date_founded fb:en.wells_fargo)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.01kdws fb:organization.organization.date_founded ?x1 } LIMIT 9999", 
    "utterance": "when was wells fargo founded", 
    "id": 78
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.walden_pond fb:location.location.containedby ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Massachusetts", 
      "Middlesex County", 
      "Concord"
    ], 
    "targetFormula": "(!fb:location.location.containedby fb:en.walden_pond)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.02lzfx fb:location.location.containedby ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "where is walden pond located", 
    "id": 79
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.taekwondo fb:martial_arts.martial_art.origin ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Korea"
    ], 
    "targetFormula": "(!fb:martial_arts.martial_art.origin fb:en.taekwondo)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.07gyv fb:martial_arts.martial_art.origin ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "where did taekwondo originate", 
    "id": 81
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:en.westminster_abbey fb:architecture.structure.height_meters ?x1 } LIMIT 9999", 
    "result": [
      "68.7"
    ], 
    "targetFormula": "(!fb:architecture.structure.height_meters fb:en.westminster_abbey)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.0bvqq fb:architecture.structure.height_meters ?x1 } LIMIT 9999", 
    "utterance": "how tall is westminster abbey", 
    "id": 82
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.jerry_seinfeld fb:people.person.place_of_birth ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Brooklyn"
    ], 
    "targetFormula": "(!fb:people.person.place_of_birth fb:en.jerry_seinfeld)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.0q5hw fb:people.person.place_of_birth ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "where was jerry seinfeld born", 
    "id": 83
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.meet_the_parents fb:film.film.directed_by ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Jay Roach"
    ], 
    "targetFormula": "(!fb:film.film.directed_by fb:en.meet_the_parents)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.033fqh fb:film.film.directed_by ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "who directed meet the parents", 
    "id": 84
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.ron_glass fb:people.person.religion ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Buddhism"
    ], 
    "targetFormula": "(!fb:people.person.religion fb:en.ron_glass)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.03h82p fb:people.person.religion ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what is ron glass 's religion", 
    "id": 85
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { ?x1 fb:food.nutrition_fact.food fb:en.quinoa . FILTER (?x1 != fb:en.quinoa) . ?x1 fb:food.nutrition_fact.nutrient fb:en.protein . FILTER (?x1 != fb:en.protein) . ?x1 fb:food.nutrition_fact.quantity ?x2 } LIMIT 9999", 
    "result": [
      "4.4"
    ], 
    "targetFormula": "(!fb:food.nutrition_fact.quantity (and ((lambda x (fb:food.nutrition_fact.food (var x))) fb:en.quinoa) ((lambda x (fb:food.nutrition_fact.nutrient (var x))) fb:en.protein)))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { ?x1 fb:food.nutrition_fact.food fb:m.0f07x . FILTER (?x1 != fb:m.0f07x) . ?x1 fb:food.nutrition_fact.nutrient fb:m.05wvs . FILTER (?x1 != fb:m.05wvs) . ?x1 fb:food.nutrition_fact.quantity ?x2 } LIMIT 9999", 
    "utterance": "how much protein is in quinoa", 
    "id": 86
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.026lz95 fb:biology.fossil_specimen.found_at_site ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Kleine Feldhofer Grotte"
    ], 
    "targetFormula": "(!fb:biology.fossil_specimen.found_at_site fb:m.026lz95)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.026lz95 fb:biology.fossil_specimen.found_at_site ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "where was neanderthal 1 found", 
    "id": 87
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:en.australia fb:location.location.area ?x1 } LIMIT 9999", 
    "result": [
      "7692024"
    ], 
    "targetFormula": "(!fb:location.location.area fb:en.australia)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.0chghy fb:location.location.area ?x1 } LIMIT 9999", 
    "utterance": "what is the area of australia", 
    "id": 88
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.ceratopsia fb:base.dinosaur.dinosaur.diet ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Herbivore"
    ], 
    "targetFormula": "(!fb:base.dinosaur.dinosaur.diet fb:en.ceratopsia)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.04qb56 fb:base.dinosaur.dinosaur.diet ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what diet did ceratopsia have", 
    "id": 89
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.plastiki fb:boats.ship.means_of_propulsion ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Wind power"
    ], 
    "targetFormula": "(!fb:boats.ship.means_of_propulsion fb:en.plastiki)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.05c15_j fb:boats.ship.means_of_propulsion ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "how is the plastiki propelled", 
    "id": 90
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.car_talk fb:broadcast.content.artist ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Tom and Ray Magliozzi", 
      "Tom Magliozzi"
    ], 
    "targetFormula": "(!fb:broadcast.content.artist fb:en.car_talk)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.01_zz fb:broadcast.content.artist ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "who are the hosts of car talk", 
    "id": 91
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.jupiter fb:astronomy.orbital_relationship.orbited_by ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Callisto", 
      "Callirrhoe", 
      "Chaldene", 
      "Himalia", 
      "Elara", 
      "Ananke", 
      "Pasiphae", 
      "Sinope", 
      "Carme", 
      "Themisto", 
      "Kale", 
      "Isonoe", 
      "Harpalyke", 
      "Hermippe", 
      "Praxidike", 
      "Iocaste", 
      "Pasithee", 
      "Euporie", 
      "Orthosie", 
      "Euanthe", 
      "Thyone", 
      "Aitne", 
      "Erinome", 
      "Taygete", 
      "Kalyke", 
      "Eurydome", 
      "Sponde", 
      "Autonoe", 
      "Megaclite", 
      "Aoede", 
      "S/2000 J 11", 
      "Arche", 
      "Eukelade", 
      "S/2003 J 2", 
      "S/2003 J 3", 
      "S/2003 J 4", 
      "S/2003 J 5", 
      "Helike", 
      "Hegemone", 
      "S/2003 J 9", 
      "S/2003 J 10", 
      "Kallichore", 
      "S/2003 J 12", 
      "Cyllene", 
      "Kore", 
      "S/2003 J 15", 
      "S/2003 J 16", 
      "Herse", 
      "S/2003 J 18", 
      "S/2003 J 19", 
      "Carpo", 
      "Mneme", 
      "Thelxinoe", 
      "S/2003 J 23", 
      "Lysithea", 
      "Adrastea", 
      "Europa", 
      "Metis", 
      "Amalthea", 
      "Ganymede", 
      "Thebe", 
      "Leda", 
      "Io", 
      "S/2010 J 1", 
      "S/2010 J 2", 
      "S/2011 J 1", 
      "S/2011 J 2"
    ], 
    "targetFormula": "(!fb:astronomy.orbital_relationship.orbited_by fb:en.jupiter)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.09q84 fb:astronomy.orbital_relationship.orbited_by ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what are the moons of jupiter", 
    "id": 92
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.illinois fb:location.location.time_zones ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Central Time Zone", 
      "UTC\u221206:00"
    ], 
    "targetFormula": "(!fb:location.location.time_zones fb:en.illinois)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.03v0t fb:location.location.time_zones ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "in what time zone is illinois", 
    "id": 93
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 ?x2name WHERE { ?x1 fb:interests.collection.collector fb:en.elizabeth_ii_of_the_united_kingdom . FILTER (?x1 != fb:en.elizabeth_ii_of_the_united_kingdom) . ?x1 fb:interests.collection.category ?x2 . OPTIONAL { ?x2 fb:type.object.name ?x2name } } LIMIT 9999", 
    "result": [
      "Postage stamp"
    ], 
    "targetFormula": "(!fb:interests.collection.category ((lambda x (fb:interests.collection.collector (var x))) fb:en.elizabeth_ii_of_the_united_kingdom))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 ?x2name WHERE { ?x1 fb:interests.collection.collector fb:m.0d1_f . FILTER (?x1 != fb:m.0d1_f) . ?x1 fb:interests.collection.category ?x2 . OPTIONAL { ?x2 fb:type.object.name ?x2name } } LIMIT 9999", 
    "utterance": "what did elizabeth ii collect", 
    "id": 94
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.luke_skywalker fb:fictional_universe.fictional_character.place_of_birth ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Polis Massa"
    ], 
    "targetFormula": "(!fb:fictional_universe.fictional_character.place_of_birth fb:en.luke_skywalker)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.0f1bg fb:fictional_universe.fictional_character.place_of_birth ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "where was luke skywalker born", 
    "id": 95
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:en.macintosh fb:computer.computer.introduced ?x1 } LIMIT 9999", 
    "result": [
      "1984-01-24"
    ], 
    "targetFormula": "(!fb:computer.computer.introduced fb:en.macintosh)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.0zd6 fb:computer.computer.introduced ?x1 } LIMIT 9999", 
    "utterance": "when was macintosh introduced", 
    "id": 96
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.the_game_of_life fb:games.game.designer ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Reuben Klamer"
    ], 
    "targetFormula": "(!fb:games.game.designer fb:en.the_game_of_life)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.025sm93 fb:games.game.designer ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "who designed the game of life", 
    "id": 97
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.2_fast_2_furious fb:film.film.directed_by ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "John Singleton"
    ], 
    "targetFormula": "(!fb:film.film.directed_by fb:en.2_fast_2_furious)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.024lff fb:film.film.directed_by ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "who directed 2 fast 2 furious", 
    "id": 98
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.09hvx fb:opera.opera.language ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "German Language"
    ], 
    "targetFormula": "(!fb:opera.opera.language fb:m.09hvx)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.09hvx fb:opera.opera.language ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what language is lohengrin in", 
    "id": 99
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.coal fb:geology.rock_type.sub_types ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Sub-bituminous coal", 
      "Lignite", 
      "Anthracite", 
      "Cannel coal", 
      "Bituminous coal"
    ], 
    "targetFormula": "(!fb:geology.rock_type.sub_types fb:en.coal)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.01sy7 fb:geology.rock_type.sub_types ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what are the sub-types of coal", 
    "id": 100
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.tagliablog fb:internet.blog.language ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Italian Language"
    ], 
    "targetFormula": "(!fb:internet.blog.language fb:en.tagliablog)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.04clgrg fb:internet.blog.language ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what language is tagliablog in", 
    "id": 101
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { fb:en.god fb:religion.deity.deity_of ?x1 } } } LIMIT 9999", 
    "result": [
      "10"
    ], 
    "targetFormula": "(count (!fb:religion.deity.deity_of fb:en.god))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { fb:m.0d05l6 fb:religion.deity.deity_of ?x1 } } } LIMIT 9999", 
    "utterance": "how many religions worship god", 
    "id": 102
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:en.mount_fuji fb:geography.mountain.last_eruption ?x1 } LIMIT 9999", 
    "result": [
      "1707-12-16"
    ], 
    "targetFormula": "(!fb:geography.mountain.last_eruption fb:en.mount_fuji)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.0cks0 fb:geography.mountain.last_eruption ?x1 } LIMIT 9999", 
    "utterance": "when did mount fuji last erupt", 
    "id": 103
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.wells_fargo fb:business.customer.supplier ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "CompuCom"
    ], 
    "targetFormula": "(!fb:business.customer.supplier fb:en.wells_fargo)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.01kdws fb:business.customer.supplier ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "who is wells fargo 's supplier", 
    "id": 104
  }
]
