[
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { fb:en.asia fb:location.statistical_region.population ?x1 . FILTER (?x1 != fb:en.asia) . ?x1 fb:measurement_unit.dated_integer.number ?x2 } LIMIT 9999", 
    "result": [
      "436000000", 
      "4164252000", 
      "243000000", 
      "947000000", 
      "800000000", 
      "1402000000", 
      "4140336501", 
      "3879000000", 
      "3634000000"
    ], 
    "targetFormula": "(!fb:measurement_unit.dated_integer.number ((lambda x (!fb:location.statistical_region.population (var x))) fb:en.asia))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { fb:m.0j0k fb:location.statistical_region.population ?x1 . FILTER (?x1 != fb:m.0j0k) . ?x1 fb:measurement_unit.dated_integer.number ?x2 } LIMIT 9999", 
    "utterance": "what is the population of asia", 
    "id": 105
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:en.antarctica fb:location.location.area ?x1 } LIMIT 9999", 
    "result": [
      "14000000"
    ], 
    "targetFormula": "(!fb:location.location.area fb:en.antarctica)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.0jfx fb:location.location.area ?x1 } LIMIT 9999", 
    "utterance": "what is the area of antarctica", 
    "id": 106
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:en.positron fb:physics.particle.spin ?x1 } LIMIT 9999", 
    "result": [
      "0.5"
    ], 
    "targetFormula": "(!fb:physics.particle.spin fb:en.positron)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.065sn fb:physics.particle.spin ?x1 } LIMIT 9999", 
    "utterance": "what is the spin of a positron", 
    "id": 107
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.0b_h31m fb:boats.ship.length_overall ?x1 } LIMIT 9999", 
    "result": [
      "15.25"
    ], 
    "targetFormula": "(!fb:boats.ship.length_overall fb:m.0b_h31m)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.0b_h31m fb:boats.ship.length_overall ?x1 } LIMIT 9999", 
    "utterance": "how long overall is the tahina", 
    "id": 108
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:en.hurricane_andrew fb:meteorology.tropical_cyclone.formed ?x1 } LIMIT 9999", 
    "result": [
      "1992-08-16"
    ], 
    "targetFormula": "(!fb:meteorology.tropical_cyclone.formed fb:en.hurricane_andrew)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.01f01h fb:meteorology.tropical_cyclone.formed ?x1 } LIMIT 9999", 
    "utterance": "when did hurricane andrew form", 
    "id": 110
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 ?x2name WHERE { fb:en.the_three_doctors fb:tv.tv_series_episode.producers ?x1 . ?x1 fb:tv.tv_producer_episode_credit.producer ?x2 . OPTIONAL { ?x2 fb:type.object.name ?x2name } } LIMIT 9999", 
    "result": [
      "Barry Letts"
    ], 
    "targetFormula": "(!fb:tv.tv_producer_episode_credit.producer (!fb:tv.tv_series_episode.producers fb:en.the_three_doctors))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 ?x2name WHERE { fb:m.0201f8 fb:tv.tv_series_episode.producers ?x1 . ?x1 fb:tv.tv_producer_episode_credit.producer ?x2 . OPTIONAL { ?x2 fb:type.object.name ?x2name } } LIMIT 9999", 
    "utterance": "who produced the three doctors", 
    "id": 111
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { ?x1 fb:film.film_cut.film fb:en.titanic_special_edition_dvd . FILTER (?x1 != fb:en.titanic_special_edition_dvd) . ?x1 fb:film.film_cut.runtime ?x2 } LIMIT 9999", 
    "result": [
      "194", 
      "195"
    ], 
    "targetFormula": "(!fb:film.film_cut.runtime ((lambda x (fb:film.film_cut.film (var x))) fb:en.titanic_special_edition_dvd))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { ?x1 fb:film.film_cut.film fb:m.0dr_4 . FILTER (?x1 != fb:m.0dr_4) . ?x1 fb:film.film_cut.runtime ?x2 } LIMIT 9999", 
    "utterance": "how long is titanic 's runtime", 
    "id": 112
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.stephen_fry fb:influence.influence_node.influenced_by ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Oscar Wilde", 
      "Douglas Adams", 
      "Edward Frederic Benson", 
      "Christopher Hitchens"
    ], 
    "targetFormula": "(!fb:influence.influence_node.influenced_by fb:en.stephen_fry)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.0h0yt fb:influence.influence_node.influenced_by ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "who has influenced stephen fry", 
    "id": 113
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.denver_spurs fb:sports.sports_team.arena_stadium ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "McNichols Sports Arena"
    ], 
    "targetFormula": "(!fb:sports.sports_team.arena_stadium fb:en.denver_spurs)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.068nsv fb:sports.sports_team.arena_stadium ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "where do the denver spurs play", 
    "id": 114
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { fb:en.iowa fb:location.statistical_region.population ?x1 . FILTER (?x1 != fb:en.iowa) . ?x1 fb:measurement_unit.dated_integer.number ?x2 } LIMIT 9999", 
    "result": [
      "2818401", 
      "2791969", 
      "2891119", 
      "2858615", 
      "3062309", 
      "2931997", 
      "2929067", 
      "2953635", 
      "2934234", 
      "2907985", 
      "2850746", 
      "2941999", 
      "3032870", 
      "2888190", 
      "2902872", 
      "2829684", 
      "2999212", 
      "2781018", 
      "3049883", 
      "2768393", 
      "2880000", 
      "2770590", 
      "2964454", 
      "2917634", 
      "3016734", 
      "2797613", 
      "2867373", 
      "2767006", 
      "3074186", 
      "2382000", 
      "2439000", 
      "2301000", 
      "2756000", 
      "2880847", 
      "2742000", 
      "2227000", 
      "2217000", 
      "2428000", 
      "2543000", 
      "2708000", 
      "2223000", 
      "2249000", 
      "2305000", 
      "2475000", 
      "2679000", 
      "2729000", 
      "2495000", 
      "2625000", 
      "2747000", 
      "2509000", 
      "2214000", 
      "2220000", 
      "2366000", 
      "2441000", 
      "2494000", 
      "2746000", 
      "2918069", 
      "2425000", 
      "2228000", 
      "2450000", 
      "2629000", 
      "2825368", 
      "2915739", 
      "2460000", 
      "2537000", 
      "2334000", 
      "2703000", 
      "2805000", 
      "2222000", 
      "2279000", 
      "2578000", 
      "2626000", 
      "2212000", 
      "2903082", 
      "2338000", 
      "2420000", 
      "2432000", 
      "2750000", 
      "2400000", 
      "2407000", 
      "2482000", 
      "2510000", 
      "2467000", 
      "2308000", 
      "2803000", 
      "2867530", 
      "2913573", 
      "2231000", 
      "2211000", 
      "2379000", 
      "2427000", 
      "2489000", 
      "2498000", 
      "2520000", 
      "2860287", 
      "2863715", 
      "2224771", 
      "2404021", 
      "674913", 
      "2231853", 
      "192214", 
      "2621073", 
      "2538268", 
      "2470939", 
      "1194020", 
      "2757537", 
      "2824376", 
      "1624615", 
      "2913808", 
      "1912297", 
      "43112", 
      "2870547", 
      "2836972", 
      "2982644", 
      "2851705", 
      "2524000", 
      "2351000", 
      "2762000", 
      "2793000", 
      "2491000", 
      "2617000", 
      "2716000", 
      "2376000"
    ], 
    "targetFormula": "(!fb:measurement_unit.dated_integer.number ((lambda x (!fb:location.statistical_region.population (var x))) fb:en.iowa))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { fb:m.03s0w fb:location.statistical_region.population ?x1 . FILTER (?x1 != fb:m.03s0w) . ?x1 fb:measurement_unit.dated_integer.number ?x2 } LIMIT 9999", 
    "utterance": "what is the population in iowa", 
    "id": 115
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:en.renaissance fb:time.event.start_date ?x1 } LIMIT 9999", 
    "result": [
      "1300"
    ], 
    "targetFormula": "(!fb:time.event.start_date fb:en.renaissance)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.06cvx fb:time.event.start_date ?x1 } LIMIT 9999", 
    "utterance": "when did the renaissance begin", 
    "id": 116
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.titanic_special_edition_dvd fb:film.film.music ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "James Horner"
    ], 
    "targetFormula": "(!fb:film.film.music fb:en.titanic_special_edition_dvd)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.0dr_4 fb:film.film.music ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "who was the music by in titanic", 
    "id": 117
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.067y_k7 fb:book.written_work.author ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Julian Lloyd Webber"
    ], 
    "targetFormula": "(!fb:book.written_work.author fb:m.067y_k7)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.067y_k7 fb:book.written_work.author ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "who wrote travels with my cello", 
    "id": 118
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.judaism fb:religion.religion.includes ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Jewish Renewal", 
      "Hasidic Judaism", 
      "Reconstructionist Judaism", 
      "Orthodox Judaism", 
      "Conservative Judaism", 
      "Sephardic Judaism", 
      "Reform Judaism", 
      "Haredi Judaism", 
      "Modern Orthodox Judaism", 
      "Karaite Judaism", 
      "Rabbinic Judaism", 
      "Gitit"
    ], 
    "targetFormula": "(!fb:religion.religion.includes fb:en.judaism)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.03_gx fb:religion.religion.includes ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what types of judaism are there", 
    "id": 119
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.pablo_picasso fb:people.person.religion ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Atheism"
    ], 
    "targetFormula": "(!fb:people.person.religion fb:en.pablo_picasso)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.060_7 fb:people.person.religion ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what religion was pablo picasso", 
    "id": 120
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:en.new_york_state fb:common.topic.alias ?x1 } LIMIT 9999", 
    "result": [
      "NY", 
      "The Empire State", 
      "New York State"
    ], 
    "targetFormula": "(!fb:common.topic.alias fb:en.new_york_state)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.059rby fb:common.topic.alias ?x1 } LIMIT 9999", 
    "utterance": "what are nicknames for new york", 
    "id": 121
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.mike_brown_1970 fb:basketball.basketball_coach.team ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Cleveland Cavaliers"
    ], 
    "targetFormula": "(!fb:basketball.basketball_coach.team fb:en.mike_brown_1970)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.08lcnf fb:basketball.basketball_coach.team ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what team does mike brown coach", 
    "id": 122
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { fb:en.uk fb:finance.currency.countries_used ?x1 } } } LIMIT 9999", 
    "result": [
      "14"
    ], 
    "targetFormula": "(count (!fb:finance.currency.countries_used fb:en.uk))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { fb:m.01nv4h fb:finance.currency.countries_used ?x1 } } } LIMIT 9999", 
    "utterance": "how many countries use uk money", 
    "id": 123
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.london_stock_exchange fb:finance.stock_exchange.primary_regions ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "United Kingdom"
    ], 
    "targetFormula": "(!fb:finance.stock_exchange.primary_regions fb:en.london_stock_exchange)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.01c3gj fb:finance.stock_exchange.primary_regions ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what regions does the lse cover", 
    "id": 124
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.0cs96 fb:meteorology.cloud.appearance ?x1 } LIMIT 9999", 
    "result": [
      "Thin, wisplike strands"
    ], 
    "targetFormula": "(!fb:meteorology.cloud.appearance fb:m.0cs96)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.0cs96 fb:meteorology.cloud.appearance ?x1 } LIMIT 9999", 
    "utterance": "what do cirrus clouds look like", 
    "id": 125
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:en.danny_devito fb:people.person.date_of_birth ?x1 } LIMIT 9999", 
    "result": [
      "1944-11-17"
    ], 
    "targetFormula": "(!fb:people.person.date_of_birth fb:en.danny_devito)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.0q9kd fb:people.person.date_of_birth ?x1 } LIMIT 9999", 
    "utterance": "what year was danny devito born", 
    "id": 126
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { ?x1 fb:amusement_parks.park.rides fb:en.splash_mountain . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Disneyland"
    ], 
    "targetFormula": "(fb:amusement_parks.park.rides fb:en.splash_mountain)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { ?x1 fb:amusement_parks.park.rides fb:m.05086j . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "in what park is splash mountain", 
    "id": 127
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.t-38_talon fb:aviation.aircraft_model.manufacturer ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Northrop Corporation"
    ], 
    "targetFormula": "(!fb:aviation.aircraft_model.manufacturer fb:en.t-38_talon)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.01_2_2 fb:aviation.aircraft_model.manufacturer ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "who manufactures the t-38 talon", 
    "id": 128
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.polio_vaccine fb:medicine.vaccine.developed_by ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Jonas Salk", 
      "Albert Sabin"
    ], 
    "targetFormula": "(!fb:medicine.vaccine.developed_by fb:en.polio_vaccine)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.01b90_ fb:medicine.vaccine.developed_by ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "who developed the polio vaccine", 
    "id": 129
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.syphillis fb:medicine.disease.causes ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Treponema pallidum"
    ], 
    "targetFormula": "(!fb:medicine.disease.causes fb:en.syphillis)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.074m2 fb:medicine.disease.causes ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what are the causes of syphilis", 
    "id": 130
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.international_style fb:architecture.architectural_style.architects ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Richard Neutra", 
      "Rudolph Schindler", 
      "Ludwig Mies van der Rohe", 
      "Le Corbusier", 
      "Berthold Lubetkin", 
      "Clarence W. W. Mayhew"
    ], 
    "targetFormula": "(!fb:architecture.architectural_style.architects fb:en.international_style)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.01tq62 fb:architecture.architectural_style.architects ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "who are some bauhaus architects", 
    "id": 131
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x3 WHERE { { SELECT DISTINCT count(?x1) AS ?x3 WHERE { ?x2 fb:award.award_honor.honored_for fb:en.titanic_special_edition_dvd . FILTER (?x2 != fb:en.titanic_special_edition_dvd) . ?x2 fb:award.award_honor.award ?x1 } } } LIMIT 9999", 
    "result": [
      "75"
    ], 
    "targetFormula": "(count (!fb:award.award_honor.award ((lambda x (fb:award.award_honor.honored_for (var x))) fb:en.titanic_special_edition_dvd)))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x3 WHERE { { SELECT DISTINCT count(?x1) AS ?x3 WHERE { ?x2 fb:award.award_honor.honored_for fb:m.0dr_4 . FILTER (?x2 != fb:m.0dr_4) . ?x2 fb:award.award_honor.award ?x1 } } } LIMIT 9999", 
    "utterance": "how many awards did titanic win", 
    "id": 133
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.hinduism fb:religion.religion.deities ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Krishna", 
      "Murugan", 
      "Jagaddhatri", 
      "Devi", 
      "Durga", 
      "Guardians of the directions", 
      "Nandi", 
      "Radha", 
      "Ganesha", 
      "Lakshmi", 
      "Adimurti", 
      "Garuda", 
      "Hanuman", 
      "Indra", 
      "Varuna", 
      "Vayu", 
      "Saraswati", 
      "Khatushyam", 
      "Shakti", 
      "Agni", 
      "Balarama", 
      "Rohini", 
      "Kamadeva", 
      "Brahman", 
      "Prajapati", 
      "Jagannath", 
      "Kalki", 
      "Deva", 
      "N\u0101ga", 
      "Ayyappan", 
      "Vishnu", 
      "Pashupati", 
      "Rama", 
      "Vishvakarman", 
      "Aru\u1e47a", 
      "Dhara", 
      "Nirrta", 
      "Yama", 
      "Daksha", 
      "Shiva", 
      "Kali", 
      "Bhadra", 
      "Surya", 
      "Harihara", 
      "Anala", 
      "Radha Krishna", 
      "Apam Napat", 
      "Revanta", 
      "Bhaga", 
      "Maruts", 
      "Trimurti", 
      "B\u1e5bhaspati", 
      "Bhagavan", 
      "Mariamman", 
      "Lakshmana", 
      "Savitr", 
      "Ribhus", 
      "Nara-Narayana", 
      "Dhatri", 
      "Rishabha", 
      "Yama", 
      "Anila", 
      "Tvastar", 
      "Bhumiya", 
      "Mitravinda", 
      "Brahma"
    ], 
    "targetFormula": "(!fb:religion.religion.deities fb:en.hinduism)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.03j6c fb:religion.religion.deities ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what are the deities of hinduism", 
    "id": 134
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.02z3r fb:dining.cuisine.restaurant ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Fleur de Lys", 
      "Gregoire", 
      "Le Champlain", 
      "Voulez-Vous", 
      "Ultra Supper Club", 
      "Scaramouche Restaurant", 
      "Daniel", 
      "Biff's Bistro", 
      "Le Gavroche", 
      "Pontus by the sea", 
      "The Smoking Dog Bistro", 
      "Mas", 
      "Jeanty @ Jack's", 
      "Floataway Cafe", 
      "103 West", 
      "Babette's Cafe", 
      "The Big Red Tomato Bistro", 
      "Brasserie Le Coze", 
      "Cafe Diem", 
      "La Petite Auberge", 
      "Le Saint Amour", 
      "Nikolai's Roof", 
      "South of France", 
      "Violette", 
      "Brasserie Jo", 
      "Louis XVI", 
      "Cafe Rouge", 
      "La Note", 
      "La Poubelle Restaurant & Bar", 
      "La Conversation", 
      "Pastis", 
      "Fleur de Cocoa", 
      "Manresa", 
      "The Girl and the Fig, Petaluma, CA", 
      "California Culinary Academy", 
      "Pacific", 
      "Restaurant Lulu", 
      "Tommy Toy's Cuisine Chinoise", 
      "The Girl and the Fig", 
      "Lucques", 
      "Balthazar Restaurant", 
      "Aquarelle", 
      "Belgian Restaurant", 
      "Ventana", 
      "Girl and the Fig Cafe", 
      "Girl and the Fig", 
      "Girl and the Fig Pantry", 
      "Three Mountain Inn", 
      "The Old Newfane Inn", 
      "The Parker House Inn and Restaurant", 
      "Eva", 
      "Pierre", 
      "Lut\u00e8ce", 
      "Jean-Georges", 
      "Moulin de Mougins", 
      "Domaine Chandon California", 
      "Caf\u00e9 du Monde", 
      "Bistro Moncur", 
      "Bistrot Bistro", 
      "Bistro Pastis", 
      "Trafalgars Bistro", 
      "Chouchou", 
      "Masa's Restaurant", 
      "Chez Spencer", 
      "Bushi-tei", 
      "Le Zinc", 
      "Coi", 
      "Cote Sud", 
      "Le Montmartre", 
      "Restaurant Gordon Ramsay", 
      "L\u2019Atelier de Joel Robuchon", 
      "Hand and Flowers", 
      "Bistro Francais", 
      "Lumiere", 
      "Cassis", 
      "Jules Bistro", 
      "Le Gavroche", 
      "Mistral French Bistro", 
      "Parkside", 
      "The William Tell Restaurant", 
      "Boneta", 
      "Elixir", 
      "Auberge du Pommier", 
      "Azure Restaurant & Bar", 
      "Bodega", 
      "C\u00e9lestin", 
      "Chez Victor", 
      "Tati Bistro", 
      "Truffles Restaurant - Four Seasons Toronto", 
      "Central Michel Richard", 
      "Marcel's", 
      "Cafe MoZU", 
      "Bistrot du Coin", 
      "Perigee", 
      "Absinthe", 
      "Le Baccara", 
      "Signatures", 
      "Chez Papa Resto", 
      "The Butler & The Chef Bistro", 
      "Everest", 
      "Le Bec-Fin", 
      "Bistro 990", 
      "Le Continental", 
      "L'\u00c9chaud\u00e9", 
      "La Tani\u00e8re", 
      "Le Canard Hupp\u00e9", 
      "Le Marie-Clarisse", 
      "Le Panache", 
      "Le Galopin", 
      "Monte Cristo", 
      "Le Cercle", 
      "Le Clocher Pench\u00e9", 
      "Restaurant Initiale", 
      "Brasserie Les Halles", 
      "Tom Aikens Restaurant", 
      "Applebee's", 
      "Bistrot la Minette", 
      "Picasso", 
      "Solo", 
      "Cordial", 
      "Fred", 
      "FG", 
      "Latour", 
      "Masa's", 
      "Pastis", 
      "PlumpJack Cafe", 
      "Rubicon", 
      "French Laundry", 
      "Bistro 330", 
      "L'appart Resto", 
      "Au Bon Pain", 
      "Le Saint-Amour", 
      "Chanterelle", 
      "Le Bernardin", 
      "Chez Papa Bistrot", 
      "Galatoire's", 
      "Benitz Bistro", 
      "Pied a Terre", 
      "TCBY San Anselmo", 
      "Antoine's", 
      "Caf\u00e9 des Artistes", 
      "Z", 
      "La Fenouilli\u00e8re", 
      "Restaurante Martin Berasategui", 
      "The Capital", 
      "Blueberry Hill", 
      "Alain Ducasse", 
      "Chapeau", 
      "Le Crocodile", 
      "m.04yjvnx"
    ], 
    "targetFormula": "(!fb:dining.cuisine.restaurant fb:m.02z3r)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.02z3r fb:dining.cuisine.restaurant ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what are some french restaurants", 
    "id": 135
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.danny_devito fb:people.person.religion ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Judaism", 
      "Catholicism"
    ], 
    "targetFormula": "(!fb:people.person.religion fb:en.danny_devito)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.0q9kd fb:people.person.religion ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what is danny devito 's religion", 
    "id": 136
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:en.bruce_almighty fb:film.film.initial_release_date ?x1 } LIMIT 9999", 
    "result": [
      "2003-05-23"
    ], 
    "targetFormula": "(!fb:film.film.initial_release_date fb:en.bruce_almighty)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.01jft4 fb:film.film.initial_release_date ?x1 } LIMIT 9999", 
    "utterance": "when was bruce almighty released", 
    "id": 137
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { ?x1 fb:opera.opera.language fb:en.french } } } LIMIT 9999", 
    "result": [
      "304"
    ], 
    "targetFormula": "(count (fb:opera.opera.language fb:en.french))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { ?x1 fb:opera.opera.language fb:m.064_8sq } } } LIMIT 9999", 
    "utterance": "how many french operas are there", 
    "id": 138
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:en.michael_jackson fb:music.artist.active_start ?x1 } LIMIT 9999", 
    "result": [
      "1967"
    ], 
    "targetFormula": "(!fb:music.artist.active_start fb:en.michael_jackson)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.09889g fb:music.artist.active_start ?x1 } LIMIT 9999", 
    "utterance": "when did michael jackson go solo", 
    "id": 139
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:en.green_party fb:organization.organization.date_founded ?x1 } LIMIT 9999", 
    "result": [
      "2001"
    ], 
    "targetFormula": "(!fb:organization.organization.date_founded fb:en.green_party)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.07k5l fb:organization.organization.date_founded ?x1 } LIMIT 9999", 
    "utterance": "when was the green party founded", 
    "id": 140
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.bertrand_russell fb:people.deceased_person.cause_of_death ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Influenza"
    ], 
    "targetFormula": "(!fb:people.deceased_person.cause_of_death fb:en.bertrand_russell)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.01bpn fb:people.deceased_person.cause_of_death ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what did bertrand russell die of", 
    "id": 141
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.the_guardian fb:book.newspaper.circulation_areas ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "London", 
      "United Kingdom"
    ], 
    "targetFormula": "(!fb:book.newspaper.circulation_areas fb:en.the_guardian)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.0cnn5 fb:book.newspaper.circulation_areas ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "where is the guardian circulated", 
    "id": 142
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.miller_lite fb:food.beer.beer_style ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Lite American Lager"
    ], 
    "targetFormula": "(!fb:food.beer.beer_style fb:en.miller_lite)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.04747g fb:food.beer.beer_style ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what type of beer is miller lite", 
    "id": 143
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.hawker_sea_hawk fb:aviation.aircraft_model.designed_by ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Sydney Camm"
    ], 
    "targetFormula": "(!fb:aviation.aircraft_model.designed_by fb:en.hawker_sea_hawk)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.032d2y fb:aviation.aircraft_model.designed_by ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "who designed the hawker sea hawk", 
    "id": 144
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.fifth_amendment_to_the_united_states_constitution fb:law.constitutional_amendment.proposed_by ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "James Madison"
    ], 
    "targetFormula": "(!fb:law.constitutional_amendment.proposed_by fb:en.fifth_amendment_to_the_united_states_constitution)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.07sjg fb:law.constitutional_amendment.proposed_by ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "who proposed the fifth amendment", 
    "id": 145
  }
]
