[
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.02knmd5 fb:music.composition.composer ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Jerry Garcia"
    ], 
    "targetFormula": "(!fb:music.composition.composer fb:m.02knmd5)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.02knmd5 fb:music.composition.composer ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "who composed the song ship of fools", 
    "id": 192
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.toronto_maple_leafs fb:ice_hockey.hockey_team.coach ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Randy Carlyle"
    ], 
    "targetFormula": "(!fb:ice_hockey.hockey_team.coach fb:en.toronto_maple_leafs)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.0j6tr fb:ice_hockey.hockey_team.coach ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "who coaches the toronto maple leafs", 
    "id": 193
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.gato_class_submarine fb:boats.ship_class.ships_in_class ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "USS Bluefish", 
      "USS Cobia", 
      "USS Wahoo", 
      "USS Gabilan", 
      "USS Cavalla", 
      "USS Dorado (SS-248)", 
      "USS Albacore", 
      "USS Greenling", 
      "USS Dace", 
      "USS Flounder", 
      "USS Growler", 
      "USS Corvina", 
      "USS Drum (SS-228)", 
      "USS Tullibee (SS-284)", 
      "USS Croaker", 
      "USS Silversides", 
      "USS Pargo (SS-264)", 
      "USS Paddle (SS-263)", 
      "USS Cod", 
      "USS Muskallunge", 
      "USS Ray", 
      "USS Guavina", 
      "USS Pompon", 
      "USS Steelhead (SS-280)", 
      "USS Snook (SS-279)", 
      "USS Lapon", 
      "USS Sawfish (SS-276)", 
      "USS Guardfish", 
      "USS Blackfish", 
      "USS Flying Fish", 
      "USS Bashaw", 
      "USS Tinosa (SS-283)", 
      "USS Halibut", 
      "USS Raton", 
      "USS Angler", 
      "USS Herring", 
      "USS Haddock", 
      "USS Kingfish", 
      "USS Harder", 
      "USS Trigger", 
      "USS Gurnard (SSN-662)", 
      "USS Bream", 
      "USS Whale", 
      "USS Rock", 
      "USS Shad", 
      "USS Rasher", 
      "USS Amberjack", 
      "USS Redfin", 
      "USS Scorpion (SS-278)", 
      "USS Golet (SS-361)", 
      "USS Gunnel", 
      "USS Runner (SS-275)", 
      "USS Peto (SS-265)", 
      "USS Sunfish (SSN-649)", 
      "USS Haddo", 
      "USS Hoe", 
      "USS Gato (SS-212)", 
      "USS Jack", 
      "USS Mingo", 
      "USS Grouper", 
      "USS Flasher (SS-249)", 
      "USS Sunfish (SS-281)", 
      "USS Bonefish", 
      "USS Scamp (SS-277)", 
      "USS Flier", 
      "USS Hake", 
      "USS Barb", 
      "USS Grunion", 
      "USS Darter (SS-227)", 
      "USS Bluegill", 
      "USS Gurnard", 
      "USS Pogy (SS-266)", 
      "USS Hammerhead (SS-364)", 
      "USS Cero", 
      "USS Robalo (SS-273)", 
      "USS Tunny", 
      "USS Guitarro (SS-363)", 
      "USS Finback", 
      "USS Puffer (SS-268)", 
      "USS Pargo (SSN-650)", 
      "USS Puffer (SSN-652)"
    ], 
    "targetFormula": "(!fb:boats.ship_class.ships_in_class fb:en.gato_class_submarine)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.016w97 fb:boats.ship_class.ships_in_class ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what are some gato class submarines", 
    "id": 194
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:en.us fb:finance.currency.currency_code ?x1 } LIMIT 9999", 
    "result": [
      "USD"
    ], 
    "targetFormula": "(!fb:finance.currency.currency_code fb:en.us)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.09nqf fb:finance.currency.currency_code ?x1 } LIMIT 9999", 
    "utterance": "what is the usa money currency code", 
    "id": 195
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:en.united_nations fb:organization.organization.date_founded ?x1 } LIMIT 9999", 
    "result": [
      "1945-10-24"
    ], 
    "targetFormula": "(!fb:organization.organization.date_founded fb:en.united_nations)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.07t65 fb:organization.organization.date_founded ?x1 } LIMIT 9999", 
    "utterance": "when was the united nations founded", 
    "id": 196
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.0glzm0h fb:rail.locomotive.locomotive_class ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Victorian Railways H class"
    ], 
    "targetFormula": "(!fb:rail.locomotive.locomotive_class fb:m.0glzm0h)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.0glzm0h fb:rail.locomotive.locomotive_class ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what class of train was heavy harry", 
    "id": 197
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x3 WHERE { { SELECT DISTINCT count(?x1) AS ?x3 WHERE { fb:en.borders_group fb:business.employer.employees ?x2 . ?x2 fb:business.employment_tenure.person ?x1 } } } LIMIT 9999", 
    "result": [
      "10"
    ], 
    "targetFormula": "(count (!fb:business.employment_tenure.person (!fb:business.employer.employees fb:en.borders_group)))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x3 WHERE { { SELECT DISTINCT count(?x1) AS ?x3 WHERE { fb:m.0mdv8 fb:business.employer.employees ?x2 . ?x2 fb:business.employment_tenure.person ?x1 } } } LIMIT 9999", 
    "utterance": "how many people does borders employ", 
    "id": 198
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.tamora_pierce fb:book.author.series_written_or_contributed_to ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Provost's Dog", 
      "Wild Magic/The Immortals", 
      "Daughter of the Lioness", 
      "The Song of the Lioness", 
      "The Circle Opens", 
      "Circle of Magic (Tamora Pierce)", 
      "Circle of Magic Universe", 
      "Protector of the Small", 
      "The Circle Opens Quartet", 
      "Protector of the Small", 
      "Beka Cooper/Provost's Dog", 
      "Circle Of Magic Quartet"
    ], 
    "targetFormula": "(!fb:book.author.series_written_or_contributed_to fb:en.tamora_pierce)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.0gm5z fb:book.author.series_written_or_contributed_to ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what series did tamora pierce write", 
    "id": 199
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { fb:m.02qvdc fb:ice_hockey.hockey_position.players ?x1 } } } LIMIT 9999", 
    "result": [
      "1367"
    ], 
    "targetFormula": "(count (!fb:ice_hockey.hockey_position.players fb:m.02qvdc))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { fb:m.02qvdc fb:ice_hockey.hockey_position.players ?x1 } } } LIMIT 9999", 
    "utterance": "how many hockey players play center", 
    "id": 200
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.ron_glass fb:people.person.place_of_birth ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Evansville"
    ], 
    "targetFormula": "(!fb:people.person.place_of_birth fb:en.ron_glass)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.03h82p fb:people.person.place_of_birth ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what is ron glass 's place of birth", 
    "id": 201
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 ?x2name WHERE { ?x1 fb:media_common.completion_of_unfinished_work.finisher fb:en.anthony_payne . FILTER (?x1 != fb:en.anthony_payne) . ?x1 fb:media_common.completion_of_unfinished_work.unfinished_work ?x2 . OPTIONAL { ?x2 fb:type.object.name ?x2name } } LIMIT 9999", 
    "result": [
      "Symphony No. 3"
    ], 
    "targetFormula": "(!fb:media_common.completion_of_unfinished_work.unfinished_work ((lambda x (fb:media_common.completion_of_unfinished_work.finisher (var x))) fb:en.anthony_payne))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 ?x2name WHERE { ?x1 fb:media_common.completion_of_unfinished_work.finisher fb:m.0cvnsb . FILTER (?x1 != fb:m.0cvnsb) . ?x1 fb:media_common.completion_of_unfinished_work.unfinished_work ?x2 . OPTIONAL { ?x2 fb:type.object.name ?x2name } } LIMIT 9999", 
    "utterance": "what works did anthony payne finish", 
    "id": 202
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:en.tokyu_tamagawa_line fb:rail.railway.length ?x1 } LIMIT 9999", 
    "result": [
      "5.6"
    ], 
    "targetFormula": "(!fb:rail.railway.length fb:en.tokyu_tamagawa_line)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.05xk19 fb:rail.railway.length ?x1 } LIMIT 9999", 
    "utterance": "how long is the tokyu tamagawa line", 
    "id": 203
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 ?x2name WHERE { ?x1 fb:exhibitions.exhibition_run.exhibition fb:en.armory_show . FILTER (?x1 != fb:en.armory_show) . ?x1 fb:exhibitions.exhibition_run.venue ?x2 . OPTIONAL { ?x2 fb:type.object.name ?x2name } } LIMIT 9999", 
    "result": [
      "Art Institute of Chicago Building", 
      "69th Regiment Armory", 
      "Copley Society of Art"
    ], 
    "targetFormula": "(!fb:exhibitions.exhibition_run.venue ((lambda x (fb:exhibitions.exhibition_run.exhibition (var x))) fb:en.armory_show))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 ?x2name WHERE { ?x1 fb:exhibitions.exhibition_run.exhibition fb:m.01_ggr . FILTER (?x1 != fb:m.01_ggr) . ?x1 fb:exhibitions.exhibition_run.venue ?x2 . OPTIONAL { ?x2 fb:type.object.name ?x2name } } LIMIT 9999", 
    "utterance": "where was the armory show exhibited", 
    "id": 204
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.tungsten fb:chemistry.chemical_element.chemical_series ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Transition metal"
    ], 
    "targetFormula": "(!fb:chemistry.chemical_element.chemical_series fb:en.tungsten)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.025sk79 fb:chemistry.chemical_element.chemical_series ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what chemical series is tungsten in", 
    "id": 205
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.apple_ii fb:computer.computer.processor ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "MOS Technology 6502"
    ], 
    "targetFormula": "(!fb:computer.computer.processor fb:en.apple_ii)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.0wxp fb:computer.computer.processor ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what processor did the apple ii use", 
    "id": 206
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.fa_cup_final_1973 fb:soccer.football_match.teams ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Sunderland A.F.C.", 
      "Leeds United A.F.C."
    ], 
    "targetFormula": "(!fb:soccer.football_match.teams fb:en.fa_cup_final_1973)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.0d4bd_ fb:soccer.football_match.teams ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "who played in the 1973 fa cup final", 
    "id": 207
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.bmw fb:automotive.company.manufacturing_plants ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Cowley Car Factory"
    ], 
    "targetFormula": "(!fb:automotive.company.manufacturing_plants fb:en.bmw)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.017yh fb:automotive.company.manufacturing_plants ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what are bmw's manufacturing plants", 
    "id": 208
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.alta_ski_area fb:skiing.ski_area.lodges ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Rustler Lodge", 
      "Goldminer's Daughter Lodge", 
      "Alta Lodge", 
      "Alta Peruvian Lodge", 
      "Alf's Restaurant", 
      "Watson Shelter", 
      "Albion Day Lodge", 
      "Snowpine Lodge"
    ], 
    "targetFormula": "(!fb:skiing.ski_area.lodges fb:en.alta_ski_area)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.03pdkw fb:skiing.ski_area.lodges ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what lodges are in the alta ski area", 
    "id": 210
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.0280hsm fb:tv.tv_program.episode_running_time ?x1 } LIMIT 9999", 
    "result": [
      "11"
    ], 
    "targetFormula": "(!fb:tv.tv_program.episode_running_time fb:m.0280hsm)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.0280hsm fb:tv.tv_program.episode_running_time ?x1 } LIMIT 9999", 
    "utterance": "how long are adventure time episodes", 
    "id": 212
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { fb:en.footwear fb:fashion.garment.more_specialized_forms ?x1 } } } LIMIT 9999", 
    "result": [
      "12"
    ], 
    "targetFormula": "(count (!fb:fashion.garment.more_specialized_forms fb:en.footwear))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { fb:m.09j5n fb:fashion.garment.more_specialized_forms ?x1 } } } LIMIT 9999", 
    "utterance": "how many kinds of footwear are there", 
    "id": 213
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 ?x2name WHERE { ?x1 fb:ice_hockey.hockey_roster_position.player fb:en.fedor_tyutin . FILTER (?x1 != fb:en.fedor_tyutin) . ?x1 fb:ice_hockey.hockey_roster_position.team ?x2 . OPTIONAL { ?x2 fb:type.object.name ?x2name } } LIMIT 9999", 
    "result": [
      "Columbus Blue Jackets"
    ], 
    "targetFormula": "(!fb:ice_hockey.hockey_roster_position.team ((lambda x (fb:ice_hockey.hockey_roster_position.player (var x))) fb:en.fedor_tyutin))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 ?x2name WHERE { ?x1 fb:ice_hockey.hockey_roster_position.player fb:m.09v904 . FILTER (?x1 != fb:m.09v904) . ?x1 fb:ice_hockey.hockey_roster_position.team ?x2 . OPTIONAL { ?x2 fb:type.object.name ?x2name } } LIMIT 9999", 
    "utterance": "for what team does fedor tyutin play", 
    "id": 214
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.sarah_jessica_parker fb:interests.hobbyist.hobbies ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Knitting"
    ], 
    "targetFormula": "(!fb:interests.hobbyist.hobbies fb:en.sarah_jessica_parker)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.0m66w fb:interests.hobbyist.hobbies ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what is sarah jessica parker's hobby", 
    "id": 215
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.ferdinand_ii_holy_roman_emperor fb:people.person.parents ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Charles II, Archduke of Austria", 
      "Maria Anna of Bavaria"
    ], 
    "targetFormula": "(!fb:people.person.parents fb:en.ferdinand_ii_holy_roman_emperor)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.013lkn fb:people.person.parents ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "who were the parents of ferdinand ii", 
    "id": 216
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { fb:en.u_army fb:military.armed_force.units ?x1 } } } LIMIT 9999", 
    "result": [
      "44"
    ], 
    "targetFormula": "(count (!fb:military.armed_force.units fb:en.u_army))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { fb:m.07wh1 fb:military.armed_force.units ?x1 } } } LIMIT 9999", 
    "utterance": "how many units does the us army have", 
    "id": 217
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { fb:en.antilles fb:geography.island_group.islands_in_group ?x1 } } } LIMIT 9999", 
    "result": [
      "133"
    ], 
    "targetFormula": "(count (!fb:geography.island_group.islands_in_group fb:en.antilles))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { fb:m.01l3lx fb:geography.island_group.islands_in_group ?x1 } } } LIMIT 9999", 
    "utterance": "how many islands are in the antilles", 
    "id": 218
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.google fb:conferences.conference_sponsor.conferences ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "FOSDEM", 
      "O'Reilly Open Source Convention", 
      "Google I/O", 
      "PyCon", 
      "GOTO", 
      "OSCON 2012"
    ], 
    "targetFormula": "(!fb:conferences.conference_sponsor.conferences fb:en.google)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.045c7b fb:conferences.conference_sponsor.conferences ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what conferences does google sponsor", 
    "id": 219
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.rolls-royce_welland fb:engineering.engine.designer ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Frank Whittle"
    ], 
    "targetFormula": "(!fb:engineering.engine.designer fb:en.rolls-royce_welland)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.05cq_9 fb:engineering.engine.designer ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "who designed the rolls-royce welland", 
    "id": 221
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 ?x2name WHERE { ?x1 fb:rail.railway_operator_relationship.railway fb:m.04rsv0 . FILTER (?x1 != fb:m.04rsv0) . ?x1 fb:rail.railway_operator_relationship.operator ?x2 . OPTIONAL { ?x2 fb:type.object.name ?x2name } } LIMIT 9999", 
    "result": [
      "Amtrak"
    ], 
    "targetFormula": "(!fb:rail.railway_operator_relationship.operator ((lambda x (fb:rail.railway_operator_relationship.railway (var x))) fb:m.04rsv0))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 ?x2name WHERE { ?x1 fb:rail.railway_operator_relationship.railway fb:m.04rsv0 . FILTER (?x1 != fb:m.04rsv0) . ?x1 fb:rail.railway_operator_relationship.operator ?x2 . OPTIONAL { ?x2 fb:type.object.name ?x2name } } LIMIT 9999", 
    "utterance": "who operates the silver star railway", 
    "id": 222
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.uss_constitution fb:boats.ship.place_built ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Boston Navy Yard"
    ], 
    "targetFormula": "(!fb:boats.ship.place_built fb:en.uss_constitution)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.07y14 fb:boats.ship.place_built ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "where was the uss constitution built", 
    "id": 223
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x3 WHERE { { SELECT DISTINCT count(?x1) AS ?x3 WHERE { ?x2 fb:award.award_honor.award_winner fb:en.danny_devito . FILTER (?x2 != fb:en.danny_devito) . ?x2 fb:award.award_honor.award ?x1 } } } LIMIT 9999", 
    "result": [
      "3"
    ], 
    "targetFormula": "(count (!fb:award.award_honor.award ((lambda x (fb:award.award_honor.award_winner (var x))) fb:en.danny_devito)))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x3 WHERE { { SELECT DISTINCT count(?x1) AS ?x3 WHERE { ?x2 fb:award.award_honor.award_winner fb:m.0q9kd . FILTER (?x2 != fb:m.0q9kd) . ?x2 fb:award.award_honor.award ?x1 } } } LIMIT 9999", 
    "utterance": "how many awards did danny devito win", 
    "id": 224
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x3 WHERE { { SELECT DISTINCT count(?x1) AS ?x3 WHERE { ?x2 fb:base.famouspets.pet_ownership.owner fb:en.john_f_kennedy . FILTER (?x2 != fb:en.john_f_kennedy) . ?x2 fb:base.famouspets.pet_ownership.pet ?x1 } } } LIMIT 9999", 
    "result": [
      "21"
    ], 
    "targetFormula": "(count (!fb:base.famouspets.pet_ownership.pet ((lambda x (fb:base.famouspets.pet_ownership.owner (var x))) fb:en.john_f_kennedy)))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x3 WHERE { { SELECT DISTINCT count(?x1) AS ?x3 WHERE { ?x2 fb:base.famouspets.pet_ownership.owner fb:m.0d3k14 . FILTER (?x2 != fb:m.0d3k14) . ?x2 fb:base.famouspets.pet_ownership.pet ?x1 } } } LIMIT 9999", 
    "utterance": "how many pets did john f kennedy own", 
    "id": 225
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 ?x2name WHERE { ?x1 fb:event.speech_or_presentation.presented_work fb:en.gettysburg_address . FILTER (?x1 != fb:en.gettysburg_address) . ?x1 fb:event.speech_or_presentation.speaker_s ?x2 . OPTIONAL { ?x2 fb:type.object.name ?x2name } } LIMIT 9999", 
    "result": [
      "Abraham Lincoln"
    ], 
    "targetFormula": "(!fb:event.speech_or_presentation.speaker_s ((lambda x (fb:event.speech_or_presentation.presented_work (var x))) fb:en.gettysburg_address))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 ?x2name WHERE { ?x1 fb:event.speech_or_presentation.presented_work fb:m.037yx . FILTER (?x1 != fb:m.037yx) . ?x1 fb:event.speech_or_presentation.speaker_s ?x2 . OPTIONAL { ?x2 fb:type.object.name ?x2name } } LIMIT 9999", 
    "utterance": "who presented the gettysburg address", 
    "id": 226
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:en.apple_i fb:computer.computer.discontinued ?x1 } LIMIT 9999", 
    "result": [
      "1977-10"
    ], 
    "targetFormula": "(!fb:computer.computer.discontinued fb:en.apple_i)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.0n_v fb:computer.computer.discontinued ?x1 } LIMIT 9999", 
    "utterance": "when did the apple i stop being sold", 
    "id": 227
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.philadelphia_phillies fb:sports.sports_team.arena_stadium ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Citizens Bank Park"
    ], 
    "targetFormula": "(!fb:sports.sports_team.arena_stadium fb:en.philadelphia_phillies)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.05xvj fb:sports.sports_team.arena_stadium ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what stadium do the phillies play in", 
    "id": 228
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { fb:en.karl_marx fb:influence.influence_node.influenced_by ?x1 } } } LIMIT 9999", 
    "result": [
      "31"
    ], 
    "targetFormula": "(count (!fb:influence.influence_node.influenced_by fb:en.karl_marx))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { fb:m.048cl fb:influence.influence_node.influenced_by ?x1 } } } LIMIT 9999", 
    "utterance": "how many people influenced karl marx", 
    "id": 229
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.manhattan_project fb:projects.project.project_focus ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Atomic bombings of Hiroshima and Nagasaki", 
      "Nuclear weapon"
    ], 
    "targetFormula": "(!fb:projects.project.project_focus fb:en.manhattan_project)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.04yp5 fb:projects.project.project_focus ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what was the manhattan project about", 
    "id": 230
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.dravidian_languages fb:language.language_family.geographic_distribution ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "India", 
      "Indian subcontinent"
    ], 
    "targetFormula": "(!fb:language.language_family.geographic_distribution fb:en.dravidian_languages)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.026kj fb:language.language_family.geographic_distribution ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "where are dravidian languages spoken", 
    "id": 231
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:en.glutamine fb:biology.amino_acid.codons ?x1 } LIMIT 9999", 
    "result": [
      "CAA", 
      "CAG"
    ], 
    "targetFormula": "(!fb:biology.amino_acid.codons fb:en.glutamine)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.0h1xy fb:biology.amino_acid.codons ?x1 } LIMIT 9999", 
    "utterance": "what are the dna codons of glutamine", 
    "id": 232
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:en.silicon fb:chemistry.chemical_element.atomic_number ?x1 } LIMIT 9999", 
    "result": [
      "14"
    ], 
    "targetFormula": "(!fb:chemistry.chemical_element.atomic_number fb:en.silicon)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.025sf80 fb:chemistry.chemical_element.atomic_number ?x1 } LIMIT 9999", 
    "utterance": "what is the atomic number of silicon", 
    "id": 233
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.sunni_islam fb:religion.religion.sacred_sites ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Jerusalem", 
      "Medina", 
      "Mecca"
    ], 
    "targetFormula": "(!fb:religion.religion.sacred_sites fb:en.sunni_islam)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.078tg fb:religion.religion.sacred_sites ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what are sacred sites in sunni islam", 
    "id": 234
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:food.beer fb:freebase.type_profile.instance_count ?x1 } LIMIT 9999", 
    "result": [], 
    "targetFormula": "(!fb:freebase.type_profile.instance_count fb:food.beer)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:food.beer fb:freebase.type_profile.instance_count ?x1 } LIMIT 9999", 
    "utterance": "how many beers are there on freebase", 
    "id": 235
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.014v3t fb:tv.tv_program.languages ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "English Language", 
      "Standard Mandarin"
    ], 
    "targetFormula": "(!fb:tv.tv_program.languages fb:m.014v3t)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.014v3t fb:tv.tv_program.languages ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what languages are spoken in firefly", 
    "id": 236
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.01vvf fb:cvg.computer_videogame.release_date ?x1 } LIMIT 9999", 
    "result": [
      "1991"
    ], 
    "targetFormula": "(!fb:cvg.computer_videogame.release_date fb:m.01vvf)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.01vvf fb:cvg.computer_videogame.release_date ?x1 } LIMIT 9999", 
    "utterance": "when was civilization first released", 
    "id": 237
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.05v47f_ fb:radio.radio_program.first_broadcast ?x1 } LIMIT 9999", 
    "result": [
      "1988"
    ], 
    "targetFormula": "(!fb:radio.radio_program.first_broadcast fb:m.05v47f_)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.05v47f_ fb:radio.radio_program.first_broadcast ?x1 } LIMIT 9999", 
    "utterance": "when was kid_s corner first broadcast", 
    "id": 238
  }
]
