[
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 ?x2name WHERE { ?x1 fb:base.popstra.fashion_choice.fashion_wearer fb:en.sarah_jessica_parker . FILTER (?x1 != fb:en.sarah_jessica_parker) . ?x1 fb:base.popstra.fashion_choice.designer ?x2 . OPTIONAL { ?x2 fb:type.object.name ?x2name } } LIMIT 9999", 
    "result": [
      "Christian Dior S.A.", 
      "Donna Karan", 
      "Alexander McQueen", 
      "Alexander Wang", 
      "L'Wren Scott"
    ], 
    "targetFormula": "(!fb:base.popstra.fashion_choice.designer ((lambda x (fb:base.popstra.fashion_choice.fashion_wearer (var x))) fb:en.sarah_jessica_parker))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 ?x2name WHERE { ?x1 fb:base.popstra.fashion_choice.fashion_wearer fb:m.0m66w . FILTER (?x1 != fb:m.0m66w) . ?x1 fb:base.popstra.fashion_choice.designer ?x2 . OPTIONAL { ?x2 fb:type.object.name ?x2name } } LIMIT 9999", 
    "utterance": "what labels does sarah jessica parker wear", 
    "id": 368
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { fb:en.ipod fb:business.consumer_product.product_line ?x1 } } } LIMIT 9999", 
    "result": [
      "0"
    ], 
    "targetFormula": "(count (!fb:business.consumer_product.product_line fb:en.ipod))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { fb:m.0mcx2 fb:business.consumer_product.product_line ?x1 } } } LIMIT 9999", 
    "utterance": "how many generations of the ipod are there", 
    "id": 369
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 ?x2name WHERE { ?x1 fb:celebrities.sexual_orientation_phase.celebrity fb:en.britney_spears . FILTER (?x1 != fb:en.britney_spears) . ?x1 fb:celebrities.sexual_orientation_phase.sexual_orientation ?x2 . OPTIONAL { ?x2 fb:type.object.name ?x2name } } LIMIT 9999", 
    "result": [
      "Heterosexuality"
    ], 
    "targetFormula": "(!fb:celebrities.sexual_orientation_phase.sexual_orientation ((lambda x (fb:celebrities.sexual_orientation_phase.celebrity (var x))) fb:en.britney_spears))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 ?x2name WHERE { ?x1 fb:celebrities.sexual_orientation_phase.celebrity fb:m.015f7 . FILTER (?x1 != fb:m.015f7) . ?x1 fb:celebrities.sexual_orientation_phase.sexual_orientation ?x2 . OPTIONAL { ?x2 fb:type.object.name ?x2name } } LIMIT 9999", 
    "utterance": "what is britney spears' sexual orientation", 
    "id": 370
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { fb:en.settlers_of_catan fb:games.game.number_of_players ?x1 . ?x1 fb:measurement_unit.integer_range.high_value ?x2 } LIMIT 9999", 
    "result": [
      "4"
    ], 
    "targetFormula": "(!fb:measurement_unit.integer_range.high_value (!fb:games.game.number_of_players fb:en.settlers_of_catan))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { fb:m.095hd fb:games.game.number_of_players ?x1 . ?x1 fb:measurement_unit.integer_range.high_value ?x2 } LIMIT 9999", 
    "utterance": "how many people can play settlers of catan", 
    "id": 371
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.chicago_bulls fb:basketball.basketball_team.head_coach ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Tom Thibodeau"
    ], 
    "targetFormula": "(!fb:basketball.basketball_team.head_coach fb:en.chicago_bulls)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.0jm74 fb:basketball.basketball_team.head_coach ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "who is the head coach of the chicago bulls", 
    "id": 372
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.navy_dept fb:military.armed_force.military_combatant ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "United Kingdom"
    ], 
    "targetFormula": "(!fb:military.armed_force.military_combatant fb:en.navy_dept)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.06hhp fb:military.armed_force.military_combatant ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what country does the royal navy belong to", 
    "id": 373
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:en.japanese_yen fb:finance.currency.currency_code ?x1 } LIMIT 9999", 
    "result": [
      "JPY"
    ], 
    "targetFormula": "(!fb:finance.currency.currency_code fb:en.japanese_yen)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.088n7 fb:finance.currency.currency_code ?x1 } LIMIT 9999", 
    "utterance": "what is currency code for the japanese yen", 
    "id": 374
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.boson fb:physics.particle_family.subclasses ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Scalar boson", 
      "Gauge boson"
    ], 
    "targetFormula": "(!fb:physics.particle_family.subclasses fb:en.boson)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.01d82 fb:physics.particle_family.subclasses ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what are the subclasses of the boson class", 
    "id": 375
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:en.canasta fb:games.playing_card_game.number_of_cards ?x1 } LIMIT 9999", 
    "result": [
      "108"
    ], 
    "targetFormula": "(!fb:games.playing_card_game.number_of_cards fb:en.canasta)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.0lytf fb:games.playing_card_game.number_of_cards ?x1 } LIMIT 9999", 
    "utterance": "how many cards do you need to play canasta", 
    "id": 376
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 ?x2name WHERE { ?x1 fb:tv.tv_network_duration.program fb:en.sesame_street . FILTER (?x1 != fb:en.sesame_street) . ?x1 fb:tv.tv_network_duration.network ?x2 . OPTIONAL { ?x2 fb:type.object.name ?x2name } } LIMIT 9999", 
    "result": [
      "Public Broadcasting Service", 
      "PBS Kids Sprout", 
      "Noggin", 
      "National Educational Television"
    ], 
    "targetFormula": "(!fb:tv.tv_network_duration.network ((lambda x (fb:tv.tv_network_duration.program (var x))) fb:en.sesame_street))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 ?x2name WHERE { ?x1 fb:tv.tv_network_duration.program fb:m.0cwrr . FILTER (?x1 != fb:m.0cwrr) . ?x1 fb:tv.tv_network_duration.network ?x2 . OPTIONAL { ?x2 fb:type.object.name ?x2name } } LIMIT 9999", 
    "utterance": "what was sesame street 's original network", 
    "id": 377
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { fb:en.breast_cancer fb:medicine.disease.stages ?x1 } } } LIMIT 9999", 
    "result": [
      "5"
    ], 
    "targetFormula": "(count (!fb:medicine.disease.stages fb:en.breast_cancer))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { fb:m.0j8hd fb:medicine.disease.stages ?x1 } } } LIMIT 9999", 
    "utterance": "how many stages of breast cancer are there", 
    "id": 378
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:en.new_york_giants fb:common.topic.alias ?x1 } LIMIT 9999", 
    "result": [
      "Big Blue", 
      "G-Men", 
      "Jints"
    ], 
    "targetFormula": "(!fb:common.topic.alias fb:en.new_york_giants)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.05gg4 fb:common.topic.alias ?x1 } LIMIT 9999", 
    "utterance": "what are the new york giants also known as", 
    "id": 379
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:en.monopoly_boardgame fb:games.game.minimum_age_years ?x1 } LIMIT 9999", 
    "result": [
      "8"
    ], 
    "targetFormula": "(!fb:games.game.minimum_age_years fb:en.monopoly_boardgame)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.04zk9 fb:games.game.minimum_age_years ?x1 } LIMIT 9999", 
    "utterance": "how old do you have to be to play monopoly", 
    "id": 380
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { fb:en.boston_herald fb:book.periodical.first_issue_date ?x1 . ?x1 fb:book.periodical_publication_date.date ?x2 } LIMIT 9999", 
    "result": [
      "1982"
    ], 
    "targetFormula": "(!fb:book.periodical_publication_date.date (!fb:book.periodical.first_issue_date fb:en.boston_herald))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { fb:m.01bsf fb:book.periodical.first_issue_date ?x1 . ?x1 fb:book.periodical_publication_date.date ?x2 } LIMIT 9999", 
    "utterance": "when was the boston herald first published", 
    "id": 381
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.quartzite fb:geology.rock_type.formations ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Tuscarora Formation"
    ], 
    "targetFormula": "(!fb:geology.rock_type.formations fb:en.quartzite)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.029zr1 fb:geology.rock_type.formations ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what rock formations are made of quartzite", 
    "id": 382
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:en.mexican_peso fb:finance.currency.currency_code ?x1 } LIMIT 9999", 
    "result": [
      "MXN"
    ], 
    "targetFormula": "(!fb:finance.currency.currency_code fb:en.mexican_peso)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.012ts8 fb:finance.currency.currency_code ?x1 } LIMIT 9999", 
    "utterance": "what is currency code for the mexican peso", 
    "id": 383
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 ?x2name WHERE { ?x1 fb:celebrities.substance_abuse_problem.celebrity fb:en.robert_downey_jr . FILTER (?x1 != fb:en.robert_downey_jr) . ?x1 fb:celebrities.substance_abuse_problem.substance ?x2 . OPTIONAL { ?x2 fb:type.object.name ?x2name } } LIMIT 9999", 
    "result": [
      "Heroin", 
      "Methamphetamine", 
      "Diazepam", 
      "Alcoholic beverage", 
      "Cocaine"
    ], 
    "targetFormula": "(!fb:celebrities.substance_abuse_problem.substance ((lambda x (fb:celebrities.substance_abuse_problem.celebrity (var x))) fb:en.robert_downey_jr))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 ?x2name WHERE { ?x1 fb:celebrities.substance_abuse_problem.celebrity fb:m.016z2j . FILTER (?x1 != fb:m.016z2j) . ?x1 fb:celebrities.substance_abuse_problem.substance ?x2 . OPTIONAL { ?x2 fb:type.object.name ?x2name } } LIMIT 9999", 
    "utterance": "what substancs has robert downey jr abused", 
    "id": 384
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.engineering fb:education.field_of_study.subdisciplines ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Automotive engineering", 
      "Civil Engineering", 
      "Chemical Engineering", 
      "Electrical engineering", 
      "Mechanical Engineering", 
      "Nanotechnology", 
      "Nuclear engineering", 
      "Industrial biotechnology", 
      "Plastics engineering", 
      "Materials Engineering", 
      "Environmental engineering", 
      "Environmental biotechnology", 
      "Medical Engineering"
    ], 
    "targetFormula": "(!fb:education.field_of_study.subdisciplines fb:en.engineering)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.02ky346 fb:education.field_of_study.subdisciplines ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what are the subdisciplines of engineering", 
    "id": 385
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.lightnin_hopkins fb:music.group_member.instruments_played ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Guitar"
    ], 
    "targetFormula": "(!fb:music.group_member.instruments_played fb:en.lightnin_hopkins)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.01rlq_ fb:music.group_member.instruments_played ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what instrument did lightnin' hopkins play", 
    "id": 386
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 ?x2name WHERE { ?x1 fb:finance.exchange_rate.source_of_exchange fb:en.danish_krone . FILTER (?x1 != fb:en.danish_krone) . ?x1 fb:finance.exchange_rate.target_of_exchange ?x2 . OPTIONAL { ?x2 fb:type.object.name ?x2name } } LIMIT 9999", 
    "result": [
      "Euro", 
      "United States dollar", 
      "New Zealand dollar", 
      "UK \u00a3", 
      "Australian dollar", 
      "Canadian dollar", 
      "Singapore dollar", 
      "Brazilian real", 
      "Malaysian ringgit", 
      "Bulgarian lev", 
      "Swiss franc", 
      "Revaluation of the Turkish Lira"
    ], 
    "targetFormula": "(!fb:finance.exchange_rate.target_of_exchange ((lambda x (fb:finance.exchange_rate.source_of_exchange (var x))) fb:en.danish_krone))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 ?x2name WHERE { ?x1 fb:finance.exchange_rate.source_of_exchange fb:m.01j9nc . FILTER (?x1 != fb:m.01j9nc) . ?x1 fb:finance.exchange_rate.target_of_exchange ?x2 . OPTIONAL { ?x2 fb:type.object.name ?x2name } } LIMIT 9999", 
    "utterance": "how much danish kroner is a us dollar worth", 
    "id": 387
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.02zl93 fb:boats.ship.hull_material ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Iron"
    ], 
    "targetFormula": "(!fb:boats.ship.hull_material fb:m.02zl93)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.02zl93 fb:boats.ship.hull_material ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what is the hull made of on the james craig", 
    "id": 388
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:en.a_prairie_home_companion fb:radio.radio_program.first_broadcast ?x1 } LIMIT 9999", 
    "result": [
      "1974-07-06"
    ], 
    "targetFormula": "(!fb:radio.radio_program.first_broadcast fb:en.a_prairie_home_companion)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.0gly1 fb:radio.radio_program.first_broadcast ?x1 } LIMIT 9999", 
    "utterance": "when did a prairie home companion first air", 
    "id": 389
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.san_francisco fb:travel.travel_destination.guidebooks ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "San Francisco City Guide", 
      "Lonely Planet: California"
    ], 
    "targetFormula": "(!fb:travel.travel_destination.guidebooks fb:en.san_francisco)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.0d6lp fb:travel.travel_destination.guidebooks ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what guidebooks are there for san francisco", 
    "id": 390
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 ?x2name WHERE { ?x1 fb:cvg.game_performance.game fb:en.sonic_rush . FILTER (?x1 != fb:en.sonic_rush) . ?x1 fb:cvg.game_performance.character ?x2 . OPTIONAL { ?x2 fb:type.object.name ?x2name } } LIMIT 9999", 
    "result": [
      "Cream the Rabbit", 
      "Vanilla the Rabbit", 
      "Knuckles the Echidna", 
      "Miles \"Tails\" Prower", 
      "Amy Rose", 
      "Super Sonic", 
      "Sonic the Hedgehog", 
      "Egg Pawn", 
      "Eggman Nega", 
      "Dr. Eggman", 
      "Burning Blaze", 
      "Blaze the Cat"
    ], 
    "targetFormula": "(!fb:cvg.game_performance.character ((lambda x (fb:cvg.game_performance.game (var x))) fb:en.sonic_rush))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 ?x2name WHERE { ?x1 fb:cvg.game_performance.game fb:m.04mt7r . FILTER (?x1 != fb:m.04mt7r) . ?x1 fb:cvg.game_performance.character ?x2 . OPTIONAL { ?x2 fb:type.object.name ?x2name } } LIMIT 9999", 
    "utterance": "which characters are playable in sonic rush", 
    "id": 391
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { fb:en.the_sims fb:cvg.computer_videogame.expansions ?x1 } } } LIMIT 9999", 
    "result": [
      "7"
    ], 
    "targetFormula": "(count (!fb:cvg.computer_videogame.expansions fb:en.the_sims))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { fb:m.07hm9 fb:cvg.computer_videogame.expansions ?x1 } } } LIMIT 9999", 
    "utterance": "how many expansion packs does the sims have", 
    "id": 394
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { ?x1 fb:media_common.literary_genre.books_in_this_genre fb:en.the_hound_of_the_baskervilles . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Novel", 
      "Mystery", 
      "Crime Fiction", 
      "Detective fiction"
    ], 
    "targetFormula": "(fb:media_common.literary_genre.books_in_this_genre fb:en.the_hound_of_the_baskervilles)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { ?x1 fb:media_common.literary_genre.books_in_this_genre fb:m.07g52 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what genre is the hound of the baskervilles", 
    "id": 395
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.mauritania fb:location.country.official_language ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Arabic Language"
    ], 
    "targetFormula": "(!fb:location.country.official_language fb:en.mauritania)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.04vjh fb:location.country.official_language ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what is the official language of mauritania", 
    "id": 396
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { fb:en.sesame_street fb:tv.tv_program.seasons ?x1 } } } LIMIT 9999", 
    "result": [
      "44"
    ], 
    "targetFormula": "(count (!fb:tv.tv_program.seasons fb:en.sesame_street))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { fb:m.0cwrr fb:tv.tv_program.seasons ?x1 } } } LIMIT 9999", 
    "utterance": "how many seasons of sesame street are there", 
    "id": 397
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 ?x2name WHERE { ?x1 fb:cvg.game_performance.game fb:en.halo_reach . FILTER (?x1 != fb:en.halo_reach) . ?x1 fb:cvg.game_performance.performance_type fb:m.02nsjvf . FILTER (?x1 != fb:m.02nsjvf) . ?x1 fb:cvg.game_performance.voice_actor fb:en.nathan_fillion . FILTER (?x1 != fb:en.nathan_fillion) . ?x1 fb:cvg.game_performance.character ?x2 . OPTIONAL { ?x2 fb:type.object.name ?x2name } } LIMIT 9999", 
    "result": [
      "Sergeant Edward Buck"
    ], 
    "targetFormula": "(!fb:cvg.game_performance.character (and (and ((lambda x (fb:cvg.game_performance.game (var x))) fb:en.halo_reach) ((lambda x (fb:cvg.game_performance.performance_type (var x))) fb:m.02nsjvf)) ((lambda x (fb:cvg.game_performance.voice_actor (var x))) fb:en.nathan_fillion)))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 ?x2name WHERE { ?x1 fb:cvg.game_performance.game fb:m.064p9fm . FILTER (?x1 != fb:m.064p9fm) . ?x1 fb:cvg.game_performance.performance_type fb:m.02nsjvf . FILTER (?x1 != fb:m.02nsjvf) . ?x1 fb:cvg.game_performance.voice_actor fb:m.02s_qz . FILTER (?x1 != fb:m.02s_qz) . ?x1 fb:cvg.game_performance.character ?x2 . OPTIONAL { ?x2 fb:type.object.name ?x2name } } LIMIT 9999", 
    "utterance": "who did nathan fillion voice in halo: reach", 
    "id": 398
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.the_nutty_professor_1996 fb:film.film.directed_by ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Tom Shadyac"
    ], 
    "targetFormula": "(!fb:film.film.directed_by fb:en.the_nutty_professor_1996)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.0d87hc fb:film.film.directed_by ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "who was the director of the nutty professor", 
    "id": 399
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.university_of_lima fb:education.educational_institution.school_type ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Private university"
    ], 
    "targetFormula": "(!fb:education.educational_institution.school_type fb:en.university_of_lima)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.06978b fb:education.educational_institution.school_type ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "is the university of lima public or private", 
    "id": 400
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 ?x2name WHERE { ?x1 fb:ice_hockey.hockey_roster_position.team fb:en.san_jose_sharks . FILTER (?x1 != fb:en.san_jose_sharks) . ?x1 fb:ice_hockey.hockey_roster_position.player ?x2 . OPTIONAL { ?x2 fb:type.object.name ?x2name } } LIMIT 9999", 
    "result": [
      "Logan Couture", 
      "Joe Thornton", 
      "Patrick Marleau", 
      "Brad Stuart", 
      "Alex Stalock", 
      "Jason Demers", 
      "James Sheppard", 
      "Marc-\u00c9douard Vlasic", 
      "Andrew Desjardins", 
      "Bracken Kearns", 
      "Matt Irwin", 
      "Dan Boyle", 
      "Brent Burns", 
      "TJ Galiardi", 
      "Nick Petrecki", 
      "Scott Gomez", 
      "Adam Burish", 
      "Joe Pavelski", 
      "Thomas Greiss", 
      "Tim Kennedy", 
      "Raffi Torres", 
      "Martin Havl\u00e1t", 
      "Antti Niemi", 
      "Tommy Wingels", 
      "Justin Braun"
    ], 
    "targetFormula": "(!fb:ice_hockey.hockey_roster_position.player ((lambda x (fb:ice_hockey.hockey_roster_position.team (var x))) fb:en.san_jose_sharks))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 ?x2name WHERE { ?x1 fb:ice_hockey.hockey_roster_position.team fb:m.0jnrk . FILTER (?x1 != fb:m.0jnrk) . ?x1 fb:ice_hockey.hockey_roster_position.player ?x2 . OPTIONAL { ?x2 fb:type.object.name ?x2name } } LIMIT 9999", 
    "utterance": "who currently plays for the san jose sharks", 
    "id": 401
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:en.swedish_krona fb:finance.currency.currency_code ?x1 } LIMIT 9999", 
    "result": [
      "SEK"
    ], 
    "targetFormula": "(!fb:finance.currency.currency_code fb:en.swedish_krona)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.0485n fb:finance.currency.currency_code ?x1 } LIMIT 9999", 
    "utterance": "what is currency code for the swedish krona", 
    "id": 403
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { fb:en.frank_sinatra fb:base.academyawards.host_of_oscar_show.oscar_show_hosted ?x1 } } } LIMIT 9999", 
    "result": [
      "2"
    ], 
    "targetFormula": "(count (!fb:base.academyawards.host_of_oscar_show.oscar_show_hosted fb:en.frank_sinatra))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { fb:m.02_fj fb:base.academyawards.host_of_oscar_show.oscar_show_hosted ?x1 } } } LIMIT 9999", 
    "utterance": "how many oscar shows did frank sinatra host", 
    "id": 404
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { ?x1 fb:location.location.containedby fb:en.north_america } } } LIMIT 9999", 
    "result": [
      "1299"
    ], 
    "targetFormula": "(count (fb:location.location.containedby fb:en.north_america))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { ?x1 fb:location.location.containedby fb:m.059g4 } } } LIMIT 9999", 
    "utterance": "how many countries are within north america", 
    "id": 405
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { fb:en.wal-mart fb:business.business_operation.industry ?x1 } } } LIMIT 9999", 
    "result": [
      "3"
    ], 
    "targetFormula": "(count (!fb:business.business_operation.industry fb:en.wal-mart))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { fb:m.0841v fb:business.business_operation.industry ?x1 } } } LIMIT 9999", 
    "utterance": "how many industries does walmart consist of", 
    "id": 406
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { fb:en.the_washington_post fb:book.periodical.frequency_or_issues_per_year ?x1 . ?x1 fb:book.periodical_frequency.issues_per_year ?x2 } LIMIT 9999", 
    "result": [], 
    "targetFormula": "(!fb:book.periodical_frequency.issues_per_year (!fb:book.periodical.frequency_or_issues_per_year fb:en.the_washington_post))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { fb:m.0px38 fb:book.periodical.frequency_or_issues_per_year ?x1 . ?x1 fb:book.periodical_frequency.issues_per_year ?x2 } LIMIT 9999", 
    "utterance": "how often does the washington post come out", 
    "id": 407
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.joe_girardi fb:baseball.baseball_manager.current_team_managed ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "New York Yankees"
    ], 
    "targetFormula": "(!fb:baseball.baseball_manager.current_team_managed fb:en.joe_girardi)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.06cjhk fb:baseball.baseball_manager.current_team_managed ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what team does joe girardi currently manage", 
    "id": 408
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { fb:en.documentary fb:media_common.netflix_genre.titles ?x1 } } } LIMIT 9999", 
    "result": [
      "7000"
    ], 
    "targetFormula": "(count (!fb:media_common.netflix_genre.titles fb:en.documentary))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { fb:m.0jtdp fb:media_common.netflix_genre.titles ?x1 } } } LIMIT 9999", 
    "utterance": "how many documentaries are there on netflix", 
    "id": 409
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.mississippi_river fb:geography.river.origin ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Lake Itasca"
    ], 
    "targetFormula": "(!fb:geography.river.origin fb:en.mississippi_river)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.04yf_ fb:geography.river.origin ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what is the origin of the mississippi river", 
    "id": 410
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { ?x1 fb:film.film.subjects fb:en.apollo_11 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "The Dish", 
      "Fly Me to the Moon"
    ], 
    "targetFormula": "(fb:film.film.subjects fb:en.apollo_11)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { ?x1 fb:film.film.subjects fb:m.0hsp . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what are some films on the apollo 11 mission", 
    "id": 411
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:en.panasonic_dx3000 fb:bicycles.bicycle_model.speeds ?x1 } LIMIT 9999", 
    "result": [
      "18"
    ], 
    "targetFormula": "(!fb:bicycles.bicycle_model.speeds fb:en.panasonic_dx3000)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.05_b6fj fb:bicycles.bicycle_model.speeds ?x1 } LIMIT 9999", 
    "utterance": "how many speeds does a panasonic dx3000 have", 
    "id": 412
  }
]
