[
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.british_rail_class_52 fb:rail.locomotive_class.locomotives_of_this_class ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Western Leviathan", 
      "Western Musketeer", 
      "Western Huntsman", 
      "Western Empress", 
      "Western Advocate", 
      "Western Invader", 
      "Western Ruler", 
      "Western Ambassador", 
      "Western Lancer", 
      "Western Hussar", 
      "Western Legionnaire", 
      "Western Enterprise", 
      "Western Pathfinder", 
      "Western Explorer", 
      "Western Pioneer", 
      "Western Crusader", 
      "Western Venturer", 
      "Western Stalwart", 
      "Western Talisman", 
      "Western Harrier", 
      "Western Campaigner", 
      "Western Thunderer", 
      "Western Firebrand", 
      "Western Ranger", 
      "Western Champion", 
      "Western Gladiator", 
      "Western Warrior", 
      "Western Buccaneer", 
      "Western Challenger", 
      "Western Hero", 
      "Western Cavalier", 
      "Western Sentinel", 
      "Western Fusilier", 
      "Western Guardsman", 
      "Western Centurion", 
      "Western Rifleman", 
      "Western Trooper", 
      "Western Yeoman", 
      "Western Emperor", 
      "Western Sovereign", 
      "Western King", 
      "Western Queen", 
      "Western Prince", 
      "Western Princess", 
      "Western Duke", 
      "Western Duchess", 
      "Western Viscount", 
      "Western Marquis", 
      "Western Lady", 
      "Western Monarch", 
      "Western Patriarch", 
      "Western Governor", 
      "Western Sultan", 
      "Western Chieftain", 
      "Western Nobleman", 
      "Western Dominion", 
      "Western Envoy", 
      "Western Courier", 
      "Western Monitor", 
      "Western Regent", 
      "Western Consort", 
      "Western Prefect", 
      "Western Druid", 
      "Western Reliance", 
      "Western Vanguard", 
      "Western Gauntlet", 
      "Western Renown", 
      "Western Glory", 
      "Western Bulwark", 
      "Western Viceroy", 
      "Western Marksman", 
      "Western Lord", 
      "Western Dragoon", 
      "Western Empire"
    ], 
    "targetFormula": "(!fb:rail.locomotive_class.locomotives_of_this_class fb:en.british_rail_class_52)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.02knn1 fb:rail.locomotive_class.locomotives_of_this_class ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what are some british locomotive class 52 trains", 
    "id": 494
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.lowell_observatory fb:astronomy.astronomical_observatory.telescope_s ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Alvan Clark Telescope"
    ], 
    "targetFormula": "(!fb:astronomy.astronomical_observatory.telescope_s fb:en.lowell_observatory)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.0kyyk fb:astronomy.astronomical_observatory.telescope_s ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what telescopes does the lowell observatory have", 
    "id": 495
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.pittsburgh_steelers fb:american_football.football_team.current_head_coach ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Mike Tomlin"
    ], 
    "targetFormula": "(!fb:american_football.football_team.current_head_coach fb:en.pittsburgh_steelers)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.05tfm fb:american_football.football_team.current_head_coach ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "who is the head coach of the pittsburgh steelers", 
    "id": 496
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { fb:en.prostate_cancer fb:common.topic.alias ?x1 } } } LIMIT 9999", 
    "result": [
      "5"
    ], 
    "targetFormula": "(count (!fb:common.topic.alias fb:en.prostate_cancer))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { fb:m.0m32h fb:common.topic.alias ?x1 } } } LIMIT 9999", 
    "utterance": "how many other names is prostate cancer known as", 
    "id": 497
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { fb:en.metamorphic_rock fb:geology.rock_type.sub_types ?x1 } } } LIMIT 9999", 
    "result": [
      "22"
    ], 
    "targetFormula": "(count (!fb:geology.rock_type.sub_types fb:en.metamorphic_rock))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { fb:m.0c3c0 fb:geology.rock_type.sub_types ?x1 } } } LIMIT 9999", 
    "utterance": "how many sub-types of metamorphic rock are there", 
    "id": 498
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:en.lux_radio_theater fb:radio.radio_program.final_broadcast ?x1 } LIMIT 9999", 
    "result": [
      "1955-06-07"
    ], 
    "targetFormula": "(!fb:radio.radio_program.final_broadcast fb:en.lux_radio_theater)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.050jm8 fb:radio.radio_program.final_broadcast ?x1 } LIMIT 9999", 
    "utterance": "what was the final air date of lux radio theater", 
    "id": 499
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 ?x2name WHERE { ?x1 fb:book.periodical_publisher_period.periodical fb:en.journal_of_abnormal_psychology . FILTER (?x1 != fb:en.journal_of_abnormal_psychology) . ?x1 fb:book.periodical_publisher_period.publisher ?x2 . OPTIONAL { ?x2 fb:type.object.name ?x2name } } LIMIT 9999", 
    "result": [
      "American Psychological Association"
    ], 
    "targetFormula": "(!fb:book.periodical_publisher_period.publisher ( (lambda x (fb:book.periodical_publisher_period.periodical (var x))) fb:en.journal_of_abnormal_psychology))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 ?x2name WHERE { ?x1 fb:book.periodical_publisher_period.periodical fb:m.0285mbn . FILTER (?x1 != fb:m.0285mbn) . ?x1 fb:book.periodical_publisher_period.publisher ?x2 . OPTIONAL { ?x2 fb:type.object.name ?x2name } } LIMIT 9999", 
    "utterance": "who publishes the journal of abnormal psychology", 
    "id": 500
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.the_nutty_professor_1996 fb:film.film.written_by ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Tom Shadyac", 
      "Steve Oedekerk", 
      "David Sheffield", 
      "Barry W. Blaustein"
    ], 
    "targetFormula": "(!fb:film.film.written_by fb:en.the_nutty_professor_1996)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.0d87hc fb:film.film.written_by ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "who is the screenplay for the nutty professor by", 
    "id": 501
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { fb:en.nathanael_herreshoff fb:boats.ship_designer.boats_designed ?x1 } } } LIMIT 9999", 
    "result": [
      "5"
    ], 
    "targetFormula": "(count (!fb:boats.ship_designer.boats_designed fb:en.nathanael_herreshoff))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { fb:m.07cgny fb:boats.ship_designer.boats_designed ?x1 } } } LIMIT 9999", 
    "utterance": "how many ships has nathanael herreshoff designed", 
    "id": 502
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { fb:en.socrates fb:influence.influence_node.influenced ?x1 } } } LIMIT 9999", 
    "result": [
      "20"
    ], 
    "targetFormula": "(count (!fb:influence.influence_node.influenced fb:en.socrates))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { fb:m.06mrq fb:influence.influence_node.influenced ?x1 } } } LIMIT 9999", 
    "utterance": "how many people have been influenced by socrates", 
    "id": 503
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.4_cylinder fb:automotive.engine.fuels_used ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Gasoline", 
      "Diesel fuel"
    ], 
    "targetFormula": "(!fb:automotive.engine.fuels_used fb:en.4_cylinder)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.03n8n29 fb:automotive.engine.fuels_used ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what types of fuel does a 4 cylinder engine take", 
    "id": 504
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x3 WHERE { { SELECT DISTINCT count(?x1) AS ?x3 WHERE { ?x2 fb:award.award_nomination.award_nominee fb:en.danny_devito . FILTER (?x2 != fb:en.danny_devito) . ?x2 fb:award.award_nomination.award ?x1 } } } LIMIT 9999", 
    "result": [
      "32"
    ], 
    "targetFormula": "(count (!fb:award.award_nomination.award ((lambda x (fb:award.award_nomination.award_nominee (var x))) fb:en.danny_devito)))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x3 WHERE { { SELECT DISTINCT count(?x1) AS ?x3 WHERE { ?x2 fb:award.award_nomination.award_nominee fb:m.0q9kd . FILTER (?x2 != fb:m.0q9kd) . ?x2 fb:award.award_nomination.award ?x1 } } } LIMIT 9999", 
    "utterance": "how many award nominations did danny devito have", 
    "id": 505
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.internal_combustion_engine fb:engineering.engine.energy_source ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [], 
    "targetFormula": "(!fb:engineering.engine.energy_source fb:en.internal_combustion_engine)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.03tpm fb:engineering.engine.energy_source ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what fuel does an internal combustion engine use", 
    "id": 506
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { fb:en.africa fb:base.dinosaur.dinosaur_location.dinosaur_s ?x1 } } } LIMIT 9999", 
    "result": [
      "67"
    ], 
    "targetFormula": "(count (!fb:base.dinosaur.dinosaur_location.dinosaur_s fb:en.africa))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { fb:m.0dg3n1 fb:base.dinosaur.dinosaur_location.dinosaur_s ?x1 } } } LIMIT 9999", 
    "utterance": "how many types of dinosaurs were there in africa", 
    "id": 507
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x3 WHERE { FILTER (xsd:dateTime(?x2) >= xsd:dateTime(\"2000\"^^xsd:datetime)) . FILTER (xsd:dateTime(?x2) < xsd:dateTime(\"2001\"^^xsd:datetime)) . ?x1 fb:award.ranking.year ?x2 . FILTER (?x1 != \"2000\"^^xsd:datetime) . ?x1 fb:award.ranking.list fb:en.fortune_500 . FILTER (?x1 != fb:en.fortune_500) . ?x1 fb:award.ranking.item fb:en.monsanto . FILTER (?x1 != fb:en.monsanto) . ?x1 fb:award.ranking.rank ?x3 } LIMIT 9999", 
    "result": [
      "54", 
      "70"
    ], 
    "targetFormula": "(!fb:award.ranking.rank (and (and ((lambda x (fb:award.ranking.year (var x))) (date 2000 -1 -1)) ((lambda x (fb:award.ranking.list (var x))) fb:en.fortune_500)) ((lambda x (fb:award.ranking.item (var x))) fb:en.monsanto)))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x3 WHERE { FILTER (xsd:dateTime(?x2) >= xsd:dateTime(\"2000\"^^xsd:datetime)) . FILTER (xsd:dateTime(?x2) < xsd:dateTime(\"2001\"^^xsd:datetime)) . ?x1 fb:award.ranking.year ?x2 . FILTER (?x1 != \"2000\"^^xsd:datetime) . ?x1 fb:award.ranking.list fb:m.01pd60 . FILTER (?x1 != fb:m.01pd60) . ?x1 fb:award.ranking.item fb:m.0n8m6 . FILTER (?x1 != fb:m.0n8m6) . ?x1 fb:award.ranking.rank ?x3 } LIMIT 9999", 
    "utterance": "where did monsanto rank on the forune 500 in 2000", 
    "id": 509
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { ?x1 fb:fashion.designer_label_association.designer fb:en.martin_margiela . FILTER (?x1 != fb:en.martin_margiela) . ?x1 fb:fashion.designer_label_association.label fb:m.06dr8q . FILTER (?x1 != fb:m.06dr8q) . ?x1 fb:fashion.designer_label_association.from_date ?x2 } LIMIT 9999", 
    "result": [
      "1997"
    ], 
    "targetFormula": "(!fb:fashion.designer_label_association.from_date (and ((lambda x (fb:fashion.designer_label_association.designer (var x))) fb:en.martin_margiela) ((lambda x (fb:fashion.designer_label_association.label (var x))) fb:m.06dr8q)))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { ?x1 fb:fashion.designer_label_association.designer fb:m.0fhhnk . FILTER (?x1 != fb:m.0fhhnk) . ?x1 fb:fashion.designer_label_association.label fb:m.06dr8q . FILTER (?x1 != fb:m.06dr8q) . ?x1 fb:fashion.designer_label_association.from_date ?x2 } LIMIT 9999", 
    "utterance": "when did martin margiela start designing for herm", 
    "id": 510
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x3 ?x3name WHERE { FILTER (xsd:dateTime(?x2) >= xsd:dateTime(\"2004\"^^xsd:datetime)) . FILTER (xsd:dateTime(?x2) < xsd:dateTime(\"2005\"^^xsd:datetime)) . ?x1 fb:soccer.football_team_management_tenure.to ?x2 . FILTER (?x1 != \"2004\"^^xsd:datetime) . ?x1 fb:soccer.football_team_management_tenure.team fb:en.liverpool_fc . FILTER (?x1 != fb:en.liverpool_fc) . ?x1 fb:soccer.football_team_management_tenure.manager ?x3 . OPTIONAL { ?x3 fb:type.object.name ?x3name } } LIMIT 9999", 
    "result": [
      "G\u00e9rard Houllier"
    ], 
    "targetFormula": "(!fb:soccer.football_team_management_tenure.manager (and ((lambda x (fb:soccer.football_team_management_tenure.to (var x))) (date 2004 -1 -1)) ((lambda x (fb:soccer.football_team_management_tenure.team (var x))) fb:en.liverpool_fc)))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x3 ?x3name WHERE { FILTER (xsd:dateTime(?x2) >= xsd:dateTime(\"2004\"^^xsd:datetime)) . FILTER (xsd:dateTime(?x2) < xsd:dateTime(\"2005\"^^xsd:datetime)) . ?x1 fb:soccer.football_team_management_tenure.to ?x2 . FILTER (?x1 != \"2004\"^^xsd:datetime) . ?x1 fb:soccer.football_team_management_tenure.team fb:m.04ltf . FILTER (?x1 != fb:m.04ltf) . ?x1 fb:soccer.football_team_management_tenure.manager ?x3 . OPTIONAL { ?x3 fb:type.object.name ?x3name } } LIMIT 9999", 
    "utterance": "who managed liverpool f.c. from 2004 to june 2010", 
    "id": 511
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 ?x2name WHERE { ?x1 fb:tv.tv_network_duration.program fb:en.gilligans_island . FILTER (?x1 != fb:en.gilligans_island) . ?x1 fb:tv.tv_network_duration.network ?x2 . OPTIONAL { ?x2 fb:type.object.name ?x2name } } LIMIT 9999", 
    "result": [
      "CBS"
    ], 
    "targetFormula": "(!fb:tv.tv_network_duration.network ((lambda x (fb:tv.tv_network_duration.program (var x))) fb:en.gilligans_island))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 ?x2name WHERE { ?x1 fb:tv.tv_network_duration.program fb:m.0m0sm . FILTER (?x1 != fb:m.0m0sm) . ?x1 fb:tv.tv_network_duration.network ?x2 . OPTIONAL { ?x2 fb:type.object.name ?x2name } } LIMIT 9999", 
    "utterance": "on what network was gilligan_s island first aired", 
    "id": 512
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { fb:en.blogtalkradio fb:broadcast.distributor.distributes ?x1 } } } LIMIT 9999", 
    "result": [
      "16"
    ], 
    "targetFormula": "(count (!fb:broadcast.distributor.distributes fb:en.blogtalkradio))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { fb:m.02641q0 fb:broadcast.distributor.distributes ?x1 } } } LIMIT 9999", 
    "utterance": "how many broadcasts does blogtalkradio distribute", 
    "id": 513
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:en.sean_miller_1968 fb:basketball.basketball_coach.season_losses ?x1 } LIMIT 9999", 
    "result": [
      "47"
    ], 
    "targetFormula": "(!fb:basketball.basketball_coach.season_losses fb:en.sean_miller_1968)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.02qwtlq fb:basketball.basketball_coach.season_losses ?x1 } LIMIT 9999", 
    "utterance": "how many losses has sean miller had in his career", 
    "id": 514
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.iphone fb:computer.computing_platform.file_formats_supported ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "MP3", 
      "JPEG", 
      "Portable Network Graphics", 
      "Portable Document Format", 
      "Advanced Audio Coding", 
      "H.264/MPEG-4 AVC", 
      "Iii"
    ], 
    "targetFormula": "(!fb:computer.computing_platform.file_formats_supported fb:en.iphone)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.027lnzs fb:computer.computing_platform.file_formats_supported ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what are the file formats supported by the iphone", 
    "id": 516
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x3 WHERE { { SELECT DISTINCT count(?x1) AS ?x3 WHERE { ?x2 fb:law.judicial_tenure.court fb:en.high_court_of_justice . FILTER (?x2 != fb:en.high_court_of_justice) . ?x2 fb:law.judicial_tenure.judge ?x1 } } } LIMIT 9999", 
    "result": [
      "10"
    ], 
    "targetFormula": "(count (!fb:law.judicial_tenure.judge ((lambda x (fb:law.judicial_tenure.court (var x))) fb:en.high_court_of_justice)))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x3 WHERE { { SELECT DISTINCT count(?x1) AS ?x3 WHERE { ?x2 fb:law.judicial_tenure.court fb:m.02rc3p . FILTER (?x2 != fb:m.02rc3p) . ?x2 fb:law.judicial_tenure.judge ?x1 } } } LIMIT 9999", 
    "utterance": "how many judges has the high court of justice had", 
    "id": 517
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 ?x2name WHERE { ?x1 fb:opera.opera_character_voice.opera fb:en.tristan_und_isolde . FILTER (?x1 != fb:en.tristan_und_isolde) . ?x1 fb:opera.opera_character_voice.voice fb:en.crystal_clear_soprano . FILTER (?x1 != fb:en.crystal_clear_soprano) . ?x1 fb:opera.opera_character_voice.character ?x2 . OPTIONAL { ?x2 fb:type.object.name ?x2name } } LIMIT 9999", 
    "result": [
      "Iseult", 
      "Brangane"
    ], 
    "targetFormula": "(!fb:opera.opera_character_voice.character (and ((lambda x (fb:opera.opera_character_voice.opera (var x))) fb:en.tristan_und_isolde) ((lambda x (fb:opera.opera_character_voice.voice (var x))) fb:en.crystal_clear_soprano)))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 ?x2name WHERE { ?x1 fb:opera.opera_character_voice.opera fb:m.09jh5 . FILTER (?x1 != fb:m.09jh5) . ?x1 fb:opera.opera_character_voice.voice fb:m.0j210 . FILTER (?x1 != fb:m.0j210) . ?x1 fb:opera.opera_character_voice.character ?x2 . OPTIONAL { ?x2 fb:type.object.name ?x2name } } LIMIT 9999", 
    "utterance": "what characters sing soprano in tristan and isolde", 
    "id": 518
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:en.haunted_mansion fb:amusement_parks.ride.duration ?x1 } LIMIT 9999", 
    "result": [
      "600"
    ], 
    "targetFormula": "(!fb:amusement_parks.ride.duration fb:en.haunted_mansion)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.01p79p fb:amusement_parks.ride.duration ?x1 } LIMIT 9999", 
    "utterance": "how long is the haunted mansion ride at disneyland", 
    "id": 519
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x3 ?x3name WHERE { ?x1 fb:tv.tv_regular_personal_appearance.appearance_type fb:en.newscaster . FILTER (?x1 != fb:en.newscaster) . ?x1 fb:tv.tv_regular_personal_appearance.program fb:en.cbs_evening_news . FILTER (?x1 != fb:en.cbs_evening_news) . FILTER (xsd:dateTime(?x2) >= xsd:dateTime(\"1948\"^^xsd:datetime)) . FILTER (xsd:dateTime(?x2) < xsd:dateTime(\"1949\"^^xsd:datetime)) . ?x1 fb:tv.tv_regular_personal_appearance.from ?x2 . FILTER (?x1 != \"1948\"^^xsd:datetime) . ?x1 fb:tv.tv_regular_personal_appearance.person ?x3 . OPTIONAL { ?x3 fb:type.object.name ?x3name } } LIMIT 9999", 
    "result": [
      "Douglas Edwards"
    ], 
    "targetFormula": "(!fb:tv.tv_regular_personal_appearance.person (and (and ((lambda x (fb:tv.tv_regular_personal_appearance.appearance_type (var x))) fb:en.newscaster) ((lambda x (fb:tv.tv_regular_personal_appearance.program (var x))) fb:en.cbs_evening_news)) ((lambda x (fb:tv.tv_regular_personal_appearance.from (var x))) (date 1948 -1 -1))))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x3 ?x3name WHERE { ?x1 fb:tv.tv_regular_personal_appearance.appearance_type fb:m.025m070 . FILTER (?x1 != fb:m.025m070) . ?x1 fb:tv.tv_regular_personal_appearance.program fb:m.01bndp . FILTER (?x1 != fb:m.01bndp) . FILTER (xsd:dateTime(?x2) >= xsd:dateTime(\"1948\"^^xsd:datetime)) . FILTER (xsd:dateTime(?x2) < xsd:dateTime(\"1949\"^^xsd:datetime)) . ?x1 fb:tv.tv_regular_personal_appearance.from ?x2 . FILTER (?x1 != \"1948\"^^xsd:datetime) . ?x1 fb:tv.tv_regular_personal_appearance.person ?x3 . OPTIONAL { ?x3 fb:type.object.name ?x3name } } LIMIT 9999", 
    "utterance": "who was the newscaster in 1948 on cbs evening news", 
    "id": 520
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 ?x2name WHERE { ?x1 fb:education.academic_post.person fb:en.marshall_hall . FILTER (?x1 != fb:en.marshall_hall) . ?x1 fb:education.academic_post.position_or_title fb:en.professor . FILTER (?x1 != fb:en.professor) . ?x1 fb:education.academic_post.institution ?x2 . OPTIONAL { ?x2 fb:type.object.name ?x2name } } LIMIT 9999", 
    "result": [
      "California Institute of Technology", 
      "Ohio State University"
    ], 
    "targetFormula": "(!fb:education.academic_post.institution (and ((lambda x (fb:education.academic_post.person (var x))) fb:en.marshall_hall) ((lambda x (fb:education.academic_post.position_or_title (var x))) fb:en.professor)))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 ?x2name WHERE { ?x1 fb:education.academic_post.person fb:m.0ktbrq . FILTER (?x1 != fb:m.0ktbrq) . ?x1 fb:education.academic_post.position_or_title fb:m.016fly . FILTER (?x1 != fb:m.016fly) . ?x1 fb:education.academic_post.institution ?x2 . OPTIONAL { ?x2 fb:type.object.name ?x2name } } LIMIT 9999", 
    "utterance": "at what institutions was marshall hall a professor", 
    "id": 521
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:en.henry_aaron fb:baseball.baseball_player.hall_of_fame_induction ?x1 } LIMIT 9999", 
    "result": [
      "1982-08-01"
    ], 
    "targetFormula": "(!fb:baseball.baseball_player.hall_of_fame_induction fb:en.henry_aaron)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.03q8y fb:baseball.baseball_player.hall_of_fame_induction ?x1 } LIMIT 9999", 
    "utterance": "when was hank aaron inducted into the hall of fame", 
    "id": 522
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x3 WHERE { ?x1 fb:award.ranking.list fb:en.fortune_500 . FILTER (?x1 != fb:en.fortune_500) . FILTER (xsd:dateTime(?x2) >= xsd:dateTime(\"2010\"^^xsd:datetime)) . FILTER (xsd:dateTime(?x2) < xsd:dateTime(\"2011\"^^xsd:datetime)) . ?x1 fb:award.ranking.year ?x2 . FILTER (?x1 != \"2010\"^^xsd:datetime) . ?x1 fb:award.ranking.item fb:en.target_corporation . FILTER (?x1 != fb:en.target_corporation) . ?x1 fb:award.ranking.rank ?x3 } LIMIT 9999", 
    "result": [], 
    "targetFormula": "(!fb:award.ranking.rank (and (and ((lambda x (fb:award.ranking.list (var x))) fb:en.fortune_500) ((lambda x (fb:award.ranking.year (var x))) (date 2010 -1 -1))) ((lambda x (fb:award.ranking.item (var x))) fb:en.target_corporation)))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x3 WHERE { ?x1 fb:award.ranking.list fb:m.01pd60 . FILTER (?x1 != fb:m.01pd60) . FILTER (xsd:dateTime(?x2) >= xsd:dateTime(\"2010\"^^xsd:datetime)) . FILTER (xsd:dateTime(?x2) < xsd:dateTime(\"2011\"^^xsd:datetime)) . ?x1 fb:award.ranking.year ?x2 . FILTER (?x1 != \"2010\"^^xsd:datetime) . ?x1 fb:award.ranking.item fb:m.01b39j . FILTER (?x1 != fb:m.01b39j) . ?x1 fb:award.ranking.rank ?x3 } LIMIT 9999", 
    "utterance": "what was target 's rank in the fortune 500 in 2010", 
    "id": 523
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:en.hubble_space_telescope fb:spaceflight.satellite.dry_mass_kg ?x1 } LIMIT 9999", 
    "result": [
      "11110"
    ], 
    "targetFormula": "(!fb:spaceflight.satellite.dry_mass_kg fb:en.hubble_space_telescope)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.0b0m2 fb:spaceflight.satellite.dry_mass_kg ?x1 } LIMIT 9999", 
    "utterance": "what is the dry mass of the hubble space telescope", 
    "id": 525
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { fb:m.0j9by57 fb:library.public_library.address ?x1 . FILTER (?x1 != fb:m.0j9by57) . ?x1 fb:location.mailing_address.street_address ?x2 } LIMIT 9999", 
    "result": [
      "1449 Center Avenue"
    ], 
    "targetFormula": "(!fb:location.mailing_address.street_address ((lambda x (!fb:library.public_library.address (var x))) fb:m.0j9by57))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { fb:m.0j9by57 fb:library.public_library.address ?x1 . FILTER (?x1 != fb:m.0j9by57) . ?x1 fb:location.mailing_address.street_address ?x2 } LIMIT 9999", 
    "utterance": "what is the address of the mitchell public library", 
    "id": 526
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x3 WHERE { { SELECT DISTINCT count(?x1) AS ?x3 WHERE { ?x2 fb:tv.regular_tv_appearance.actor fb:en.jack_albertson . FILTER (?x2 != fb:en.jack_albertson) . ?x2 fb:tv.regular_tv_appearance.character ?x1 } } } LIMIT 9999", 
    "result": [
      "2"
    ], 
    "targetFormula": "(count (!fb:tv.regular_tv_appearance.character ((lambda x (fb:tv.regular_tv_appearance.actor (var x))) fb:en.jack_albertson)))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x3 WHERE { { SELECT DISTINCT count(?x1) AS ?x3 WHERE { ?x2 fb:tv.regular_tv_appearance.actor fb:m.0hw6_ . FILTER (?x2 != fb:m.0hw6_) . ?x2 fb:tv.regular_tv_appearance.character ?x1 } } } LIMIT 9999", 
    "utterance": "how many starring tv roles did jack albertson have", 
    "id": 527
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x3 WHERE { { SELECT DISTINCT count(?x1) AS ?x3 WHERE { ?x2 fb:media_common.dedication.dedicated_to fb:en.joseph_haydn . FILTER (?x2 != fb:en.joseph_haydn) . ?x2 fb:media_common.dedication.dedicated_by fb:en.wolfgang_amadeus_mozart . FILTER (?x2 != fb:en.wolfgang_amadeus_mozart) . ?x2 fb:media_common.dedication.work_dedicated ?x1 } } } LIMIT 9999", 
    "result": [
      "6"
    ], 
    "targetFormula": "(count (!fb:media_common.dedication.work_dedicated (and ((lambda x (fb:media_common.dedication.dedicated_to (var x))) fb:en.joseph_haydn) ((lambda x (fb:media_common.dedication.dedicated_by (var x))) fb:en.wolfgang_amadeus_mozart))))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x3 WHERE { { SELECT DISTINCT count(?x1) AS ?x3 WHERE { ?x2 fb:media_common.dedication.dedicated_to fb:m.043d4 . FILTER (?x2 != fb:m.043d4) . ?x2 fb:media_common.dedication.dedicated_by fb:m.082db . FILTER (?x2 != fb:m.082db) . ?x2 fb:media_common.dedication.work_dedicated ?x1 } } } LIMIT 9999", 
    "utterance": "how many works did mozart dedicate to joseph haydn", 
    "id": 528
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:en.collins_class_submarine fb:boats.ship_class.max_speed_knots ?x1 } LIMIT 9999", 
    "result": [
      "21"
    ], 
    "targetFormula": "(!fb:boats.ship_class.max_speed_knots fb:en.collins_class_submarine)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.03dn33 fb:boats.ship_class.max_speed_knots ?x1 } LIMIT 9999", 
    "utterance": "what is the max speed of a collins class submarine", 
    "id": 529
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 ?x2name WHERE { ?x1 fb:aviation.aircraft_ownership_count.aircraft_model fb:en.f-5_freedom_fighter . FILTER (?x1 != fb:en.f-5_freedom_fighter) . ?x1 fb:aviation.aircraft_ownership_count.aircraft_owner ?x2 . OPTIONAL { ?x2 fb:type.object.name ?x2name } } LIMIT 9999", 
    "result": [
      "United States Navy", 
      "United States Air Force", 
      "Philippine Air Force", 
      "Brazilian Air Force", 
      "Vietnam Air Force"
    ], 
    "targetFormula": "(!fb:aviation.aircraft_ownership_count.aircraft_owner ((lambda x (fb:aviation.aircraft_ownership_count.aircraft_model (var x))) fb:en.f-5_freedom_fighter))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 ?x2name WHERE { ?x1 fb:aviation.aircraft_ownership_count.aircraft_model fb:m.02_31 . FILTER (?x1 != fb:m.02_31) . ?x1 fb:aviation.aircraft_ownership_count.aircraft_owner ?x2 . OPTIONAL { ?x2 fb:type.object.name ?x2name } } LIMIT 9999", 
    "utterance": "what military branches use the f-5 freedom fighter", 
    "id": 530
  }
]
