[
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { fb:en.moon fb:fictional_universe.fictional_setting.works_set_here ?x1 } } } LIMIT 9999", 
    "result": [
      "6"
    ], 
    "targetFormula": "(count (!fb:fictional_universe.fictional_setting.works_set_here fb:en.moon))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { fb:m.04wv_ fb:fictional_universe.fictional_setting.works_set_here ?x1 } } } LIMIT 9999", 
    "utterance": "how many works have been set on the moon", 
    "id": 323
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:en.airspeed_oxford fb:aviation.aircraft_model.maiden_flight ?x1 } LIMIT 9999", 
    "result": [
      "1937-06-19"
    ], 
    "targetFormula": "(!fb:aviation.aircraft_model.maiden_flight fb:en.airspeed_oxford)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.02r0bv fb:aviation.aircraft_model.maiden_flight ?x1 } LIMIT 9999", 
    "utterance": "when was the airspeed oxford first flown", 
    "id": 324
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.knickerbockers fb:fashion.garment.specialization_of ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Trousers"
    ], 
    "targetFormula": "(!fb:fashion.garment.specialization_of fb:en.knickerbockers)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.0dmnzf fb:fashion.garment.specialization_of ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what type of clothing are knickerbockers", 
    "id": 325
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { fb:en.nintendo_ds fb:cvg.cvg_platform.games_on_this_platform ?x1 } } } LIMIT 9999", 
    "result": [
      "1710"
    ], 
    "targetFormula": "(count (!fb:cvg.cvg_platform.games_on_this_platform fb:en.nintendo_ds))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { fb:m.028jm0 fb:cvg.cvg_platform.games_on_this_platform ?x1 } } } LIMIT 9999", 
    "utterance": "how many games are there for nintendo ds", 
    "id": 326
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:location.location fb:freebase.type_profile.instance_count ?x1 } LIMIT 9999", 
    "result": [], 
    "targetFormula": "(!fb:freebase.type_profile.instance_count fb:location.location)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:location.location fb:freebase.type_profile.instance_count ?x1 } LIMIT 9999", 
    "utterance": "how many locations are there on freebase", 
    "id": 327
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.the_last_minute_blog fb:internet.blog.focus ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Photography", 
      "Video", 
      "Technology", 
      "Politics"
    ], 
    "targetFormula": "(!fb:internet.blog.focus fb:en.the_last_minute_blog)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.02hykwc fb:internet.blog.focus ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what's the focus of the last minute blog", 
    "id": 328
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.sonic_the_hedgehog fb:fictional_universe.fictional_character.powers_or_abilities ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Superhuman speed", 
      "Superhuman strength", 
      "Teleportation", 
      "Chaos Control"
    ], 
    "targetFormula": "(!fb:fictional_universe.fictional_character.powers_or_abilities fb:en.sonic_the_hedgehog)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.07656 fb:fictional_universe.fictional_character.powers_or_abilities ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what powers does sonic the hedgehog have", 
    "id": 329
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x3 WHERE { { SELECT DISTINCT count(?x1) AS ?x3 WHERE { ?x2 fb:award.award_honor.award fb:en.peabody_award . FILTER (?x2 != fb:en.peabody_award) . ?x2 fb:award.award_honor.award_winner ?x1 } } } LIMIT 9999", 
    "result": [
      "2299"
    ], 
    "targetFormula": "(count (!fb:award.award_honor.award_winner ((lambda x (fb:award.award_honor.award (var x))) fb:en.peabody_award)))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x3 WHERE { { SELECT DISTINCT count(?x1) AS ?x3 WHERE { ?x2 fb:award.award_honor.award fb:m.0m7yy . FILTER (?x2 != fb:m.0m7yy) . ?x2 fb:award.award_honor.award_winner ?x1 } } } LIMIT 9999", 
    "utterance": "how many peabody award winners are there", 
    "id": 330
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.0kk92b fb:common.image.size ?x1 } LIMIT 9999", 
    "result": [
      "m.0kjkn6"
    ], 
    "targetFormula": "(!fb:common.image.size fb:m.0kk92b)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.0kk92b fb:common.image.size ?x1 } LIMIT 9999", 
    "utterance": "how tall is the you only live once image", 
    "id": 331
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { fb:en.canon fb:digicams.digital_camera_manufacturer.cameras ?x1 } } } LIMIT 9999", 
    "result": [
      "130"
    ], 
    "targetFormula": "(count (!fb:digicams.digital_camera_manufacturer.cameras fb:en.canon))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { fb:m.01bvx1 fb:digicams.digital_camera_manufacturer.cameras ?x1 } } } LIMIT 9999", 
    "utterance": "how many canon digital cameras are there", 
    "id": 332
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { fb:en.victoria_of_the_united_kingdom fb:royalty.chivalric_order_founder.orders_founded ?x1 } } } LIMIT 9999", 
    "result": [
      "3"
    ], 
    "targetFormula": "(count (!fb:royalty.chivalric_order_founder.orders_founded fb:en.victoria_of_the_united_kingdom))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { fb:m.0cw10 fb:royalty.chivalric_order_founder.orders_founded ?x1 } } } LIMIT 9999", 
    "utterance": "how many orders did queen victoria found", 
    "id": 333
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { fb:en.omarion_grandberry fb:music.artist.label ?x1 } } } LIMIT 9999", 
    "result": [
      "13"
    ], 
    "targetFormula": "(count (!fb:music.artist.label fb:en.omarion_grandberry))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { fb:m.019g40 fb:music.artist.label ?x1 } } } LIMIT 9999", 
    "utterance": "how many record labels was omarion under", 
    "id": 334
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { ?x1 fb:tv.tv_program.program_creator fb:en.hugh_laurie . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "A Bit of Fry and Laurie", 
      "The Crystal Cube"
    ], 
    "targetFormula": "(fb:tv.tv_program.program_creator fb:en.hugh_laurie)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { ?x1 fb:tv.tv_program.program_creator fb:m.013pk3 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what tv programs has hugh laurie created", 
    "id": 335
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.the_source_report fb:radio.radio_program.subjects ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Religion"
    ], 
    "targetFormula": "(!fb:radio.radio_program.subjects fb:en.the_source_report)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.065tq5k fb:radio.radio_program.subjects ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what is the subject of the source report", 
    "id": 336
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.kepler_mission fb:spaceflight.satellite.launch_site ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Cape Canaveral Air Force Station Space Launch Complex 17"
    ], 
    "targetFormula": "(!fb:spaceflight.satellite.launch_site fb:en.kepler_mission)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.03gzbb fb:spaceflight.satellite.launch_site ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "where was the kepler spacecraft launched", 
    "id": 337
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { fb:en.omarion_grandberry fb:common.topic.alias ?x1 } } } LIMIT 9999", 
    "result": [
      "11"
    ], 
    "targetFormula": "(count (!fb:common.topic.alias fb:en.omarion_grandberry))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { fb:m.019g40 fb:common.topic.alias ?x1 } } } LIMIT 9999", 
    "utterance": "how many other names is omarion known by", 
    "id": 338
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { ?x1 fb:film.film_cut.film fb:en.meet_the_parents . FILTER (?x1 != fb:en.meet_the_parents) . ?x1 fb:film.film_cut.runtime ?x2 } LIMIT 9999", 
    "result": [
      "108", 
      "103", 
      "107"
    ], 
    "targetFormula": "(!fb:film.film_cut.runtime ((lambda x (fb:film.film_cut.film (var x))) fb:en.meet_the_parents))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { ?x1 fb:film.film_cut.film fb:m.033fqh . FILTER (?x1 != fb:m.033fqh) . ?x1 fb:film.film_cut.runtime ?x2 } LIMIT 9999", 
    "utterance": "what is the runtime for meet the parents", 
    "id": 339
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.omarion_grandberry fb:music.artist.origin ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Los Angeles", 
      "Florida"
    ], 
    "targetFormula": "(!fb:music.artist.origin fb:en.omarion_grandberry)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.019g40 fb:music.artist.origin ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "where did omarion 's musical career begin", 
    "id": 340
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { fb:en.oxford_properties fb:business.shopping_center_owner.shopping_centers_owned ?x1 } } } LIMIT 9999", 
    "result": [
      "9"
    ], 
    "targetFormula": "(count (!fb:business.shopping_center_owner.shopping_centers_owned fb:en.oxford_properties))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { fb:m.03m6ky2 fb:business.shopping_center_owner.shopping_centers_owned ?x1 } } } LIMIT 9999", 
    "utterance": "how many malls does oxford properties own", 
    "id": 342
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x3 WHERE { { SELECT DISTINCT count(?x1) AS ?x3 WHERE { fb:en.new_york_stock_exchange_inc fb:finance.stock_exchange.companies_traded ?x2 . ?x2 fb:business.stock_ticker_symbol.ticker_symbol ?x1 } } } LIMIT 9999", 
    "result": [
      "2628"
    ], 
    "targetFormula": "(count (!fb:business.stock_ticker_symbol.ticker_symbol (!fb:finance.stock_exchange.companies_traded fb:en.new_york_stock_exchange_inc)))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x3 WHERE { { SELECT DISTINCT count(?x1) AS ?x3 WHERE { fb:m.05drh fb:finance.stock_exchange.companies_traded ?x2 . ?x2 fb:business.stock_ticker_symbol.ticker_symbol ?x1 } } } LIMIT 9999", 
    "utterance": "how many companies are traded by the nyse", 
    "id": 343
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 ?x2name WHERE { ?x1 fb:government.political_party_tenure.politician fb:en.grover_cleveland . FILTER (?x1 != fb:en.grover_cleveland) . ?x1 fb:government.political_party_tenure.party ?x2 . OPTIONAL { ?x2 fb:type.object.name ?x2name } } LIMIT 9999", 
    "result": [
      "Democratic Party", 
      "National Democratic Party"
    ], 
    "targetFormula": "(!fb:government.political_party_tenure.party ((lambda x (fb:government.political_party_tenure.politician (var x))) fb:en.grover_cleveland))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 ?x2name WHERE { ?x1 fb:government.political_party_tenure.politician fb:m.038w8 . FILTER (?x1 != fb:m.038w8) . ?x1 fb:government.political_party_tenure.party ?x2 . OPTIONAL { ?x2 fb:type.object.name ?x2name } } LIMIT 9999", 
    "utterance": "what party did grover cleveland belong to", 
    "id": 344
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.leadbelly fb:influence.influence_node.influenced ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Garret Schuelke", 
      "Bob Dylan", 
      "Van Morrison", 
      "Woody Guthrie"
    ], 
    "targetFormula": "(!fb:influence.influence_node.influenced fb:en.leadbelly)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.01wxlnl fb:influence.influence_node.influenced ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what artists are influenced by lead belly", 
    "id": 345
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 ?x2name WHERE { ?x1 fb:music.group_membership.group fb:en.the_soul_stirrers . FILTER (?x1 != fb:en.the_soul_stirrers) . ?x1 fb:music.group_membership.member ?x2 . OPTIONAL { ?x2 fb:type.object.name ?x2name } } LIMIT 9999", 
    "result": [
      "Johnnie Taylor", 
      "Sam Cooke", 
      "Paul Foster", 
      "Lou Rawls", 
      "R. H. Harris", 
      "Michael Grady Jr.", 
      "Ben Odom", 
      "Willie Rogers", 
      "Rev. Julius Cheeks", 
      "Gene Stewart", 
      "James Phelps"
    ], 
    "targetFormula": "(!fb:music.group_membership.member ((lambda x (fb:music.group_membership.group (var x))) fb:en.the_soul_stirrers))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 ?x2name WHERE { ?x1 fb:music.group_membership.group fb:m.016586 . FILTER (?x1 != fb:m.016586) . ?x1 fb:music.group_membership.member ?x2 . OPTIONAL { ?x2 fb:type.object.name ?x2name } } LIMIT 9999", 
    "utterance": "who were the members of the soul stirrers", 
    "id": 346
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { fb:en.africa fb:base.dinosaur.dinosaur_location.dinosaur_s ?x1 } } } LIMIT 9999", 
    "result": [
      "67"
    ], 
    "targetFormula": "(count (!fb:base.dinosaur.dinosaur_location.dinosaur_s fb:en.africa))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { fb:m.0dg3n1 fb:base.dinosaur.dinosaur_location.dinosaur_s ?x1 } } } LIMIT 9999", 
    "utterance": "how many dinosaur species are from africa", 
    "id": 347
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.019zhn fb:location.location.containedby ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Mobile", 
      "Alabama"
    ], 
    "targetFormula": "(!fb:location.location.containedby fb:m.019zhn)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.019zhn fb:location.location.containedby ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "where is the uss alabama currently moored", 
    "id": 348
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.1948_summer_olympics fb:olympics.olympic_games.host_city ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "London"
    ], 
    "targetFormula": "(!fb:olympics.olympic_games.host_city fb:en.1948_summer_olympics)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.0blg2 fb:olympics.olympic_games.host_city ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what city hosted the 1948 summer olympics", 
    "id": 349
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:en.mexican_federal_highway_1 fb:transportation.road.length ?x1 } LIMIT 9999", 
    "result": [
      "1711"
    ], 
    "targetFormula": "(!fb:transportation.road.length fb:en.mexican_federal_highway_1)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.07x1kd fb:transportation.road.length ?x1 } LIMIT 9999", 
    "utterance": "how long is the mexican federal highway 1", 
    "id": 350
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.down_quark fb:physics.particle.generation ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "First generation"
    ], 
    "targetFormula": "(!fb:physics.particle.generation fb:en.down_quark)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.01jzrd fb:physics.particle.generation ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what generation of matter is a down quark", 
    "id": 351
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { ?x1 fb:medicine.cancer_center.comprehensive true } } } LIMIT 9999", 
    "result": [
      "42"
    ], 
    "targetFormula": "(count (fb:medicine.cancer_center.comprehensive true))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { ?x1 fb:medicine.cancer_center.comprehensive true } } } LIMIT 9999", 
    "utterance": "how many cancer centers are comprehensive", 
    "id": 352
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 ?x2name WHERE { ?x1 fb:fashion.designer_label_association.designer fb:en.julien_fournie . FILTER (?x1 != fb:en.julien_fournie) . ?x1 fb:fashion.designer_label_association.label ?x2 . OPTIONAL { ?x2 fb:type.object.name ?x2name } } LIMIT 9999", 
    "result": [
      "Ramosport"
    ], 
    "targetFormula": "(!fb:fashion.designer_label_association.label ((lambda x (fb:fashion.designer_label_association.designer (var x))) fb:en.julien_fournie))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 ?x2name WHERE { ?x1 fb:fashion.designer_label_association.designer fb:m.0d9ys1 . FILTER (?x1 != fb:m.0d9ys1) . ?x1 fb:fashion.designer_label_association.label ?x2 . OPTIONAL { ?x2 fb:type.object.name ?x2name } } LIMIT 9999", 
    "utterance": "what label does julien fournie design for", 
    "id": 353
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:en.white_house fb:architecture.building.floors ?x1 } LIMIT 9999", 
    "result": [
      "4"
    ], 
    "targetFormula": "(!fb:architecture.building.floors fb:en.white_house)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.081sq fb:architecture.building.floors ?x1 } LIMIT 9999", 
    "utterance": "how many floors does the white house have", 
    "id": 355
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { fb:en.sesame_street fb:tv.tv_program.episodes ?x1 } } } LIMIT 9999", 
    "result": [
      "2864"
    ], 
    "targetFormula": "(count (!fb:tv.tv_program.episodes fb:en.sesame_street))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { fb:m.0cwrr fb:tv.tv_program.episodes ?x1 } } } LIMIT 9999", 
    "utterance": "how many episodes does sesame street have", 
    "id": 356
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:en.mark_vii_monorail fb:rail.locomotive_class.introduced ?x1 } LIMIT 9999", 
    "result": [
      "2008"
    ], 
    "targetFormula": "(!fb:rail.locomotive_class.introduced fb:en.mark_vii_monorail)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.06w7jwl fb:rail.locomotive_class.introduced ?x1 } LIMIT 9999", 
    "utterance": "when was the mark vii monorail introduced", 
    "id": 357
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.market-frankford_line fb:metropolitan_transit.transit_line.stops ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "11th Street", 
      "34th Street", 
      "56th Street", 
      "Frankford Transportation Center", 
      "13th Street", 
      "40th Street", 
      "69th Street Transportation Center", 
      "Tioga", 
      "8th Street", 
      "Allegheny", 
      "Spring Garden", 
      "Girard", 
      "30th Street Station", 
      "46th Street", 
      "63rd Street", 
      "60th Street", 
      "52nd Street", 
      "15th Street", 
      "York\u2013Dauphin", 
      "Huntingdon", 
      "Millbourne", 
      "2nd Street", 
      "Erie\u2013Torresdale", 
      "Margaret\u2013Orthodox", 
      "Church", 
      "Berks", 
      "5th Street", 
      "Somerset"
    ], 
    "targetFormula": "(!fb:metropolitan_transit.transit_line.stops fb:en.market-frankford_line)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.04_60f fb:metropolitan_transit.transit_line.stops ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "where does the market-frankford line stop", 
    "id": 358
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x3 ?x3name WHERE { FILTER (xsd:dateTime(?x2) >= xsd:dateTime(\"1968\"^^xsd:datetime)) . FILTER (xsd:dateTime(?x2) < xsd:dateTime(\"1969\"^^xsd:datetime)) . ?x1 fb:award.award_honor.year ?x2 . FILTER (?x1 != \"1968\"^^xsd:datetime) . ?x1 fb:award.award_honor.award_winner fb:en.jack_albertson . FILTER (?x1 != fb:en.jack_albertson) . ?x1 fb:award.award_honor.award ?x3 . OPTIONAL { ?x3 fb:type.object.name ?x3name } } LIMIT 9999", 
    "result": [
      "Academy Award for  Actor in a Supporting Role"
    ], 
    "targetFormula": "(!fb:award.award_honor.award (and ((lambda x (fb:award.award_honor.year (var x))) (date 1968 -1 -1)) ((lambda x (fb:award.award_honor.award_winner (var x))) fb:en.jack_albertson)))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x3 ?x3name WHERE { FILTER (xsd:dateTime(?x2) >= xsd:dateTime(\"1968\"^^xsd:datetime)) . FILTER (xsd:dateTime(?x2) < xsd:dateTime(\"1969\"^^xsd:datetime)) . ?x1 fb:award.award_honor.year ?x2 . FILTER (?x1 != \"1968\"^^xsd:datetime) . ?x1 fb:award.award_honor.award_winner fb:m.0hw6_ . FILTER (?x1 != fb:m.0hw6_) . ?x1 fb:award.award_honor.award ?x3 . OPTIONAL { ?x3 fb:type.object.name ?x3name } } LIMIT 9999", 
    "utterance": "what award did jack albertson win in 1968", 
    "id": 359
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x3 ?x3name WHERE { FILTER (xsd:dateTime(?x2) >= xsd:dateTime(\"2002\"^^xsd:datetime)) . FILTER (xsd:dateTime(?x2) < xsd:dateTime(\"2003\"^^xsd:datetime)) . ?x1 fb:basketball.basketball_historical_coach_position.from ?x2 . FILTER (?x1 != \"2002\"^^xsd:datetime) . ?x1 fb:basketball.basketball_historical_coach_position.coach fb:en.rick_carlisle . FILTER (?x1 != fb:en.rick_carlisle) . ?x1 fb:basketball.basketball_historical_coach_position.team ?x3 . OPTIONAL { ?x3 fb:type.object.name ?x3name } } LIMIT 9999", 
    "result": [], 
    "targetFormula": "(!fb:basketball.basketball_historical_coach_position.team (and ((lambda x (fb:basketball.basketball_historical_coach_position.from (var x))) (date 2002 -1 -1)) ((lambda x (fb:basketball.basketball_historical_coach_position.coach (var x))) fb:en.rick_carlisle)))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x3 ?x3name WHERE { FILTER (xsd:dateTime(?x2) >= xsd:dateTime(\"2002\"^^xsd:datetime)) . FILTER (xsd:dateTime(?x2) < xsd:dateTime(\"2003\"^^xsd:datetime)) . ?x1 fb:basketball.basketball_historical_coach_position.from ?x2 . FILTER (?x1 != \"2002\"^^xsd:datetime) . ?x1 fb:basketball.basketball_historical_coach_position.coach fb:m.02zxw4 . FILTER (?x1 != fb:m.02zxw4) . ?x1 fb:basketball.basketball_historical_coach_position.team ?x3 . OPTIONAL { ?x3 fb:type.object.name ?x3name } } LIMIT 9999", 
    "utterance": "what team did rick carlisle coach in 2002", 
    "id": 360
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:en.gloster_meteor fb:aviation.aircraft_model.maximum_speed_km_h ?x1 } LIMIT 9999", 
    "result": [
      "965.6"
    ], 
    "targetFormula": "(!fb:aviation.aircraft_model.maximum_speed_km_h fb:en.gloster_meteor)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:m.0bqpz fb:aviation.aircraft_model.maximum_speed_km_h ?x1 } LIMIT 9999", 
    "utterance": "what is the max speed of a gloster meteor", 
    "id": 361
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { fb:en.sesame_street fb:tv.tv_program.spin_offs ?x1 } } } LIMIT 9999", 
    "result": [
      "19"
    ], 
    "targetFormula": "(count (!fb:tv.tv_program.spin_offs fb:en.sesame_street))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { fb:m.0cwrr fb:tv.tv_program.spin_offs ?x1 } } } LIMIT 9999", 
    "utterance": "how many spin offs does sesame street have", 
    "id": 362
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:film.actor fb:freebase.type_profile.instance_count ?x1 } LIMIT 9999", 
    "result": [], 
    "targetFormula": "(!fb:freebase.type_profile.instance_count fb:film.actor)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 WHERE { fb:film.actor fb:freebase.type_profile.instance_count ?x1 } LIMIT 9999", 
    "utterance": "how many film actors are there on freebase", 
    "id": 363
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.a_wrinkle_in_time fb:book.written_work.part_of_series ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Time Quartet"
    ], 
    "targetFormula": "(!fb:book.written_work.part_of_series fb:en.a_wrinkle_in_time)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.02q83r fb:book.written_work.part_of_series ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "what series is a wrinkle in time a part of", 
    "id": 364
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:en.runaways fb:comic_books.comic_book_series.created_by ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "result": [
      "Brian K. Vaughan"
    ], 
    "targetFormula": "(!fb:comic_books.comic_book_series.created_by fb:en.runaways)", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x1 ?x1name WHERE { fb:m.046_hm fb:comic_books.comic_book_series.created_by ?x1 . OPTIONAL { ?x1 fb:type.object.name ?x1name } } LIMIT 9999", 
    "utterance": "who created the runaways comic book series", 
    "id": 365
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { fb:en.j_r_r_tolkien fb:language.language_creator.languages_created ?x1 } } } LIMIT 9999", 
    "result": [
      "10"
    ], 
    "targetFormula": "(count (!fb:language.language_creator.languages_created fb:en.j_r_r_tolkien))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x2 WHERE { { SELECT DISTINCT count(?x1) AS ?x2 WHERE { fb:m.041h0 fb:language.language_creator.languages_created ?x1 } } } LIMIT 9999", 
    "utterance": "how many languages has jrr tolkein created", 
    "id": 366
  }, 
  {
    "targetSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x3 WHERE { { SELECT DISTINCT count(?x1) AS ?x3 WHERE { ?x2 fb:interests.collection.collector fb:en.barry_halper . FILTER (?x2 != fb:en.barry_halper) . ?x2 fb:interests.collection.category ?x1 } } } LIMIT 9999", 
    "result": [
      "8"
    ], 
    "targetFormula": "(count (!fb:interests.collection.category ((lambda x (fb:interests.collection.collector (var x))) fb:en.barry_halper)))", 
    "targetOrigSparql": "PREFIX fb: <http://rdf.freebase.com/ns/> SELECT DISTINCT ?x3 WHERE { { SELECT DISTINCT count(?x1) AS ?x3 WHERE { ?x2 fb:interests.collection.collector fb:m.03c_7_w . FILTER (?x2 != fb:m.03c_7_w) . ?x2 fb:interests.collection.category ?x1 } } } LIMIT 9999", 
    "utterance": "how many collections did barry halper have", 
    "id": 367
  }
]
